<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN//2.0">
<HTML>
<HEAD>
<!-- Document generated by Grif -->
<TITLE>Tamayaman-F</TITLE>
<LINK HREF="Tamayaman-F.toc.html" REL="PARENT">
</HEAD>
<BODY>
<PRE>
Reference: <EM>Tamaya V0.95</EM></PRE>
<PRE>
Date: 20 mars 1996</PRE>

<H1>Tamaya Manuel utilisateur</H1>
<ADDRESS>Vincent Quint</ADDRESS>
<ADDRESS>C&eacute;cile Roisin</ADDRESS>
<ADDRESS>Ir&egrave;ne Vatton</ADDRESS>
<ADDRESS>Daniel Veillard</ADDRESS>

<HR>


<H5>AVERTISSEMENT</H5>

<P>La version actuelle de Tamaya est exp&eacute;rimentale. Elle offre des
constructions HTML3 qui ne sont pas encore standardis&eacute;es et ne sont pas
interpr&eacute;t&eacute;es par tous les clients du World Wide Web.</P>

<P>La partie publication de Tamaya n'est pas termin&eacute;e et des
interventions manuelles seront s&ucirc;rement n&eacute;cessaires quand
l'utilisateur voudra publier ses documents sur le Web.</P>


<P> </P>

<P>Tamaya est un &eacute;diteur de documents HTML branch&eacute; sur le World
Wide Web. Il permet de cr&eacute;er de nouvelles pages Web, mais aussi d'aller
chercher des pages existantes et de les modifier.</P>

<H2><A NAME="secta1">1</A> Les documents vus par Tamaya</H2>

<P>Tamaya est construit sur les bases de l'&eacute;diteur de documents
structur&eacute;s Thot. Cette application utilise donc la m&ecirc;me approche
pour repr&eacute;senter les documents HTML qu'il manipule : un document est
repr&eacute;sent&eacute; par sa <EM>structure logique</EM>,
c'est-&agrave;-dire son organisation en &eacute;l&eacute;ments comme des
titres, des listes, des paragraphes, etc. Ces &eacute;l&eacute;ments forment
des structures hi&eacute;rarchiques qui rendent compte des relations
d'inclusion et d'ordre entre les &eacute;l&eacute;ments. Le texte et les
images constituent les &eacute;l&eacute;ments terminaux de ces structures
hi&eacute;rarchiques.</P>

<H2><A NAME="secta2">2</A> Lancement et fermeture de l'&eacute;diteur</H2>

<P>La syntaxe de la commande de lancement de l'&eacute;diteur est la suivante
:</P>

<PRE>
tamaya {URL | file]
</PRE>

<P>Le param&egrave;tre <TT>URL</TT> ou <TT>file</TT> est optionnel. Si ce
param&egrave;tre n'est pas fourni, l'&eacute;diteur d&eacute;marre en ouvrant
la page Web de description de l'&eacute;diteur Tamaya.</P>

<P>La commande de lancement de l'&eacute;diteur produit le r&eacute;sultat
suivant sur l'&eacute;cran de l'utilisateur :</P>

<UL>
<LI>Cr&eacute;ation d'une fen&ecirc;tre de dialogue en bas &agrave; droite de
l'&eacute;cran : c'est la fen&ecirc;tre principale de l'&eacute;diteur
(appel&eacute;e &laquo; fen&ecirc;tre Tamaya&raquo; dans la suite) dans
laquelle l'&eacute;diteur affiche les messages de dialogue (compte-rendus
d'op&eacute;ration et messages d'erreur).La barre de menu de cette
fen&ecirc;tre comporte quatre boutons :
<UL>
<LI>&laquo; Fichiers &raquo; : pour ouvrir, cr&eacute;er des documents et pour
fermer l'&eacute;diteur (voir section <A HREF="#secta3">3</A>).
<LI>&laquo; Stop &raquo; : pour stopper le transfer d'un document ou des
images d'un document.
<LI>&laquo; Claviers &raquo; : pour choisir des symboles et des
caract&egrave;res non standard (voir section <A HREF="#sectb45">4.5</A>).
<LI>&laquo; Aide &raquo; : affiche le num&eacute;ro de version de
l'&eacute;diteur. L'&eacute;diteur ne comporte pas pour le moment d'aide en
ligne.
</UL>

<LI>Cr&eacute;ation &eacute;ventuelle d'une fen&ecirc;tre pour l'affichage du
document demand&eacute; dans la commande de lancement.
<LI>Cr&eacute;ation et ic&ocirc;nisation d'une palette de couleurs, qui permet
de colorier les documents (voir les feuilles de style dans la section <A
HREF="#secta14">14</A>).
</UL>

<H5>Fermeture de l'&eacute;diteur</H5>

<P>Pour quitter l'&eacute;diteur Tamaya, il faut s&eacute;lectionner
l'entr&eacute;e &laquo; Quitter &raquo; du menu &laquo; Fichier &raquo; de la
fen&ecirc;tre Tamaya. <B>Avant de fermer l'application, l'utilisateur doit
sauver les documents modifi&eacute;s.</B> Pour chaque document qui a
&eacute;t&eacute; modifi&eacute; depuis sa derni&egrave;re sauvegarde,
l'&eacute;diteur propose de les sauver, mais cette sauvegarde ne marche pas
dans la version courante.</P>

<H2><A NAME="secta3">3</A> <A NAME="L1882">Cr&eacute;ation, ouverture et
sauvegarde des documents</A></H2>

<P>L'&eacute;diteur Tamaya peut travailler sur plusieurs documents &agrave; la
fois. Il est donc possible d'ouvrir ou de cr&eacute;er un nouveau document
quand d'autres sont d&eacute;j&agrave; ouverts. Il y a cependant une limite au
nombre de fen&ecirc;tres et au nombre de documents ouverts
simultan&eacute;ment. Le nombre maximum de fen&ecirc;tres ouvertes par
l'&eacute;diteur est indiqu&eacute; section <A HREF="#secta16">16</A>. Si
l'&eacute;diteur ne peut ouvrir un document parce que le nombre de
fen&ecirc;tres maximum est atteint, il affiche un message : &laquo; Impossible
d'ouvrir une nouvelle fen&ecirc;tre. Fermer une autre fen&ecirc;tre &raquo;.
Il faut alors fermer une fen&ecirc;tre de document pour pouvoir ensuite
recommencer la commande d'ouverture.</P>

<H3><A NAME="sectb31">3.1</A> Chargement d'un document depuis le Web</H3>

<P>L'&eacute;diteur Tamaya est un client World Wide Web. Il peut  charger les
documents HTML ou ASCII pr&eacute;sents sur le Web, soit pour les consulter,
soit pour les &eacute;diter.</P>

<P>Pour aller chercher un document, l'utilisateur peut afficher le formulaire
de saisie propos&eacute; par l'entr&eacute;e &laquo; Ouvrir URL &raquo; du
menu &laquo; Fichiers &raquo; de la fen&ecirc;tre Tamaya. Un document peut
&ecirc;tre aussi charg&eacute; en faisant un double clic sur un lien d'un
document HTML affich&eacute; (voir la setion <A HREF="#secta7">7</A>).</P>

<H3><A NAME="sectb32">3.2</A> <A NAME="L1936">Ouverture d'un document
local</A></H3>

<P>L'entr&eacute;e &laquo; Ouvrir local &raquo; du menu &laquo; Fichiers
&raquo; de la fen&ecirc;tre Tamaya permet d'ouvrir un document qui a
&eacute;t&eacute; pr&eacute;c&eacute;demment sauv&eacute; dans un fichier Unix
local. Le choix de cette entr&eacute;e de menu affiche un formulaire &agrave;
trois champs :</P>

<UL>
<LI>Le champ &laquo; R&eacute;pertoires documents &raquo; pr&eacute;sente les
sous-r&eacute;pertoires du r&eacute;pertoire de travail Unix dans lequel on
cherche un document &agrave; ouvrir.Il suffit de cliquer avec le bouton gauche
de la souris sur le nom d'un sous-r&eacute;pertoire pour changer de
r&eacute;pertoire courant. Cette liste de sous-r&eacute;pertoires est
automatiquement mise &agrave; jour d&egrave;s que le r&eacute;pertoire de
travail change. Elle est &eacute;galement mise &agrave; jour lorsqu'on
&eacute;dite le champ &laquo; Nom du document &raquo; du m&ecirc;me formulaire
: la partie r&eacute;pertoire de ce nom d&eacute;finit le nouveau r'epertoire
de travail.
<LI>La liste  &laquo; Fichiers &raquo; permet de choisir le document &agrave;
ouvrir, simplement en cliquant sur son nom avec le bouton gauche de la souris.
Cette liste affiche tous les documents HTML contenus dans le r&eacute;pertoire
de travail. Lorsqu'on choisit un autre r&eacute;pertoire, cette liste est mise
&agrave; jour.
<LI>La zone &laquo; Nom du document &raquo; est mise &agrave; jour &agrave;
partir des choix faits dans les deux champs pr&eacute;c&eacute;dents. Elle
peut aussi &ecirc;tre &eacute;dit&eacute;e directement, par exemple pour
entrer le nom complet (r&eacute;pertoire inclus).
</UL>

<P>Lorsque le champ &laquo; Nom du document &raquo; contient le nom du fichier
voulu, il faut cliquer sur le bouton &laquo; Confirmer &raquo; pour ouvrir le
document. Si l'utiliateur choisi un nom de document qui n'existe pas dans le
r&eacute;pertoire courant, l'&eacute;diteur comprend que l'utilisateur veut
cr&eacute;er un nouveau document portant le nom indiqu&eacute; dans le
r&eacute;pertoire courant de travail.</P>

<P>Un  document local peut &ecirc;tre aussi ouvert en faisant un double clic
sur un lien d'un document local d&eacute;j&agrave; ouvert.</P>

<H3><A NAME="sectb33">3.3</A> Cr&eacute;ation d'un nouveau document</H3>

<P>La cr&eacute;ation d'un nouveau document se fait &agrave; partir de la
fen&ecirc;tre Tamaya. Lorsqu'on choisit l'entr&eacute;e &laquo; Nouveau
document &raquo; du menu &laquo; Fichiers &raquo;, l'&eacute;diteur
cr&eacute;e un nouveau document de nom &laquo; New.html &raquo; et
localis&eacute; dans le r&eacute;pertoire courant ou le dernier
r&eacute;pertoire utilis&eacute;.</P>

<P>Si l'utilisateur veut choisir le r&eacute;pertoire et le nom du fichier
HTML cr&eacute;&eacute;, il doit utiliser le formulaire d'ouverture d'un
document local. </P>

<P>Le fichier qui contiendra le document n'est pas cr&eacute;&eacute;
imm&eacute;diatement. Il le sera d&egrave;s que le document sera
sauvegard&eacute; par une commande explicite.</P>

<H3><A NAME="sectb34">3.4</A> Sauvegarde d'un document</H3>

<P>Dans la version actuelle, on doit sauver un document avant de le fermer. Il
faut pour cela utiliser le menu &laquo; Document &raquo; dans la barre de
menus qui se trouve en haut d'une des fen&ecirc;tres du document.
L'entr&eacute;e &laquo; Sauver &raquo; ou l'&eacute;quivalent clavier
<TT>Control S</TT> affiche un formulaire pour confirmer ou modifier le
r&eacute;pertoire et le nom de fichier o&ugrave; le document va &ecirc;tre
sauv&eacute;. Ce formulaire se pr&eacute;sente et fonctionne comme le
formulaire d'ouverture d'un document local (voir la section <A
HREF="#sectb32">3.2</A>).</P>

<P>Quand le document que l'utilisateur veut sauver a &eacute;t&eacute;
charg&eacute; depuis le Web, l'&eacute;diteur ne peut pas le sauver &agrave;
distance. Il propose alors de le sauver dans un fichier local. Ce fichier peut
correspondre en fait au nom local du fichier publi&eacute;, si l'utilisateur
est en train de mettre &agrave; jour les pages Web de son serveur local.</P>

<P>Dans sa version actuelle, Tamaya n'offre aucune assistance pour la
publication de documents sur le Web. L'utilisateur doit donc s'assurer que les
liens et les images de son document seront bien rang&eacute;s dans les
r&eacute;pertoires du serveur conform&eacute;ment aux URLs qu'il aura
construit. Pour faciliter la publication, il est recommand&eacute; de ranger
les fichiers HTML et les images qui constituent la documentation
publi&eacute;e dans le m&ecirc;me r&eacute;pertoire. </P>

<H3><A NAME="sectb35">3.5</A> Fermeture d'un document</H3>

<P>Lorsqu'on a fini de travailler sur un document, on peut le fermer. Il est
m&ecirc;me recommand&eacute; de faire du m&eacute;nage de temps en temps sur
son &eacute;cran quand on suit beaucoup de liens HTML. Tamaya suppose que tout
document charg&eacute; peut servir, soit pour r&eacute;cup&eacute;rer de
l'information, soit pour &eacute;tablir un nouveau lien, soit parce que la
page doit &ecirc;tre mise &agrave; jour. Tamaya limite le nombre de documents
ouverts, donc tr&egrave;s rapidement l'utilisateur doit fermer des documents
ouverts pour pouvoir en ouvrir d'autres.</P>

<P>Pour fermer un document, il faut utiliser le menu &laquo; Document &raquo;
dans la barre de menus qui se trouve en haut d'une des fen&ecirc;tres du
document et choisir l'entr&eacute;e &laquo; Fermer le document &raquo; ou
entrer le s&eacute;quence <TT>Control X Control C</TT>.</P>

<UL>
<LI>Si le document n'a pas &eacute;t&eacute; modifi&eacute; depuis qu'il a
&eacute;t&eacute; ouvert, toutes les fen&ecirc;tres de ce document se ferment
et le document est effectivement ferm&eacute;.
<LI>Si le document a &eacute;t&eacute; modifi&eacute;, un formulaire s'affiche
pour permettre de sauver le document :
<UL>
<LI>le bouton &laquo; Abandonner &raquo; ferme ce formulaire et abandonne
simplement la commande de fermeture du document : rien d'autre ne se passe.
<LI>le bouton &laquo; Sauver le document &raquo; qui permettra dans une
version ult&eacute;rieure de sauver le document avant de le fermer.
<LI>le bouton &laquo; Fermer sans sauver &raquo; ferme simplement le document.
Toutes les modifications faites depuis la derni&egrave;re sauvegarde du
document sont perdues.
</UL>
Tant qu'on n'a pas cliqu&eacute; un de ces boutons, aucune autre
op&eacute;ration n'est possible : il faut r&eacute;pondre &agrave; ce
formulaire pour pouvoir continuer de travailler.
</UL>

<H2><A NAME="secta4">4</A> Fonctions &eacute;l&eacute;mentaires de traitement
de texte</H2>

<P>La plupart de ces fonctions peuvent s'appliquer aussi bien &agrave; une
cha&icirc;ne de caract&egrave;res qu'&agrave; des &eacute;l&eacute;ments de la
structure logique du document. N&eacute;anmoins, dans cette section, on ne
consid&egrave;re que le traitement des cha&icirc;nes de caract&egrave;res.</P>

<H3><A NAME="sectb41">4.1</A> D&eacute;placements simples dans le
document</H3>

<P>Une fa&ccedil;on simple de se d&eacute;placer &agrave; travers un document
consiste &agrave; utiliser la bande de d&eacute;filement qui se trouve sur le
c&ocirc;t&eacute; droit de la fen&ecirc;tre. En cliquant avec le bouton gauche
de la souris sur le bouton triangulaire plac&eacute; en bas de la bande de
d&eacute;filement, on fait avancer le document d'une ligne environ ; le bouton
triangulaire du haut a l'effet inverse. Il est possible de maintenir ces
boutons enfonc&eacute;s, pour obtenir un d&eacute;filement continu du
document.</P>

<P>Pour aller rapidement &agrave; une extr&eacute;mit&eacute; du document, on
peut presser la touche Control du clavier, puis cliquer sur ces boutons
triangulaires tout en maintenant la touche Control enfonc&eacute;e.</P>

<P>La position de l'ascenseur dans la bande de d&eacute;filement correspond
&agrave; la position de la partie affich&eacute;e dans l'ensemble du document.
La hauteur de l'ascenseur par rapport &agrave; celle de la bande de
d&eacute;filement repr&eacute;sente la taille de la partie affich&eacute;e par
rapport &agrave; la taille totale du document.</P>

<P>Pour avancer ou reculer d'une hauteur de fen&ecirc;tre, cliquez dans la
bande de d&eacute;filement avec le bouton gauche de la souris, au-dessus ou
au-dessous de l'ascenseur.</P>

<P>On peut aussi cliquer sur l'ascenseur avec le bouton gauche de la souris et
le d&eacute;placer verticalement, tout en maintenant le bouton enfonc&eacute;.
Lorsqu'on rel&acirc;che le bouton, le document se positionne dans la
fen&ecirc;tre en fonction de la nouvelle position de l'ascenseur. On peut
obtenir le m&ecirc;me r&eacute;sultat en cliquant avec le bouton du milieu sur
la position choisie de la bande de d&eacute;filement.</P>

<P>On peut aussi utiliser les touches du clavier pour se d&eacute;placer
verticalement: </P>

<UL>
<LI><TT>Page Up</TT> recule d'une hauteur de fen&ecirc;tre ;
<LI><TT>Page Down</TT> avance d'une hauteur de fen&ecirc;tre ;
<LI><TT>Home</TT> saute au d&eacute;but du document ;
<LI><TT>End</TT> saute &agrave; la fin du document.
</UL>

<P>Pour les d&eacute;placements horizontaux, il existe une bande de
d&eacute;filement en bas de la fen&ecirc;tre, qui fonctionne selon les
m&ecirc;mes principes.</P>

<H3><A NAME="sectb42">4.2</A> S&eacute;lection de texte avec la souris</H3>

<P>Toutes les op&eacute;rations de traitement de texte reposent sur la
s&eacute;lection : il faut d'abord s&eacute;lectionner la partie du texte sur
laquelle on veut travailler avant de pouvoir la modifier.</P>

<P>Le mode de s&eacute;lection le plus direct est la d&eacute;signation
&agrave; l'aide de la souris. En cliquant avec le bouton gauche sur un
caract&egrave;re, on s&eacute;lectionne ce caract&egrave;re : il
appara&icirc;t sur un fond color&eacute;. En cliquant ensuite avec le bouton
du milieu sur un autre caract&egrave;re, on &eacute;tend la s&eacute;lection
jusqu'&agrave; cet autre caract&egrave;re. D&egrave;s qu'on clique sur un
caract&egrave;re avec le bouton gauche, on annule la s&eacute;lection
pr&eacute;c&eacute;dente et on en &eacute;tablit une nouvelle.</P>

<P>Pour s&eacute;lectionner une cha&icirc;ne de caract&egrave;res, il est
aussi possible de parcourir cette cha&icirc;ne avec la souris, en maintenant
le bouton gauche enfonc&eacute;.</P>

<H3><A NAME="sectb43">4.3</A> <A NAME="L278">D&eacute;placements dans le
texte</A></H3>

<P>Lorsqu'un ou plusieurs caract&egrave;res sont s&eacute;lectionn&eacute;s
dans un paragraphe, on peut modifier la s&eacute;lection &agrave; l'aide du
clavier, par des combinaisons de touches :</P>

<UL>
<LI>Control A s&eacute;lectionne le premier caract&egrave;re de la ligne
o&ugrave; se trouve le d&eacute;but de la s&eacute;lection courante.
<LI>Control E (comme End) place la s&eacute;lection apr&egrave;s le dernier
caract&egrave;re de la ligne o&ugrave; se trouve le d&eacute;but de la
s&eacute;lection courante.
<LI>Control P (comme Previous) s&eacute;lectionne le premier caract&egrave;re
de la ligne qui pr&eacute;c&egrave;de celle o&ugrave; se trouve le
d&eacute;but de la s&eacute;lection courante. Si la s&eacute;lection courante
est dans la premi&egrave;re ligne du paragraphe, c'est l'&eacute;l&eacute;ment
qui pr&eacute;c&egrave;de le paragraphe qui est s&eacute;lectionn&eacute;.
<LI>Control N (comme Next) place la s&eacute;lection apr&egrave;s le dernier
caract&egrave;re de la ligne qui suit celle o&ugrave; se trouve le
d&eacute;but de la s&eacute;lection courante.  Si la s&eacute;lection courante
est dans la derni&egrave;re ligne du paragraphe, c'est l'&eacute;l&eacute;ment
qui suit le paragraphe qui est s&eacute;lectionn&eacute;.
<LI>Control F (comme Forward) s&eacute;lectionne le caract&egrave;re qui suit
le premier caract&egrave;re de la s&eacute;lection courante.
<LI>Control B (comme Backward) s&eacute;lectionne le caract&egrave;re qui
pr&eacute;c&egrave;de le premier caract&egrave;re de la s&eacute;lection
courante.
</UL>

<H3><A NAME="sectb44">4.4</A> Insertion de texte</H3>

<P>Lorsqu'un caract&egrave;re au moins est s&eacute;lectionn&eacute;, le texte
frapp&eacute; au clavier vient s'ins&eacute;rer devant le premier
caract&egrave;re s&eacute;lectionn&eacute;. Il faut pour cela que le curseur
souris soit dans une fen&ecirc;tre contr&ocirc;l&eacute;e par
l'application.</P>

<P>Pour ajouter du texte &agrave; la fin d'un paragraphe, il faut cliquer avec
le bouton gauche de la souris, juste apr&egrave;s le dernier caract&egrave;re.
La s&eacute;lection courante appara&icirc;t sous la forme d'une petite barre
verticale qui marque la position o&ugrave; les caract&egrave;res
frapp&eacute;s au clavier vont se placer. On peut aussi utiliser la commande
<TT>Control E</TT> pour se placer en fin de ligne (voir <A
HREF="#sectb43">4.3</A>).</P>

<P>Pendant la frappe du texte, ou ult&eacute;rieurement, on peut supprimer le
caract&egrave;re qui pr&eacute;c&egrave;de le curseur, avec la touche Back
Space du clavier. En appuyant plusieurs fois sur cette touche, on supprime les
caract&egrave;res pr&eacute;c&eacute;dents.</P>

<H3><A NAME="sectb45">4.5</A> <A NAME="L377">Saisie des caract&egrave;res
accentu&eacute;s</A></H3>

<P>Certains caract&egrave;res ne figurent pas au clavier, notamment les
lettres accentu&eacute;es. On peut n&eacute;anmoins les entrer gr&acirc;ce
&agrave; la commande &laquo; Keyboards &raquo;, en haut de la fen&ecirc;tre
Tamaya. Cette commande affiche un menu dont l'avant derni&egrave;re
entr&eacute;e &laquo; Latin alphabet  &raquo; fait appara&icirc;tre une
fen&ecirc;tre montrant des caract&egrave;res suppl&eacute;mentaires. On entre
ces caract&egrave;res dans le document en cliquant dans cette fen&ecirc;tre
sur le caract&egrave;re voulu ou en utilisant le clavier comme indiqu&eacute;
sous l'image du caract&egrave;re : pour obtenir un &laquo; &eacute; &raquo;,
on frappe d'abord un &laquo; e &raquo; avec la touche Compose enfonc&eacute;e,
puis un &laquo; ' &raquo;. Ce principe s'applique &eacute;galement aux
majuscules : on obtient un &laquo; &Eacute; &raquo; en frappant un &laquo; e
&raquo; avec les deux touches Compose et Shift enfonc&eacute;es, puis la
touche &laquo; ' &raquo;.</P>

<P>Pour entrer ces caract&egrave;res compos&eacute;s, il n'est pas
n&eacute;cessaire que le jeu de caract&egrave;res correspondant soit
affich&eacute;.</P>

<P>Ces conventions de frappe s'appliquent au texte des documents aussi bien
qu'aux feuilles de dialogue par lesquelles on entre les param&egrave;tres des
commandes. Elle peuvent &ecirc;tre chang&eacute;es, en &eacute;ditant un
fichier sp&eacute;cifique (voir section <A HREF="#secta15">15</A>).</P>

<H3><A NAME="sectb46">4.6</A> Suppression de texte</H3>

<P>Lorsqu'une cha&icirc;ne de caract&egrave;res est
s&eacute;lectionn&eacute;e, on peut la d&eacute;truire, au choix :</P>

<UL>
<LI>avec la touche <TT>Delete</TT> du clavier,
<LI>avec la combinaison de touches <TT>Control D</TT>,
<LI>avec l'entr&eacute;e &laquo; D&eacute;truire &raquo; du menu &laquo;
&Eacute;dition &raquo;.
</UL>

<P>Dans tous ces cas, le texte supprim&eacute; est perdu d&eacute;finitivement
(attention, dans cette version, il n'y a pas de commande &laquo; Undo
&raquo;). Pour pouvoir r&eacute;utiliser le texte d&eacute;truit, il faut
utiliser la commande &laquo; Couper &raquo;.</P>

<P>Lorsqu'une cha&icirc;ne de caract&egrave;res (&eacute;ventuellement
r&eacute;duite &agrave; un seul caract&egrave;re) est
s&eacute;lectionn&eacute;e, on peut supprimer le caract&egrave;re qui
pr&eacute;c&egrave;de en frappant la touche Back Space du clavier.</P>

<H3><A NAME="sectb47">4.7</A> <A NAME="L788">Couper, copier, coller du
texte</A></H3>

<H5>Couper</H5>

<P>Si on veut supprimer le texte s&eacute;lectionn&eacute; pour le
r&eacute;ins&eacute;rer ailleurs, il faut utiliser la commande &laquo; Couper
&raquo; du menu &laquo; &Eacute;dition &raquo; ou la combinaison de touches
Control W. Le texte est retir&eacute; du document et conserv&eacute; dans le
presse-papiers de Thot ; l'ancien contenu de ce presse-papiers est perdu.</P>

<H5>Coller</H5>

<P>Pour ins&eacute;rer le contenu du presse-papiers de Thot dans un document,
il faut s&eacute;lectionner le caract&egrave;re devant lequel on veut
ins&eacute;rer ce texte, puis appeler la commande &laquo; Coller &raquo; du
menu &laquo; &Eacute;dition &raquo;, ou utiliser la combinaison de touches
Control Y au clavier.</P>

<H5>Copier</H5>

<P>On peut copier dans le presse-papiers de Thot une cha&icirc;ne de
caract&egrave;res &agrave; l'aide de la commande &laquo; Copier &raquo; du
menu &laquo; &Eacute;dition &raquo; ou en utilisant la combinaison de touches
Control C au clavier. Cette cha&icirc;ne peut ensuite &ecirc;tre coll&eacute;e
&agrave; un autre endroit du document ou dans un autre document.</P>

<P>Tamaya utilise deux presse-papiers. Le presse-papier de Tamaya permet de
transf&eacute;rer du texte (ou des &eacute;l&eacute;ments plus complexes)
&agrave; l'int&eacute;rieur du m&ecirc;me document ou entre documents. Le
presse-papiers X permet de transf&eacute;rer du texte, et seulement du texte,
entre fen&ecirc;tres du m&ecirc;me serveur X.</P>

<H5>Depuis presse-papiers X</H5>

<P>Le presse-papiers X permet d'introduire dans un document HTML une
cha&icirc;ne de caract&egrave;res qui provient d'une fen&ecirc;tre
n'appartenant pas &agrave; Tamaya, une fen&ecirc;tre <EM>xterm</EM> par
exemple. Une fois ce texte mis dans le presse-papiers X, on l'ins&egrave;re
dans un document par la commande &laquo; Depuis presse-papiers X &raquo; du
menu &laquo; &Eacute;dition &raquo; ou par la touche <TT>Coller </TT>du
clavier. Il peut &ecirc;tre n&eacute;cessaire d'ins&eacute;rer un espace au
point d'insertion voulu pour que l&acute;&eacute;diteur colle le texte du
presse-papiers (l'&eacute;diteur a parfois du mal &agrave; se placer au bon
niveau structural).</P>

<H5>Dans presse-papiers X</H5>

<P>En sens inverse, il est possible de copier dans le presse-papiers X la
cha&icirc;ne de caract&egrave;res s&eacute;lectionn&eacute;e dans un document
HTML. Cela se fait par la commande &laquo; Dans presse-papiers X &raquo; ou
par la touche <TT>Copier </TT>du clavier. Cette cha&icirc;ne de
caract&egrave;res sans &laquo; tag &raquo; est &eacute;ventuellement
tronqu&eacute;e si sa longueur d&eacute;passe la capacit&eacute; du buffer du
presse-papiers X (de l'ordre de 1000 caract&egrave;res).</P>

<H2><A NAME="secta5">5</A> S&eacute;lection structurale</H2>

<P>Les commandes de Tamaya s'appliquent &agrave; la s&eacute;lection courante.
Il est donc important de pouvoir s&eacute;lectionner non seulement des
cha&icirc;nes de caract&egrave;res, mais aussi des &eacute;l&eacute;ments de
la structure HTML pour pouvoir les copier, les supprimer et les
d&eacute;placer.</P>

<H3><A NAME="sectb51">5.1</A> S&eacute;lection d'un &eacute;l&eacute;ment
HTML</H3>

<P> Il y a plusieurs moyens de s&eacute;lectionner un &eacute;l&eacute;ment
HTML et tous peuvent &ecirc;tre employ&eacute;s indiff&eacute;remment :</P>

<H5>S&eacute;lection avec le bouton gauche de la souris</H5>

<P>On peut s&eacute;lectionner un &eacute;l&eacute;ment de structure en
cliquant avec le bouton gauche de la souris &agrave; certains emplacements
choisis de l'&eacute;l&eacute;ment. Ainsi, en cliquant &agrave; droite du
texte d'un titre H1, on s&eacute;lectionne l'&eacute;l&eacute;ment H1 ; en
cliquant sur le boulet d'un item de liste, on s&eacute;lectionne l'item
correspondant ; en cliquant dans l'espace libre de la derni&egrave;re ligne
d'un paragraphe, on s&eacute;lectionne le paragraphe ; etc.</P>

<H5>S&eacute;lection avec la tousche Esc</H5>

<P>On peut aussi s&eacute;lectionner un simple caract&egrave;re ou une
cha&icirc;ne de caract&egrave;res appartenant &agrave; l'&eacute;l&eacute;ment
&agrave; s&eacute;lectionner, puis appuyer sur la touche <TT>Esc</TT> autant
de fois qu'il faut pour atteindre l'&eacute;l&eacute;ment voulu : chaque
frappe de la touche <TT>Esc</TT> s&eacute;lectionne l'&eacute;l&eacute;ment
qui englobe la s&eacute;lection courante.</P>

<H5>S&eacute;lection avec le menu S&eacute;lection</H5>

<P>On peut utiliser le menu &laquo; S&eacute;lection &raquo; (cliquer sur le
bouton &laquo; S&eacute;lection &raquo; de la barre de menu, en haut de la
fen&ecirc;tre). Ce menu comprend quatre entr&eacute;es (certaines peuvent
&ecirc;tre vides, si l'&eacute;l&eacute;ment correspondant n'existe pas) qui
permettent de se d&eacute;placer dans l'arbre de la structure logique du
document, relativement &agrave; la s&eacute;lection courante. Chaque
entr&eacute;e est form&eacute;e d'un symbole (<TT>^ &lt; &gt; _</TT>) suivi du
type de l'&eacute;l&eacute;ment correspondant :</P>

<UL>
<LI><TT>^</TT>   s&eacute;lectionne l'&eacute;l&eacute;ment englobant (comme
la touche <TT>Esc</TT>).
<LI><TT>&lt;</TT>   s&eacute;lectionne l'&eacute;l&eacute;ment
pr&eacute;c&eacute;dent.
<LI><TT>&gt;</TT>   s&eacute;lectionne l'&eacute;l&eacute;ment suivant.
<LI><TT>_</TT>   s&eacute;lectionne le premier &eacute;l&eacute;ment
englob&eacute;.
</UL>

<P>Sauf modification du param&eacute;trage du clavier (voir section <A
HREF="#secta15">15</A>), les fl&ecirc;ches du clavier commandent ces
d&eacute;placements structuraux.</P>

<P>Ces diff&eacute;rents modes de s&eacute;lection peuvent &ecirc;tre
combin&eacute;s : on peut par exemple s&eacute;lectionner d'abord un
&eacute;l&eacute;ment avec la souris, puis passer &agrave;
l'&eacute;l&eacute;ment voisin avec le menu &laquo; S&eacute;lection &raquo;
et enfin utiliser la touche <TT>Esc</TT> pour passer &agrave; un
&eacute;l&eacute;ment englobant.</P>

<P>Quel que soit le mode de s&eacute;lection choisi, et m&ecirc;me lorsqu'on
s&eacute;lectionne simplement du texte, le type de l'&eacute;l&eacute;ment
s&eacute;lectionn&eacute; est affich&eacute; en haut de la fen&ecirc;tre, dans
la zone intitul&eacute;e &laquo; S&eacute;lection &raquo;. Cette zone affiche
&eacute;galement le type des &eacute;l&eacute;ments qui englobent la
s&eacute;lection courante, sur plusieurs niveaux.</P>

<H3><A NAME="sectb52">5.2</A> S&eacute;lection de plusieurs
&eacute;l&eacute;ments</H3>

<P>Lorsqu'un &eacute;l&eacute;ment (ou m&ecirc;me un simple caract&egrave;re)
est s&eacute;lectionn&eacute;, on peut &eacute;tendre la s&eacute;lection en
cliquant avec le bouton du milieu de la souris sur un autre
&eacute;l&eacute;ment. Cela s&eacute;lectionne une suite
d'&eacute;l&eacute;ments de m&ecirc;me niveau dans la structure, les
&eacute;l&eacute;ments extr&ecirc;mes de cette suite contenant
l'&eacute;l&eacute;ment initialement s&eacute;lectionn&eacute; et
l'&eacute;l&eacute;ment sur lequel se trouve le curseur souris au moment du
clic.</P>

<P>Comme pour la s&eacute;lection de texte, on peut &eacute;tendre la
s&eacute;lection en maintenant le bouton du milieu enfonc&eacute;, tout en
d&eacute;pla&ccedil;ant la souris.</P>

<P>Lorsque plusieurs &eacute;l&eacute;ments sont s&eacute;lectionn&eacute;s,
la zone &laquo; S&eacute;lection &raquo; affiche entre crochets les types de
ces &eacute;l&eacute;ments, puis les types des &eacute;l&eacute;ments
englobants.</P>

<H2><A NAME="secta6">6</A> &Eacute;dition de la structure HTML</H2>

<P>Tamaya est un &eacute;diteur structur&eacute; destin&eacute; &agrave;
cr&eacute;er et modifier des documents HTML. Cet &eacute;diteur s'appuie sur
la structure HTML pour guider l'utilisateur et lui proposer l'ensemble des
&eacute;l&eacute;ments HTML qu'il peut ins&eacute;rer dans son document. Les
menus sont contextuels et Tamaya n'autorise pas d'ins&eacute;rer des
&eacute;l&eacute;ments invalides ou des &eacute;l&eacute;ments valides
&agrave; une position invalide.</P>

<P>Pour faciliter le travail de l'auteur, certains &eacute;l&eacute;ments sont
rang&eacute;s dans des cat&eacute;gories :</P>

<UL>
<LI>les &eacute;l&eacute;ments de base : texte ou image
<LI>les headings : H1, .., H7
<LI>les listes : non-num&eacute;rot&eacute;es, num&eacute;rot&eacute;es,
r&eacute;pertoires, menus, descriptions
<LI>les composants de formulaires.
</UL>

<H3><A NAME="sectb61">6.1</A> Cr&eacute;ation de nouveaux
&eacute;l&eacute;ments</H3>

<P>On peut ajouter des &eacute;l&eacute;ments dans le document soit en
cr&eacute;ant de nouveaux &eacute;l&eacute;ments, soit en collant des
&eacute;l&eacute;ments copi&eacute;s ou coup&eacute;s ailleurs (voir section
<A HREF="#sectb62">6.2</A>).</P>

<P>Pour cr&eacute;er de nouveaux &eacute;l&eacute;ments HTML, il faut utiliser
le menu &laquo; Ins&eacute;rer &raquo;. La touche <TT>Return</TT> peut aussi
&ecirc;tre utilis&eacute;e dans certaines conditions. Dans les deux cas, il
faut d'abord s&eacute;lectionner un &eacute;l&eacute;ment au voisinage duquel
on veut cr&eacute;er le nouvel &eacute;l&eacute;ment.</P>

<H4><A NAME="app@sectc611">6.1.1</A> <A NAME="L1719">Menu
Ins&eacute;rer</A></H4>

<P>Le menu &laquo; Ins&eacute;rer &raquo; peut &ecirc;tre appel&eacute; soit
par le menu &laquo; &Eacute;dition &raquo; de la barre de menu, soit par le
bouton droit de la souris, lorsque celle-ci est sur un document Tamaya, soit
par l'&eacute;quivalent clavier <TT>Control I</TT>.</P>

<P>Ce menu est construit en fonction de la s&eacute;lection courante. Il
affiche tous les &eacute;l&eacute;ments qui peuvent &ecirc;tre
cr&eacute;&eacute;s avant ou apr&egrave;s la s&eacute;lection courante. En
choisissant une entr&eacute;e de ce menu, on choisit l'&eacute;l&eacute;ment
&agrave; cr&eacute;er et sa position structurale. Le sch&eacute;ma de
structure HTML d&eacute;finit parfois des choix interm&eacute;diaires, comme
<TT>Element</TT>. La s&eacute;lection de cette entr&eacute;e de menu fait
appara&icirc;tre un nouveau menu jusqu'&agrave; obtenir le choix d'un
&eacute;l&eacute;ment de la stucture HTML.</P>

<P>L'&eacute;l&eacute;ment est cr&eacute;&eacute; avec tous ses composants
obligatoires. Ces composants sont &eacute;videmment vides et apparaissent sous
la forme d'un rectangle tram&eacute;.</P>

<P>Lorsqu'on a s&eacute;lectionn&eacute; un &eacute;l&eacute;ment vide ou un
&eacute;l&eacute;ment qui ne contient pas tous les composants pr&eacute;vus,
la premi&egrave;re entr&eacute;e du menu &laquo; Ins&eacute;rer &raquo; est
&laquo; A l'int&eacute;rieur &raquo;. Cette entr&eacute;e permet alors de
cr&eacute;er les &eacute;l&eacute;ments manquants &agrave; l'int&eacute;rieur
de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;.</P>

<H4><A NAME="app@sectc612">6.1.2</A> Touche Return</H4>

<P>La touche <EM><TT>Return</TT></EM> offre une fa&ccedil;on plus rapide, mais
moins souple, de cr&eacute;er un nouvel &eacute;l&eacute;ment apr&egrave;s
celui qui est s&eacute;lectionn&eacute;. Elle cr&eacute;e, si la structure
HTML autorise plusieurs instances successives, un nouvel &eacute;l&eacute;ment
du m&ecirc;me type que l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;,
apr&egrave;s celui-ci. Lorsque la s&eacute;lection est au milieu d'un
paragraphe, elle permet de couper ce paragraphe en deux.</P>

<P>&Agrave; titre d'exemple, on peut saisir toute une suite d'items de liste
les uns apr&egrave;s les autres en  appuyant sur la touche
<EM><TT>Return</TT></EM> chaque fois que l'on a fini de saisir le texte d'un
item.</P>

<H4><A NAME="app@sectc613">6.1.3</A> Frappe directe du texte</H4>

<P>Lorsqu'un nouvel &eacute;l&eacute;ment est cr&eacute;&eacute;, il est vide
et appara&icirc;t sous la forme d'un rectangle tram&eacute;. Si cet
&eacute;l&eacute;ment peut contenir du texte, on peut simplement le
s&eacute;lectionner (s'il ne l'a pas &eacute;t&eacute; par la commande de
cr&eacute;ation) puis frapper le texte au clavier.</P>

<H3><A NAME="sectb62">6.2</A> <A NAME="L1787">Couper, copier, coller des
&eacute;l&eacute;ments</A></H3>

<P>Les commandes &laquo; Couper &raquo;, &laquo; Copier &raquo; et &laquo;
Coller &raquo; pr&eacute;sent&eacute;es dans la section <A
HREF="#sectb47">4.7</A> pour la manipulation du texte agissent de fa&ccedil;on
analogue sur les &eacute;l&eacute;ments de structure HTML. La seule
restriction est que la commande &laquo; Coller &raquo; peut &eacute;chouer
parce que l'&eacute;diteur ne sait pas toujours transformer le type de
l'&eacute;l&eacute;ment copi&eacute; en en type de l'&eacute;l&eacute;ment
demand&eacute;.</P>

<P>Si on veut supprimer les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s
pour les r&eacute;ins&eacute;rer ailleurs, il faut utiliser la commande
&laquo; Couper &raquo; du menu &laquo; &Eacute;dition &raquo; ou la
combinaison de touches <TT>Control W</TT>. Les &eacute;l&eacute;ments
s&eacute;lectionn&eacute;s sont alors retir&eacute;s du document et
conserv&eacute;s dans le presse-papiers Tamaya ; l'ancien contenu de ce
presse-papiers est perdu.</P>

<P>Pour ins&eacute;rer le contenu du presse-papiers Tamaya dans un document,
il faut s&eacute;lectionner l'&eacute;l&eacute;ment devant lequel on veut
ins&eacute;rer ce contenu puis appeler la commande &laquo; Coller &raquo; du
menu &laquo; &Eacute;dition &raquo; (ou utiliser la combinaison de touches
<TT>Control Y </TT>au clavier). Si le presse-papiers contient des
&eacute;l&eacute;ments de structure, et non pas une simple cha&icirc;ne de
caract&egrave;res, un menu semblable &agrave; celui propos&eacute; par la
commande &laquo; Ins&eacute;rer &raquo; s'affiche. Ce menu permet d'indiquer
&agrave; quelle position dans la structure et avec quel type on veut coller le
contenu du presse-papiers Tamaya. Si la commande &laquo; Coller &raquo;
&eacute;choue, parce que l'&eacute;diteur n'a pas pu transformer le contenu du
presse-papiers dans le type indiqu&eacute;, le message &laquo;
L'&eacute;l&eacute;ment Nom_Type ne peut &ecirc;tre coll&eacute; ici &raquo;
est affich&eacute; dans la fen&ecirc;tre principale de l'&eacute;diteur.</P>

<P>On peut copier dans le presse-papiers Tamaya les &eacute;l&eacute;ments de
structure s&eacute;lectionn&eacute;s, &agrave; l'aide de la commande &laquo;
Copier &raquo; du menu &laquo; &Eacute;dition &raquo; ou en utilisant la
combinaison de touches <TT>Control C</TT> au clavier. Ces
&eacute;l&eacute;ments peuvent ensuite &ecirc;tre coll&eacute;s &agrave; un
autre endroit du document ou dans un autre document.</P>

<P>Lorsque des &eacute;l&eacute;ments de structure sont
s&eacute;lectionn&eacute;s, la commande &laquo; Dans presse-papiers X &raquo;
du menu &laquo; &Eacute;dition &raquo; copie dans le presse-papiers X le texte
contenu par ces &eacute;l&eacute;ments. Ce texte est &eacute;ventuellement
tronqu&eacute; si sa longueur d&eacute;passe la capacit&eacute; du buffer
utilis&eacute; pour le presse-papiers X. Ce texte peut ensuite &ecirc;tre
coll&eacute; dans une fen&ecirc;tre X.</P>

<H3><A NAME="sectb63">6.3</A> Division d'un &eacute;l&eacute;ment</H3>

<P>Il est parfois n&eacute;cessaire de diviser un &eacute;l&eacute;ment en
deux : une liste doit &ecirc;tre divis&eacute;e pour ins&eacute;rer un titre
ou un paragraphe au milieu, par exemple. Cela se fait &agrave; l'aide de la
commande &laquo; Diviser &raquo; du menu &laquo; &Eacute;dition &raquo;.</P>

<P>Cette commande ne peut &ecirc;tre activ&eacute;e que lorsque la
s&eacute;lection se trouve &agrave; l'int&eacute;rieur d'un
&eacute;l&eacute;ment qui peut &ecirc;tre r&eacute;p&eacute;t&eacute; (l'item
de liste dans l'exemple pr&eacute;c&eacute;dent). Dans ce cas, le menu indique
explicitement, apr&egrave;s le mot &laquo; Diviser &raquo;, le type de
l'&eacute;l&eacute;ment qui sera coup&eacute; en deux. Si aucun des
&eacute;l&eacute;ments qui englobent la s&eacute;lection courante ne peut
&ecirc;tre r&eacute;p&eacute;t&eacute;, la commande &laquo; Diviser &raquo;
est invalid&eacute;e dans le menu &laquo; &Eacute;dition &raquo;.</P>

<P>Lorsqu'elle est valide, la commande &laquo; Diviser &raquo; cr&eacute;e un
&eacute;l&eacute;ment du type indiqu&eacute;, apr&egrave;s
l'&eacute;l&eacute;ment de ce type qui englobe la s&eacute;lection courante.
Tous les &eacute;l&eacute;ments &agrave; partir du premier
s&eacute;lectionn&eacute; et jusqu'&agrave; la fin de l'&eacute;l&eacute;ment
&agrave; diviser sont retir&eacute;s de cet &eacute;l&eacute;ment et mis dans
le nouvel &eacute;l&eacute;ment cr&eacute;&eacute;. L'&eacute;l&eacute;ment
qui a &eacute;t&eacute; divis&eacute; est &eacute;ventuellement
compl&eacute;t&eacute;, ainsi que le nouvel &eacute;l&eacute;ment
cr&eacute;&eacute;, de fa&ccedil;on qu'ils aient chacun un contenu conforme
&agrave; la structure.</P>

<H2><A NAME="secta7">7</A> <A NAME="L1870">&Eacute;dition des ancres et des
liens</A></H2>

<P>Un document HTML constitue une page de document hypertexte. Il contient
donc en g&eacute;n&eacute;ral des liens qui permettent de le relier aux autres
pages de l'hypertexe et parfois des ancres qui marquent le point
d'arriv&eacute;e de liens hypertexte.</P>

<H3><A NAME="sectb71">7.1</A> Cr&eacute;ation d'une ancre cible</H3>

<P>Les ancres cible repr&eacute;sentent les zones qui peuvent &ecirc;tre
utilis&eacute;es comme cible de liens. Pour cr&eacute;er une ancre cible, il
faut s&eacute;lectionner la zone de texte, l'image ou une suite de ces
.&eacute;l&eacute;ments de base, puis appeler le menu d'insertion (voir la
section <A HREF="#app@sectc611">6.1.1</A>) et choisir l'entr&eacute;e &laquo;
ancre_cible autour &raquo;. L'&eacute;diteur cr&eacute;e l'ancre cible autour
de la s&eacute;lection et engendre automatiquement un nom unique pour
l'attribut <TT>NAME</TT> de cette ancre. Le texte contenu dans la zone de
l'ancre cible est alors affich&eacute; en vert sur un &eacute;cran couleur
(surlign&eacute; sur un &eacute;cran noir et blanc).</P>

<P>L'utilisateur peut s'il le d&eacute;sire modifier la valeur de l'attribut
<TT>NAME</TT> comme indiqu&eacute; dans la section <A HREF="#secta9">9</A>.
S'il modifie un attribut <TT>NAME</TT> d'une ancre cible, il doit s'assurer
que cela ne casse pas des liens. Si n&eacute;cessaire, il peut r&eacute;tablir
ces liens en utilisant la commande de modification des liens (voir section <A
HREF="#sectb73">7.3</A>).</P>

<H3><A NAME="sectb72">7.2</A> Cr&eacute;ation d'une ancre lien</H3>

<P>Les ancres lien sont les zones actives qui permettent de se d&eacute;placer
d'un point d'un document vers un autre point du m&ecirc;me document ou d'un
autre document du Web. Pour cr&eacute;er une ancre lien, il faut
s&eacute;lectionner la zone de texte, l'image ou une suite de ces
.&eacute;l&eacute;ments de base, puis d'appeler le menu d'insertion (voir la
section <A HREF="#app@sectc611">6.1.1</A>) et de choisir l'entr&eacute;e
&laquo; ancre_lien autour &raquo;. L'&eacute;diteur cr&eacute;e l'ancre lien
autour de la s&eacute;lection, puis il attend (le curseur prend la forme d'une
main) que l'utilisateur d&eacute;signe :</P>

<UL>
<LI>soit un point quelconque d'un autre document,
<LI>soit une ancre cible d'un autre document,
<LI>soit une ancre cible du document lui-m&ecirc;me,
<LI>soit un point quelconque du document lui-m&ecirc;me.
</UL>

<P>Dans les trois premiers cas, l'&eacute;diteur enregistre l'URL de la cible
d&eacute;sign&eacute;e dans l'attribut <TT>HREF</TT> de l'ancre
cr&eacute;&eacute;e. Le texte contenu dans la zone de l'ancre lien est alors
affich&eacute; en bleu sur un &eacute;cran couleur (soulign&eacute; sur un
&eacute;cran noir et blanc).</P>

<P>Si l'utilisateur a d&eacute;sign&eacute; un point dans le document courant
qui ne correspond &agrave; aucune ancre cible, l'&eacute;diteur ouvre un menu
pour que l'attribut <TT>HREF</TT> soit saisi manuellement par
l'utilisateur.</P>

<P>L'utilisateur peut s'il le d&eacute;sire modifier la valeur de l'attribut
<TT>HREF</TT> comme indiqu&eacute; dans la section <A HREF="#secta9">9</A> ou
bien utiliser la commande sp&eacute;cifique de modification de lien
(d&eacute;crite ci-dessous).</P>

<H3><A NAME="sectb73">7.3</A> <A NAME="L2685">Modification d'un lien</A></H3>

<P>La commande &laquo; Modifier lien &raquo; pr&eacute;sent&eacute;e dans le
menu &laquo; Outils &raquo;permet de modifier le lien attach&eacute; &agrave;
l'ancre lien qui englobe le point la s&eacute;lection courante. D&egrave;s que
l'utilisateur a s&eacute;lectionn&eacute; cette commande, l'&eacute;diteur
attend (le curseur prend la forme d'une main) que l'utilisateur d&eacute;signe
la nouvelle cible du lien comme lors de la cr&eacute;ation du lien.</P>

<H3><A NAME="sectb74">7.4</A> Couper, copier, coller des ancres</H3>

<P>L'&eacute;diteur g&egrave;re de fa&ccedil;on transparente le couper,
copier, coller des ancres liens, m&ecirc;me si ces liens sont
d&eacute;plac&eacute;s d'un document dans un autre. Sur les ancres cible, sa
fonction se limite &agrave; garantir l'unicit&eacute; des attributs
<TT>NAME</TT> quand une partie de document contenant ce type d'ancre est
dupliqu&eacute;e. Par contre, il n'assure pas la mise &agrave; jour des liens
&eacute;ventuels sur ces ancres.</P>

<H2><A NAME="secta8">8</A> &Eacute;dition des images</H2>

<P>Quand l'utilisateur cr&eacute;e un &eacute;l&eacute;ment de type IMAGE, un
formulaire &agrave; cinq champs est affich&eacute; :</P>

<UL>
<LI>Le champ &laquo; Type d'image &raquo; permet d'indiquer le format de
l'image &agrave; charger.
<LI>Le champ &laquo; R&eacute;pertoires documents &raquo; permet de choisir le
r&eacute;pertoire Unix dans lequel se trouve le fichier image &agrave;
charger. Les images sont d'abord recherch&eacute;es dans un des
r&eacute;pertoires de sch&eacute;mas, puis dans les r&eacute;pertoires de
documents. L'ordre de la liste des r&eacute;pertoires a une importance. Il
indique l'ordre dans lequel l'&eacute;diteur consulte les r&eacute;pertoires
&agrave; la recherche du fichier image. L'&eacute;diteur ne m&eacute;morise
pas de lui-m&ecirc;me la liste des r&eacute;pertoires utiles pour pouvoir
recharger correctement toutes les images du document. Il suffit de cliquer
avec le bouton gauche de la souris sur le nom du r&eacute;pertoire choisi.
Cette liste de r&eacute;pertoires peut &ecirc;tre mise &agrave; jour 
lorsqu'on &eacute;dite le champ &laquo; Nom du fichier &raquo; du m&ecirc;me
formulaire : la partie r&eacute;pertoire de ce nom vient s'ajouter &agrave; la
liste, si ce r&eacute;pertoire n'y figure pas d&eacute;j&agrave; et s'il
contient des images du format demand&eacute; :
<UL>
<LI>fichiers <EM>.xbm</EM> quand le &laquo; Type d'image &raquo;
demand&eacute; est &laquo; Bitmap &raquo;
<LI>fichiers <EM>.eps</EM> quand le &laquo; Type d'image &raquo;
demand&eacute; est &laquo; EPSF &raquo;
<LI>fichiers <EM>.xpm</EM> quand le &laquo; Type d'image &raquo;
demand&eacute; est &laquo; Pixmap &raquo;
<LI>fichiers <EM>.gif</EM> quand le &laquo; Type d'image &raquo;
demand&eacute; est &laquo; Gif &raquo;
<LI>fichiers <EM>.jpg</EM> quand le &laquo; Type d'image &raquo;
demand&eacute; est &laquo; JPEG &raquo;
</UL>

<LI>La liste &laquo; Fichiers &raquo; permet de choisir l'image, simplement en
cliquant sur son nom avec le bouton gauche de la souris. Cette liste affiche
toutes les images du format demand&eacute; contenues dans le r&eacute;pertoire
s&eacute;lectionn&eacute; dans le champ pr&eacute;c&eacute;dent. Lorsqu'on
choisit un autre r&eacute;pertoire, cette liste est mise &agrave; jour.
On peut &eacute;diter le nom de l'image &agrave; charger dans la zone de
saisie plac&eacute;e sous la liste.
<LI>La zone &laquo; Nom du fichier &raquo; est mise &agrave; jour &agrave;
partir des choix faits dans les deux champs pr&eacute;c&eacute;dents. Elle
peut aussi &ecirc;tre &eacute;dit&eacute;e directement, par exemple pour
entrer le nom complet (r&eacute;pertoire inclus) d'un fichier qui ne figure
pas dans les r&eacute;pertoires de la liste &laquo; R&eacute;pertoires
documents &raquo;. Dans ce cas, la liste &laquo; R&eacute;pertoires images
&raquo; sera compl&eacute;t&eacute;e.
<LI>Le champ &laquo; Affichage &raquo; permet de s&eacute;lectionner le mode
de visualisation de l'image dans le document :
<UL>
<LI>&laquo; Sans modification &raquo; restitue l'image telle quelle,
c'est-&agrave;-dire en respectant les dimensions donn&eacute;es dans le
fichier de l'image. Si l'image est plus grande que l'espace qui lui est
allou&eacute; (selon le sch&eacute;ma de pr&eacute;sentation), seule sa partie
centrale est visible. Dans le cas inverse, l'image est centr&eacute;e dans cet
espace.
<LI>&laquo; M&ecirc;mes proportions &raquo; agrandit ou r&eacute;duit l'image
de telle fa&ccedil;on que la plus grande dimension co&iuml;ncide exactement
avec celle de la bo&icirc;te dimensionn&eacute;e par l'utilisateur. Les
proportions de l'image sont conserv&eacute;es.
<LI>&laquo; Plein cadre &raquo; agrandit ou r&eacute;duit l'image de
fa&ccedil;on qu'elle remplisse l'espace qui lui est allou&eacute;, sans
contrainte de respect des proportions de l'image d'origine.
</UL>

</UL>

<H2><A NAME="secta9">9</A> <A NAME="L486">&Eacute;dition des
attributs</A></H2>

<P>Un cerain nombre de types d'&eacute;l&eacute;ments HTML peuvent porter des
attributs. Par exemple, l'&eacute;l&eacute;ment ancre lien porte l'attribut
<TT>HREF</TT> qui contient l'URL de l'ancre cible. Il est auusi possible de
modifier l'apparence graphique des cha&icirc;nes de texte en leur affectant
des attributs suivants :</P>

<UL>
<LI>Langue
<LI>Text_type
<LI>Emphasis_text
<LI>Strong_text
<LI>Italics_text
<LI>Bold_text
<LI>Underlined_text
<LI>Struck_text
<LI>Teletype
</UL>

<P>L'&eacute;diteur permet d'associer des attributs &agrave; des
&eacute;l&eacute;ments de la structure logique des documents, de visualiser
leurs valeurs, de modifier ces valeurs ou de supprimer des attributs. Tout
cela se fait en fonction du type des &eacute;l&eacute;ments de la
s&eacute;lection courante : seuls les attributs pr&eacute;vus par le
sch&eacute;ma peuvent &ecirc;tre associ&eacute;s &agrave; un
&eacute;l&eacute;ment et ils ne peuvent prendre que les valeurs
pr&eacute;vues.</P>

<H3><A NAME="sectb91">9.1</A> <A NAME="L3436">Attribut Langue</A></H3>

<P>L'attribut <TT>Langue</TT> peut &ecirc;tre associ&eacute; &agrave;
n'importe quel &eacute;l&eacute;ment ou cha&icirc;ne de caract&egrave;res pour
indiquer la langue dans laquelle le texte de cet &eacute;l&eacute;ment est
&eacute;crit.</P>

<P>L'attribut <TT>Langue</TT> est pris en compte par l'&eacute;diteur
lorsqu'il effectue des traitements de nature linguistique, comme la correction
orthographique (voir section <A HREF="#secta13">13</A>). Pour que ces
traitements donnent de bons r&eacute;sultats, il faut que l'attribut
<TT>Langue</TT> ait une valeur correcte, et cela pour les diff&eacute;rentes
parties du document, si le document est multilingue.</P>

<P>La notion de langue recouvre les langues naturelles (Fran&ccedil;ais,
Anglais, Allemand, Italien, Espagnol, Grec, Portuguais, etc.) et quelques
&laquo; dialectes &raquo; particuliers. Parmi ces derniers, on peut citer
:</P>

<UL>
<LI>ISO latin 1 : le texte s'&eacute;crit avec le jeu de caract&egrave;res ISO
latin 1, mais aucun traitement de nature linguistique n'est effectu&eacute;.
Cela est utile par exemple pour des fragments de programmes ou pour des
identificateurs.
<LI>Symbol : caract&egrave;res utilis&eacute;s dans les formules
math&eacute;matiques.
<LI>Greek : jeu de caract&egrave;res grecs.
</UL>

<P>L'&eacute;diteur met syst&eacute;matiquement un attribut <TT>Langue</TT>
sur l'&eacute;l&eacute;ment racine (ici, l'&eacute;l&eacute;ment
<TT>HTML</TT>) des documents qu'il cr&eacute;e. La valeur par d&eacute;faut de
cet attribut est la langue de dialogue de l'&eacute;diteur (voir section <A
HREF="#sectb151">15.1</A>), mais elle peut &ecirc;tre chang&eacute;e. </P>

<P>Tout &eacute;l&eacute;ment de texte est consid&eacute;r&eacute; comme
&eacute;crit dans la langue sp&eacute;cifi&eacute;e par l'attribut
<TT>Langue</TT> port&eacute; par le premier &eacute;l&eacute;ment englobant
qui poss&egrave;de un tel attribut. Mais on peut modifier sa valeur </P>

<H3><A NAME="sectb92">9.2</A> Pose des attributs</H3>

<P>L'attribut <TT>Langue</TT> et les attributs d&eacute;finis dans le
sch&eacute;ma HTML peuvent &ecirc;tre affect&eacute;s aux
&eacute;l&eacute;ments s&eacute;lectionn&eacute;s gr&acirc;ce au menu &laquo;
Attributs &raquo;. Le contenu de ce menu d&eacute;pend de la s&eacute;lection
courante et des sch&eacute;mas de structure : il donne la liste de tous les
attributs qui peuvent &ecirc;tre appliqu&eacute;s au premier
&eacute;l&eacute;ment s&eacute;lectionn&eacute;. De plus, si cet
&eacute;l&eacute;ment a d&eacute;j&agrave; des attributs, ceux-ci apparaissent
dans le menu pr&eacute;c&eacute;d&eacute;s d'une &eacute;toile.</P>

<P>Pour associer un attribut aux &eacute;l&eacute;ments
s&eacute;lectionn&eacute;s, il faut choisir l'attribut voulu dans le menu
&laquo; Attributs &raquo;, ce qui affiche un formulaire, o&ugrave; on peut
choisir ou saisir la valeur &agrave; donner &agrave; cet attribut. On valide
la commande en cliquant sur le bouton &laquo; Appliquer &raquo;. Le formulaire
reste &agrave; l'&eacute;cran et peut &ecirc;tre r&eacute;utilis&eacute; pour
appliquer le m&ecirc;me attribut &agrave; un autre &eacute;l&eacute;ment,
apr&egrave;s avoir &eacute;ventuellement chang&eacute; de valeur. Pour faire
dispara&icirc;tre le formulaire, il faut cliquer sur le bouton &laquo;
Abandonner &raquo;.</P>

<P>Un attribut peut &ecirc;tre d&eacute;fini comme obligatoire pour certains
types d'&eacute;l&eacute;ments. Dans ce cas, lorsqu'un &eacute;l&eacute;ment
de ce type est cr&eacute;&eacute;, l'&eacute;diteur impose la saisie de la
valeur de cet &eacute;l&eacute;ment : il refuse toute autre commande tant que
l'attribut n'a pas de valeur. Un exemple est donn&eacute; par l'attribut
<TT>HREF</TT> qui s'applique &agrave; un &eacute;l&eacute;ment <TT>ancre
lien</TT>. Lorsqu'on cr&eacute;e un &eacute;l&eacute;ment du type <TT>ancre
Lien</TT>, la saisie de l'attribut <TT>HREF</TT> devient obligatoire (il faut
d&eacute;signer l'objet cible du lien ou donner explicitement son URL).</P>

<H3><A NAME="sectb93">9.3</A> Consultation, modification et suppression d'un
attribut</H3>

<P>Pour conna&icirc;tre tous les attributs associ&eacute;s &agrave; un
&eacute;l&eacute;ment, on s&eacute;lectionne d'abord cet
&eacute;l&eacute;ment, puis on appelle le menu &laquo; Attributs &raquo;.
Celui-ci donne la liste de tous les attributs qui peuvent &ecirc;tre
appliqu&eacute;s &agrave; l'&eacute;l&eacute;ment. Dans cette liste, les
attributs qui sont effectivement associ&eacute;s &agrave;
l'&eacute;l&eacute;ment apparaissent pr&eacute;c&eacute;d&eacute;s d'une
&eacute;toile.</P>

<P>Pour conna&icirc;tre la valeur d'un attribut port&eacute; par un
&eacute;l&eacute;ment, on s&eacute;lectionne d'abord cet
&eacute;l&eacute;ment, puis on appelle le menu &laquo; Attributs &raquo; ;
l'attribut &agrave; modifier y figure pr&eacute;c&eacute;d&eacute; d'une
&eacute;toile. En choisissant cette entr&eacute;e du menu, on fait
appara&icirc;tre un formulaire qui affiche la valeur de l'attribut. En
cliquant sur le bouton &laquo; Abandonner &raquo;, le formulaire se ferme.</P>

<P>Pour supprimer un attribut port&eacute; par un &eacute;l&eacute;ment, on
fait de m&ecirc;me, mais on clique sur le bouton &laquo; Supprimer &raquo; du
formulaire. Ce m&ecirc;me formulaire reste &agrave; l'&eacute;cran et peut
&agrave; nouveau &ecirc;tre utilis&eacute; pour supprimer un attribut de
m&ecirc;me type port&eacute; par un autre &eacute;l&eacute;ment : il suffit de
s&eacute;lectionner l'&eacute;l&eacute;ment voulu et de cliquer &agrave;
nouveau sur le bouton &laquo; Supprimer &raquo;. On clique sur le bouton
&laquo; Abandonner &raquo; lorsque le formulaire n'est plus utile.</P>

<P>Pour modifier la valeur d'un attribut port&eacute; par un
&eacute;l&eacute;ment, on op&egrave;re de la m&ecirc;me fa&ccedil;on, mais on
clique sur le bouton &laquo; Appliquer &raquo; apr&egrave;s avoir saisi la
nouvelle valeur de l'attribut.</P>

<H2><A NAME="secta10">10</A> Recherche d'&eacute;l&eacute;ments</H2>

<P>La commande de recherche permet de rechercher non seulement en fonction du
texte, mais &eacute;galement en fonction du type de
l'&eacute;l&eacute;ment.</P>

<H3><A NAME="sectb101">10.1</A> <A NAME="L2339">Recherche et remplacement de
texte</A></H3>

<P>L'entr&eacute;e &laquo; Texte et structure &raquo; du menu &laquo;
Recherche &raquo; (dans la barre de menu, en haut de chaque fen&ecirc;tre
document) affiche un formulaire qui offre le moyen de se d&eacute;placer
&agrave; travers un document en fonction du contenu et/ou de la structure. La
moiti&eacute; gauche de ce formulaire concerne la recherche et le remplacement
de texte :</P>

<UL>
<LI>La cha&icirc;ne de caract&egrave;res &agrave; rechercher doit &ecirc;tre
entr&eacute;e dans la zone &laquo; Texte &agrave; chercher &raquo;.
<LI>Si le bouton &laquo; Expression r&eacute;guli&egrave;re &raquo; est
s&eacute;lectionn&eacute;, la cha&icirc;ne qui se trouve dans la zone &laquo;
Texte &agrave; chercher &raquo; sera interpr&eacute;t&eacute;e comme une
expression r&eacute;guli&egrave;re (voir section <A HREF="#sectb102">10.2</A>)
et c'est cette expression qui sera recherch&eacute;e dans le document.
<LI>Si le bouton &laquo; MAJUSCULES = minuscules &raquo; est
s&eacute;lectionn&eacute;, la recherche se fait sans distinguer entre
majuscules et minuscules ; sinon, la cha&icirc;ne est recherch&eacute;e telle
qu'elle appara&icirc;t dans la zone &laquo; Texte &agrave; chercher &raquo;.
<LI>Le menu &laquo; O&ugrave; rechercher &raquo; permet d'indiquer la partie
du document dans laquelle se fait la recherche :
<UL>
<LI>&laquo; Avant la s&eacute;lection &raquo; : la recherche commence au
d&eacute;but de la partie s&eacute;lectionn&eacute;e et remonte jusqu'au
d&eacute;but du document.
<LI>&laquo; Dans la s&eacute;lection &raquo; : la recherche n'a lieu
qu'&agrave; l'int&eacute;rieur de la partie s&eacute;lectionn&eacute;e, du
d&eacute;but de cette partie jusqu'&agrave; sa fin.
<LI>&laquo; Apr&egrave;s la s&eacute;lection &raquo; : la recherche commence
&agrave; la fin de la partie s&eacute;lectionn&eacute;e et va jusqu'&agrave;
la fin du document.
<LI>&laquo; Dans tout le document &raquo; : la recherche a lieu dans tout le
document, du d&eacute;but vers la fin, quelle que soit la partie
s&eacute;lectionn&eacute;e.
</UL>

</UL>

<P>Pour lancer la recherche, il faut cliquer sur le bouton &laquo; Confirmer
&raquo;, en bas du formulaire. Si la cha&icirc;ne cherch&eacute;e est
trouv&eacute;e, elle est s&eacute;lectionn&eacute;e et le document est
positionn&eacute; de fa&ccedil;on que cette cha&icirc;ne soit visible ; on
peut alors chercher la prochaine occurrence de cette cha&icirc;ne en
s&eacute;lectionnant &agrave; nouveau le bouton &laquo; Confirmer &raquo;. Si
la cha&icirc;ne n'est pas trouv&eacute;e, le message &laquo; Pas trouv&eacute;
&raquo; s'affiche en bas &agrave; droite du formulaire.</P>

<P>Les cha&icirc;nes trouv&eacute;es de cette fa&ccedil;on peuvent &ecirc;tre
remplac&eacute;es par la m&ecirc;me op&eacute;ration. Il faut saisir dans la
zone &laquo; Texte de remplacement &raquo; le texte qui doit remplacer les
cha&icirc;nes trouv&eacute;es et indiquer dans le menu &laquo; Remplacement
&raquo; le mode de remplacement :</P>

<UL>
<LI>&laquo; Sans remplacement &raquo; : aucun remplacement n'a lieu,
m&ecirc;me si la zone &laquo; Texte de remplacement &raquo; contient une
cha&icirc;ne de caract&egrave;res. Il s'agit d'une simple recherche.
<LI>&laquo; Remplacement &agrave; la demande &raquo; : lorsque la cha&icirc;ne
est trouv&eacute;e, elle est s&eacute;lectionn&eacute;e. L'utilisateur peut
alors s&eacute;lectionner l'un des deux boutons :
<UL>
<LI>&laquo; Confirmer &raquo;, pour effectuer le remplacement et relancer la
recherche,
<LI>&laquo; Sauter &raquo;, pour chercher la prochaine occurrence, sans
remplacer la cha&icirc;ne qui a &eacute;t&eacute; trouv&eacute;e.
</UL>

<LI>&laquo; Remplacement automatique &raquo; : toutes les occurrences de la
cha&icirc;ne cherch&eacute;e sont automatiquement remplac&eacute;es dans la
partie du document indiqu&eacute;e par le menu &laquo; O&ugrave; remplacer
&raquo;.
</UL>

<P>A tout instant, la recherche ou le remplacement peuvent &ecirc;tre
abandonn&eacute;s gr&acirc;ce au bouton &laquo; Abandonner &raquo;. </P>

<P>Attention, les op&eacute;rations de remplacement effectu&eacute;es ne
peuvent &ecirc;tre annul&eacute;es (il n'y a pas de commande &laquo; Undo
&raquo;).</P>

<H3><A NAME="sectb102">10.2</A> <A NAME="L2603">Recherche d'expressions
r&eacute;guli&egrave;res</A></H3>

<P>Une expression r&eacute;guli&egrave;re sp&eacute;cifie un ensemble de
cha&icirc;nes de caract&egrave;res &agrave; rechercher. La recherche par
expressions r&eacute;guli&egrave;res se fait de la m&ecirc;me fa&ccedil;on que
la recherche d'une cha&icirc;ne de caract&egrave;res. L'expression
r&eacute;guli&egrave;re cherch&eacute;e doit &ecirc;tre saisie dans la zone
&laquo; Texte &agrave; chercher &raquo; du formulaire et le bouton &laquo;
Expression r&eacute;guli&egrave;re &raquo; doit &ecirc;tre
s&eacute;lectionn&eacute;. Le bouton &laquo; MAJUSCULES = minuscules &raquo;
peut &ecirc;tre utilis&eacute; de la m&ecirc;me fa&ccedil;on que dans la
recherche de simples cha&icirc;nes de caract&egrave;res.</P>

<P>Une expression r&eacute;guli&egrave;re est une cha&icirc;ne de
caract&egrave;res qui comprend des caract&egrave;res ordinaires et des
caract&egrave;res sp&eacute;ciaux. Ces caract&egrave;res sp&eacute;ciaux
repr&eacute;sentent chacun un ensemble de caract&egrave;res :</P>

<P>.  Un point repr&eacute;sente un caract&egrave;re quelconque, &agrave;
l'exception de l'espace.
Par exemple, l'expression r&eacute;guli&egrave;re a.b repr&eacute;sente
n'importe quelle cha&icirc;ne de trois caract&egrave;res qui commence par a et
finit par b.</P>

<P>*  L'&eacute;toile repr&eacute;sente z&eacute;ro, une ou plusieurs
occurrences de l'expression r&eacute;guli&egrave;re qui la
pr&eacute;c&egrave;de.
Par exemple, l'expression ab* repr&eacute;sente un a suivi d'un nombre
quelconque de b.
L'&eacute;toile s'applique toujours &agrave; la plus petite expression
r&eacute;guli&egrave;re qui pr&eacute;c&egrave;de. Dans l'exemple ab*, c'est
le b qui est r&eacute;p&eacute;t&eacute;, et non la cha&icirc;ne ab.</P>

<P>?  Le point d'interrogation repr&eacute;sente z&eacute;ro ou une occurrence
de l'expression r&eacute;guli&egrave;re qui le pr&eacute;c&egrave;de. Comme
l'&eacute;toile, il retient l'expression pr&eacute;c&eacute;dente la plus
courte.
Par exemple, a?bc repr&eacute;sente abc ou bc, et rien d'autre.</P>

<P>+  Le plus est similaire &agrave; l'&eacute;toile, mais il
repr&eacute;sente au moins une occurrence de l'expression
r&eacute;guli&egrave;re pr&eacute;c&eacute;dente.
Par exemple, ab+c repr&eacute;sente abc ou abbbc, mais pas ac.</P>

<P>[...] Une suite de caract&egrave;res entre crochets repr&eacute;sente
n'importe lequel des caract&egrave;res de cette suite.
Par exemple, [abcxyz] repr&eacute;sente n'importe laquelle des trois
premi&egrave;res ou des trois derni&egrave;res lettres de l'alphabet.
[a-z] repr&eacute;sente n'importe quelle lettre minuscule de l'alphabet,
lettres accentu&eacute;es exclues.
[&agrave;-&uuml;] et [&Agrave;-&Uuml;] repr&eacute;sentent tous les
caract&egrave;res accentu&eacute;s.</P>

<P>[^...] Une suite de caract&egrave;res pr&eacute;c&eacute;d&eacute;e d'un
circonflexe et plac&eacute;e entre crochets repr&eacute;sente n'importe quel
caract&egrave;re, &agrave; l'exclusion des caract&egrave;res de cette suite.
Par exemple, [^0-9] repr&eacute;sente n'importe quel caract&egrave;re sauf un
chiffre.</P>

<P>\   Le caract&egrave;re \ a deux fonctions :
1 - c'est un caract&egrave;re d'&eacute;chappement : il indique que le
caract&egrave;re sp&eacute;cial qui le suit doit &ecirc;tre trait&eacute;
comme un caract&egrave;re ordinaire ; par exemple, l'expression ab\*
repr&eacute;sente seulement la cha&icirc;ne ab*
2 - il introduit d'autres caract&egrave;res sp&eacute;ciaux, d&eacute;crits
ci-dessous.</P>

<P>\| sp&eacute;cifie une alternative : une expression form&eacute;e de deux
expressions r&eacute;guli&egrave;res s&eacute;par&eacute;es par \|
repr&eacute;sente l'une ou l'autre de ces deux expressions
r&eacute;guli&egrave;res.
Par exemple, ici\|l&agrave; repr&eacute;sente aussi bien la cha&icirc;ne ici
que la cha&icirc;ne l&agrave;.
\| s'applique aux plus larges expressions r&eacute;guli&egrave;res voisines ;
le groupement par \(...\) peut limiter la port&eacute;e de l'op&eacute;rateur
\|.</P>

<P>\(...\) Cette construction permet de d&eacute;limiter la port&eacute;e d'un
op&eacute;rateur : l'op&eacute;rateur porte sur l'expression qui est &agrave;
l'int&eacute;rieur de cette sorte de parenth&egrave;se.
Par exemple, .*\(tion\|sion\) repr&eacute;sente tous les mots termin&eacute;s
par &laquo; tion &raquo; ou &laquo; sion &raquo;.
Autre exemple, ba\(na\)* repr&eacute;sente, entre autres, le mot banana.</P>

<P>\b  repr&eacute;sente une cha&icirc;ne vide au d&eacute;but ou &agrave; la
fin d'un mot.
Par exemple, \bmot\b repr&eacute;sente le mot mot, mais pas la cha&icirc;ne
mot dans moteur ou &eacute;motion.</P>

<P>\B repr&eacute;sente une cha&icirc;ne vide qui n'est pas au d&eacute;but ou
&agrave; la fin d'un mot.</P>

<P>\&lt; repr&eacute;sente une cha&icirc;ne vide au d&eacute;but d'un mot.</P>

<P>\&gt; repr&eacute;sente une cha&icirc;ne vide &agrave; la fin d'un mot.</P>

<P>\w repr&eacute;sente n'importe quel caract&egrave;re qui est une lettre ou
un chiffre.</P>

<P>\W repr&eacute;sente n'importe quel caract&egrave;re qui n'est ni une
lettre ni un chiffre.</P>

<P>\s suivi d'un symbole repr&eacute;sente un caract&egrave;re parmi un
ensemble pr&eacute;d&eacute;fini qui correspond au symbole :
\s! repr&eacute;sente l'un des deux caract&egrave;res ! ?
\s. repr&eacute;sente l'un des quatre caract&egrave;res . ; : ,
\s( repr&eacute;sente l'un des quatre caract&egrave;res  ( [ { &laquo;
\s) repr&eacute;sente l'un des quatre caract&egrave;res  ) ] } &raquo;
\s  (\s suivi d'un espace) repr&eacute;sente n'importe quel espace.</P>

<H3><A NAME="sectb103">10.3</A> Recherche d'&eacute;l&eacute;ments d'un type
donn&eacute;</H3>

<P>L'entr&eacute;e &laquo; Texte et structure &raquo; du menu &laquo;
Recherche &raquo; affiche un formulaire qui peut &ecirc;tre utilis&eacute;
pour rechercher un &eacute;l&eacute;ment d'un type donn&eacute;. Lorsque la
zone &laquo; Texte &agrave; chercher &raquo; de ce formulaire est vide, on
peut s&eacute;lectionner un type d'&eacute;l&eacute;ment dans la liste &laquo;
Type &agrave; chercher &raquo;. On peut aussi saisir directement le nom de ce
type dans la zone plac&eacute;e sous la liste. Lorsqu'on clique sur le bouton
&laquo; Confirmer &raquo; du formulaire, l'&eacute;diteur cherche alors le
prochain &eacute;l&eacute;ment du type demand&eacute; et il le
s&eacute;lectionne. Comme pour la recherche de texte, la recherche a lieu dans
la partie du document indiqu&eacute;e dans le menu &laquo; O&ugrave;
rechercher &raquo; du formulaire.</P>

<H3><A NAME="sectb104">10.4</A> Recherches combin&eacute;es</H3>

<P>On peut rechercher une cha&icirc;ne de caract&egrave;res ou une expression
r&eacute;guli&egrave;re qui figure dans un &eacute;l&eacute;ment d'un type
donn&eacute; en remplissant les deux zones &laquo; Texte &agrave; chercher
&raquo; et &laquo; Type &agrave; chercher &raquo;. On peut &eacute;galement
combiner cette recherche avec celle d'un attribut.</P>

<P>On peut aussi demander le remplacement des cha&icirc;nes trouv&eacute;es
dans un contexte donn&eacute;, en utilisant la zone &laquo; Texte de
remplacement &raquo; et les options de &laquo; Remplacement &raquo;, de la
m&ecirc;me fa&ccedil;on qu'en <A HREF="#sectb101">10.1</A>.</P>

<H3><A NAME="sectb105">10.5</A> Recherche d'&eacute;l&eacute;ments vides</H3>

<P>Les &eacute;l&eacute;ments qui n'ont pas de contenu apparaissent sous la
forme d'un rectangle tram&eacute;.</P>

<P>Ces &eacute;l&eacute;ments sont dans un &eacute;tat provisoire :
l'utilisateur doit soit les supprimer soit leur donner un contenu. Une
commande permet de rechercher ces &eacute;l&eacute;ments vides, pour
&ecirc;tre s&ucirc;r de les traiter tous.</P>

<P>Pour lancer cette commande, il faut s&eacute;lectionner l'entr&eacute;e
&laquo; &Eacute;l&eacute;ments vides &raquo; du menu &laquo; Recherche
&raquo;, ce qui affiche un formulaire pr&eacute;sentant le m&ecirc;me
sous-menu &laquo; O&ugrave; rechercher &raquo; que la commande de recherche de
texte. Apr&egrave;s avoir s&eacute;lectionn&eacute; la zone de recherche,
chaque fois qu'on active le bouton &laquo; Confirmer &raquo; de ce formulaire,
l'&eacute;l&eacute;ment vide suivant est recherch&eacute; et
s&eacute;lectionn&eacute;, jusqu'&agrave; ce que tous les
&eacute;l&eacute;ments vides de la zone de recherche aient &eacute;t&eacute;
trouv&eacute;s. Le message &laquo; Pas trouv&eacute; &raquo; s'affiche alors
en bas du formulaire.</P>

<H2><A NAME="secta11">11</A> <A NAME="L3800">Vues</A></H2>

<P>La structure d'un document HTML peut &ecirc;tre pr&eacute;sent&eacute;e
&agrave; l'&eacute;cran &agrave; travers plusieurs vues :</P>

<UL>
<LI>Vue_du _document : c'est la vue WYSIWYG
<LI>Vue_source : cette vue repr&eacute;sente le document sous sa forme source
HTML
<LI>Vue_des_ancres
<LI>Vue_alternative
<LI>Table_des_mati&egrave;res
</UL>

<P>L'utilisateur peut ouvrir les vues qu'il veut, quand il veut. Une
m&ecirc;me vue peut &ecirc;tre ouverte en plusieurs exemplaires
simultan&eacute;ment, pour montrer diff&eacute;rentes parties d'un
document.</P>

<P>Toutes les vues peuvent jouer le m&ecirc;me r&ocirc;le dans
l'&eacute;dition d'un document. On peut s&eacute;lectionner une partie d'un
document dans n'importe quelle vue et appliquer toute commande
d'&eacute;dition, quelle que soit la vue o&ugrave; la s&eacute;lection a
&eacute;t&eacute; faite. Le r&eacute;sultat des commandes est traduit
visuellement dans toutes les vues o&ugrave; ce r&eacute;sultat est
perceptible.</P>

<H3><A NAME="sectb111">11.1</A> Ouverture et fermeture de vues</H3>

<P>Pour ouvrir une vue, on peut utiliser la commande &laquo; Ouvrir une vue
&raquo; du menu &laquo; Vues &raquo;. On active cette commande depuis
n'importe quelle vue du document concern&eacute;. Un menu affiche alors la
liste des vues d&eacute;finies pour le document ; les noms suivis d'une
&eacute;toile indiquent les vues d&eacute;j&agrave; ouvertes. Une fois la vue
choisie, une fen&ecirc;tre s'ouvre pour afficher la vue voulue. </P>

<P>Si le nombre maximum de vues que sait g&eacute;rer l'&eacute;diteur est
atteint (voir section <A HREF="#secta16">16</A>), l'&eacute;diteur affiche le
message &laquo; Nombre maximum de vues atteint &raquo; dans la fen&ecirc;tre
Tamaya. Il faut alors fermer une vue par la commande &laquo; Fermer la vue
&raquo; du menu &laquo; Vues &raquo; pour pouvoir ouvrir une nouvelle vue.</P>

<P>Pour fermer une vue, il faut utiliser la commande &laquo; Fermer la vue
&raquo; du menu &laquo; Vues &raquo;, dans la barre de menus de la
fen&ecirc;tre de la vue &agrave; fermer. La fen&ecirc;tre correspondante
dispara&icirc;t de l'&eacute;cran. Dans le cas o&ugrave; il s'agit de la
derni&egrave;re vue ouverte du document, l'&eacute;diteur ferme en m&ecirc;me
temps le document, mais il offre la possibilit&eacute; de le sauver si des
modifications ont &eacute;t&eacute; faites (il permet aussi d'abandonner la
commande, si on ne souhaite pas fermer le document).</P>

<H3><A NAME="sectb112">11.2</A> D&eacute;placement dans le document</H3>

<P>Les vues peuvent &ecirc;tre utilis&eacute;es pour se d&eacute;placer
&agrave; travers un document. Lorsqu'une cha&icirc;ne de caract&egrave;res ou
un &eacute;l&eacute;ment est s&eacute;lectionn&eacute;, il est
visualis&eacute; dans toutes les vues o&ugrave; le sch&eacute;ma de
pr&eacute;sentation permet de l'afficher. Ainsi, en cliquant sur un
caract&egrave;re ou un &eacute;l&eacute;ment dans une vue, on fait
appara&icirc;tre le m&ecirc;me &eacute;l&eacute;ment dans les autres vues
ouvertes.</P>

<P>Ce principe peut &ecirc;tre appliqu&eacute; &agrave; la table des
mati&egrave;res : il suffit de cliquer sur un titre de section de la table des
mati&egrave;res pour que la partie affich&eacute;e dans la vue principale du
document soit d&eacute;plac&eacute;e de fa&ccedil;on que ce titre
apparaisse.</P>

<P>Cette <EM>synchronisation</EM> des vues peut &ecirc;tre g&ecirc;nante dans
certaines circonstances, en particulier lorsque plusieurs exemplaires de la
m&ecirc;me vue sont ouverts pour visualiser diff&eacute;rentes parties du
document. C'est pourquoi il est possible de d&eacute;synchroniser les vues
&agrave; l'aide de la commande &laquo; D&eacute;synchroniser &raquo; du menu
&laquo; Vues &raquo;. Lorsqu'elle a &eacute;t&eacute;
d&eacute;synchronis&eacute;e, une vue peut &ecirc;tre resynchronis&eacute;e,
par la commande &laquo; Synchroniser &raquo; du m&ecirc;me menu. Les deux
commandes &laquo; Synchroniser &raquo; et &laquo; D&eacute;synchroniser
&raquo; apparaissent dans le menu l'une &agrave; la place de l'autre selon
l'&eacute;tat de la vue.</P>

<H3><A NAME="sectb113">11.3</A> Changement de taille (Zoom)</H3>

<P>La commande &laquo; Zoom &raquo; du menu &laquo; Vues &raquo; permet
d'augmenter ou de diminuer la taille des caract&egrave;res utilis&eacute;s
pour l'affichage dans une vue. Cette commande pr&eacute;sente un formulaire
qui indique le nom du document et de la vue concern&eacute;s, ainsi que
l'&eacute;cart de la taille des caract&egrave;res utilis&eacute;s par rapport
&agrave; la taille &laquo; normale &raquo;, telle qu'elle est
sp&eacute;cifi&eacute;e dans le sch&eacute;ma de pr&eacute;sentation. Chaque
fois qu'on appuie sur le bouton &laquo; Augmenter &raquo;, les
caract&egrave;res grossissent dans la vue concern&eacute;e (et uniquement dans
cette vue) et l'&eacute;cart augmente de 1. Le bouton &laquo; Diminuer &raquo;
a l'effet inverse.</P>

<P>La commande &laquo; Zoom &raquo; n'agit que sur l'image du document
affich&eacute;e sur l'&eacute;cran. La pagination et l'impression ne tiennent
pas compte de ce changement de la taille des caract&egrave;res.</P>

<P>L'effet de la commande &laquo; Zoom &raquo; est temporaire : il n'est pas
enregistr&eacute; dans le document. </P>

<H2><A NAME="secta12">12</A> Pagination et impression des documents</H2>

<P>Pour pouvoir imprimer un document HTML, il faut que le syst&egrave;me
formate le document en tenant compte des coupures de pages n&eacute;cessaires
et en produisant les informations de haut et de bas de page (num&eacute;ros de
page, titres, etc.). </P>

<P>Avant de lancer l'impression, il faut donc s'assurer que le document est
format&eacute; avec un sch&eacute;ma de pr&eacute;sentation avec des pages
(voir section <A HREF="#sectb121">12.1</A> pour changer de sch&eacute;ma) et
il faut le paginer si besoin (section <A HREF="#sectb122">12.2</A>).</P>

<H3><A NAME="sectb121">12.1</A> <A NAME="L4078">Pr&eacute;sentation du
document avec des pages</A></H3>

<P>&Agrave; tout moment, l'utilisateur peut changer de sch&eacute;ma de
pr&eacute;sentation, par la commande &laquo; Pr&eacute;senter &raquo; du menu
&laquo; Document &raquo;. Cette commande affiche le menu des diff&eacute;rents
sch&eacute;mas  de pr&eacute;sentation qui peuvent s'appliquer aux documents
HTML :</P>

<UL>
<LI>Pr&eacute;sentation standard
<LI>Avec pages
<LI>En noir et blanc
</UL>

<P> L'entr&eacute;e gris&eacute;e de ce menu indique le sch&eacute;ma de
pr&eacute;sentation actuellement utilis&eacute;. Une fois ce choix fait,
l'&eacute;diteur r&eacute;affiche le document en utilisant ce sch&eacute;ma de
pr&eacute;sentation pour pr&eacute;senter tous les &eacute;l&eacute;ments du
document..</P>

<H3><A NAME="sectb122">12.2</A> <A NAME="L4083">Pagination</A></H3>

<P>Contrairement aux autres aspects de la pr&eacute;sentation, la mise en page
n'est pas assur&eacute;e en permanence par l'&eacute;diteur, mais seulement
sur demande de l'utilisateur.</P>

<P>Lorsqu'on utilise un sch&eacute;ma de pr&eacute;sentation qui
sp&eacute;cifie des pages, on peut demander le d&eacute;coupage du document en
pages pour une seule vue ou pour toutes les vues :</P>

<UL>
<LI>La commande &laquo; Paginer &raquo; du menu &laquo; Document &raquo;
pagine toutes les vues ouvertes du document en appliquant
syst&eacute;matiquement les r&egrave;gles de mise en page d&eacute;finies dans
le sch&eacute;ma de pr&eacute;sentation courant.
<LI>La commande &laquo; Paginer &raquo; du menu &laquo; Vues &raquo; pagine
seulement la vue o&ugrave; la commande a &eacute;t&eacute; appel&eacute;e.
</UL>

<P>Pour ins&eacute;rer un saut de page &agrave; un emplacement pr&eacute;cis
du document, il faut s&eacute;lectionner l'&eacute;l&eacute;ment ou la
cha&icirc;ne de caract&egrave;res pr&egrave;s duquel on d&eacute;sire placer
la coupure, et appeler la commande &laquo; Ins&eacute;rer un saut de page
&raquo; du menu &laquo; Pr&eacute;sentation &raquo;. Cette commande affiche un
menu qui permet de choisir la position du saut de page &agrave; cr&eacute;er :
soit devant, soit apr&egrave;s la partie s&eacute;lectionn&eacute;e. Les sauts
de page ins&eacute;r&eacute;s de cette fa&ccedil;on sont conserv&eacute;s
lorsque le document est remis en pages par les commandes de pagination
automatique. On peut les supprimer comme n'importe quel autre saut de
page.</P>

<H3><A NAME="sectb123">12.3</A> Impression</H3>

<P>On peut imprimer les documents Tamaya directement depuis l'&eacute;diteur,
gr&acirc;ce &agrave; la commande &laquo; Imprimer &raquo; du menu &laquo;
Document &raquo;. Cette commande produit une repr&eacute;sentation du document
en PostScript, identique &agrave; ce qui est affich&eacute; &agrave;
l'&eacute;cran au moment o&ugrave; on appelle la commande. Cette
repr&eacute;sentation PostScript du document peut &ecirc;tre soit
sauv&eacute;e dans un fichier, soit envoy&eacute;e directement &agrave; une
imprimante. La commande affiche un formulaire o&ugrave; on peut choisir :</P>

<UL>
<LI>Les pages &agrave; imprimer (num&eacute;ro de la premi&egrave;re page
&agrave; imprimer et num&eacute;ro de la derni&egrave;re) ; par d&eacute;faut,
les valeurs affich&eacute;es sont les num&eacute;ros de la premi&egrave;re et
de la derni&egrave;re page de la vue principale du document.
<LI>Les vues &agrave; imprimer (voir section <A HREF="#secta11">11</A>) ;
<LI>La destination (imprimante ou fichier) et le nom de l'imprimante ou du
fichier.
<LI>Le format du papier ; 
<LI>Le nombre d'exemplaires.
<LI>Quelques options :
<UL>
<LI>&laquo; Repagination &raquo; avant l'impression ; la repagination a le
m&ecirc;me effet que la commande &laquo; Paginer &raquo; du menu &laquo;
Document &raquo; (voir section <A HREF="Thotman-F.html#L2336">8.4.1</A>) et
permet d'&ecirc;tre s&ucirc;r qu'aucune page ne sera trop longue ou trop
courte.
<LI>&laquo; Alimentation manuelle &raquo; : permet de mettre l'imprimante dans
le mode manuel o&ugrave; les feuilles de papier (ou les transparents) sont
introduits un par un, &agrave; la main. Cette option est sp&eacute;cifique
&agrave; certaines imprimantes.
<LI>&laquo; Avec trame &raquo; : les rectangles tram&eacute;s qui
repr&eacute;sentent les &eacute;l&eacute;ments vides ne sont imprim&eacute;s.
<LI>&laquo; Sortie noir et blanc &raquo; : imprime les documents couleur en
noir et blanc. Cette option est sp&eacute;cifique &agrave; certaines
imprimantes.
</UL>

</UL>

<P>Le bouton &laquo; Changer de format &raquo; affiche un autre formulaire qui
permet de modifier :</P>

<UL>
<LI>la marge gauche et la marge du haut,
<LI>l'orientation du papier, portrait ou paysage, 
<LI>le nombre de pages du document imprim&eacute;es sur chaque feuille (1, 2
ou 4) ; un nombre sup&eacute;rieur &agrave; 1 entra&icirc;ne une
r&eacute;duction correspondante de la taille de chaque image de page,
<LI>le taux d'agrandissement ou de r&eacute;duction.
</UL>

<P>Une fois le nouveau format choisi dans ce formulaire, il faut appuyer sur
son bouton &laquo; Appliquer &raquo;, avant d'appuyer sur le bouton &laquo;
Confirmer &raquo; du formulaire &laquo; Imprimer &raquo;. C'est ce dernier
bouton qui lance effectivement l'impression.</P>

<P>Il est possible de continuer de travailler sur le document une fois
l'impression lanc&eacute;e. Un message dans la fen&ecirc;tre Tamaya indique
que le document PostScript est pr&ecirc;t, soit dans la file d'attente de
l'imprimante, soit dans le fichier, selon la destination choisie. Le message
&laquo; Erreur dans la cr&eacute;ation du fichier PostScript &raquo;
appara&icirc;t si l'impression ne peut &ecirc;tre effectu&eacute;e (et quelle
qu'en soit la cause).</P>

<H2><A NAME="secta13">13</A> <A NAME="L3503">Correction
orthographique</A></H2>

<P>L'&eacute;diteur Tamaya permet &agrave; tout moment de corriger le texte
d'un document en cours de traitement. La correction est fond&eacute;e sur la
consultation de dictionnaires. Le correcteur compare les mots du texte avec
ceux qui figurent dans les dictionnaires &agrave; sa disposition et, pour
chaque mot qui ne figure pas dans les dictionnaires consult&eacute;s, il
propose quelques mots de remplacement. C'est &agrave; l'utilisateur de choisir
le mot qui convient parmi les mots propos&eacute;s (ou d'entrer un autre mot)
et le correcteur fait le remplacement.</P>

<P>La correction est multilingue : le correcteur consulte des dictionnaires
diff&eacute;rents selon la valeur de l'attribut Langue (voir section <A
HREF="#sectb91">9.1</A>) qui s'applique au texte analys&eacute;. Actuellement,
plusieurs dictionnaires sont disponibles : pour le fran&ccedil;ais, l'anglais,
l'allemand, l'espagnol, le n&eacute;erlandais, le su&eacute;dois et l'italien.
Les passages (ou les documents) dans des langues pour lesquelles le correcteur
ne trouve pas de dictionnaires ne sont pas corrig&eacute;s.</P>

<P>Le menu &laquo; Outils &raquo;, en haut des fen&ecirc;tres document, donne
acc&egrave;s &agrave; la commande &laquo; Corriger &raquo;. Cette commande
affiche un formulaire qui permet de choisir les param&egrave;tres de la
correction et de dialoguer avec le correcteur. Ce formulaire comprend :</P>

<UL>
<LI>Le nombre maximum de propositions de corrections est indiqu&eacute; dans
la zone &laquo; Nombre de propositions &raquo;. Par d&eacute;faut, ce nombre a
la valeur 3. Il peut prendre une valeur comprise entre 1 et 10. Apr&egrave;s
qu'une erreur a &eacute;t&eacute; d&eacute;tect&eacute;e, la modification de
cette valeur par l'utilisateur provoque instantan&eacute;ment
l'&eacute;valuation d'une nouvelle liste de propositions.
<LI>Plusieurs boutons permettent d'ignorer certains mots : ceux qui
contiennent des lettres capitales, des chiffres, des chiffres romains ou les
caract&egrave;res sp&eacute;ciaux indiqu&eacute;s dans la liste plac&eacute;e
au-dessous. Cette liste peut &ecirc;tre modifi&eacute;e par l'utilisateur.
<LI>Le sous-menu &laquo; O&ugrave; corriger &raquo;  permet d'indiquer la
partie du document dans laquelle se fait la recherche.
<LI>Le mot erron&eacute; trouv&eacute; est affich&eacute; dans la zone &laquo;
Corriger... &raquo;. La liste des propositions de corrections est
indiqu&eacute;e dans le s&eacute;lecteur plac&eacute; en dessous de ce mot
erron&eacute;. Par d&eacute;faut, c'est la premi&egrave;re proposition de
correction qui est s&eacute;lectionn&eacute;e. Mais il suffit de cliquer sur
une autre proposition pour la s&eacute;lectionner. La proposition
s&eacute;lectionn&eacute;e est affich&eacute;e en dessous du s&eacute;lecteur.
Cette proposition peut &ecirc;tre modifi&eacute;e directement dans le
formulaire. La correction n'est effective que lorsqu'on a cliqu&eacute; sur
l'un des boutons &laquo; Remplacer &raquo; ou &laquo; Remplacer (+dic)
&raquo;.
<LI>La langue dans laquelle s'est effectu&eacute;e la correction est
indiqu&eacute;e en haut &agrave; gauche du formulaire. Pour changer cette
langue, il suffit de poser un attribut Langue sur le texte concern&eacute; en
utilisant le formulaire &laquo; Attributs &raquo; et de relancer ensuite la
correction.
</UL>

<P>Pour lancer la correction, il faut cliquer sur le bouton &laquo; Suivant
&raquo;, en bas du formulaire. Si une faute est trouv&eacute;e, le mot
erron&eacute; est s&eacute;lectionn&eacute; et le document est
positionn&eacute; de fa&ccedil;on que cette cha&icirc;ne soit visible. Si
aucune faute n'est d&eacute;tect&eacute;e, le message &laquo; Pas
trouv&eacute; &raquo; s'affiche en bas &agrave; droite du formulaire.</P>

<P>L'utilisateur peut alors utiliser l'un des boutons plac&eacute;s en bas du
formulaire pour effectuer l'une des op&eacute;rations suivantes :</P>

<UL>
<LI>&laquo; Abandonner &raquo; : le formulaire dispara&icirc;t et la
correction est abandonn&eacute;e. Les corrections d&eacute;j&agrave;
effectu&eacute;es demeurent.
<LI>&laquo; Suivant &raquo; : le mot que le correcteur consid&egrave;re comme
erron&eacute; est acceptable. Aucune modification n'est faite dans le texte ni
dans les dictionnaires et le correcteur cherche le mot erron&eacute; suivant.
<LI>&laquo; Suivant (+dic) &raquo; : idem Suivant, mais le mot que le
correcteur consid&egrave;re comme erron&eacute; est rang&eacute; dans le
dictionnaire orthographique propre au document, ce qui &eacute;vitera que le
correcteur s'arr&ecirc;te sur la prochaine occurrence de ce mot.
<LI>&laquo; Remplacer &raquo; : le mot consid&eacute;r&eacute; comme
erron&eacute; est remplac&eacute; par le mot de remplacement (que
l'utilisateur a pu changer ou modifier, voir plus haut) et le correcteur
cherche le mot erron&eacute; suivant.
<LI>&laquo; Remplacer (+dic) &raquo; : idem Remplacer, mais en plus le mot de
remplacement est ajout&eacute; au dictionnaire du document.
</UL>

<H2><A NAME="secta14">14</A> <A NAME="L498">Feuilles de style</A></H2>

<H2><A NAME="secta15">15</A> <A NAME="L522">Param&eacute;trisation de
l'&eacute;diteur</A></H2>

<H3><A NAME="sectb151">15.1</A> <A NAME="L3595">Langue de dialogue</A></H3>

<P>Tamaya peut traiter des documents &eacute;crits dans plusieurs langues
(voir section <A HREF="#sectb91">9.1</A>) ; ces langues sont
ind&eacute;pendantes de la langue utilis&eacute;e dans le dialogue entre
l'&eacute;diteur et l'utilisateur. La langue de dialogue est d&eacute;finie
par la variable d'environnement <EM>LANG</EM>. Cette variable peut prendre les
valeurs <EM>fr</EM> pour le Fran&ccedil;ais, <EM>en</EM> pour l'Anglais,
etc.</P>

<P>Dans la version courante de Tamaya, seules les langues fran&ccedil;aise et
anglaise sont d&eacute;finies, mais d'autres langues de dialogue peuvent
&ecirc;tre ajout&eacute;es. Il faut pour cela cr&eacute;er :</P>

<UL>
<LI>Des fichiers contenant les textes des messages, boutons, bo&icirc;tes de
dialogues, etc. Le r&eacute;pertoire <EM>$THOTDIR/bin</EM> de Tamaya contient
de tels fichiers pour le fran&ccedil;ais (tous les fichiers dont le nom
commence par <EM>fr-</EM>) et l'anglais (tous les fichiers dont le nom
commence par <EM>en-</EM>). Pour la nouvelle langue, il faut cr&eacute;er dans
le m&ecirc;me r&eacute;pertoire un nouvel ensemble de fichiers contenant les
m&ecirc;mes messages, traduits dans la nouvelle langue. Les noms de ces
fichiers doivent commencer par les lettres identifiant cette langue, suivies
d'un signe <EM>-</EM>. 
<LI>Des fichiers <EM>langue</EM> pour le sch&eacute;ma de structure HTML .
</UL>

<P>La variable d'environnement <EM>LANG</EM> n'est prise en compte qu'au
d&eacute;marrage de l'&eacute;diteur. Si on veut changer de langue de
dialogue, il faut donc arr&ecirc;ter l'&eacute;diteur (commande &laquo;
Quitter Tamaya &raquo; du menu &laquo; Fichiers &raquo;) et le relancer
apr&egrave;s avoir modifi&eacute; la variable <EM>LANG</EM>.</P>

<H2><A NAME="secta16">16</A> <A NAME="L3078">Limites fonctionnelles</A></H2>

<P>Cette section liste les valeurs des param&egrave;tres de
l'&eacute;diteur.</P>

<DL>
<DT>Nombre maximum de documents ouverts :</DT>

<DD>10
<DT>Nombre maximum de fen&ecirc;tres de documents ouvertes :</DT>

<DD>10
<DT>Nombre maximum de vues ouvertes par document (hors les vues des arbres
associ&eacute;s) :</DT>

<DD>
 6
<DT>Longueur maximum des noms de documents (hors suffixe .PIV) :</DT>

<DD>30
<DT>Nombre maximum d'entr&eacute;es d'un menu s&eacute;lecteur :</DT>

<DD>80
<DT>Longueur maximum de la cha&icirc;ne des entr&eacute;es d'un
s&eacute;lecteur :</DT>

<DD>80
<DT>Nombre maximum de propositions du correcteur orthographique :</DT>

<DD>10
</DL>

</BODY>
</HTML>
