<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
                      "http://www.w3.org/TR/REC-html40/loose.dtd">
<html>
<head>
  <title>Amaya - Bienvenue</title>
  <style type="text/css">.nul { color: #FF0000}</style>
  <meta name="GENERATOR" content="amaya V2.1a">
</head>

<body bgcolor="white" lang="fr">
<h1 style="font-size : 30pt; color : #FF0080">Amaya - Bienvenue</h1>

<h2 style="text-align : right; color : #BEBEBE">Version 2.1</h2>

<p><strong>Amaya</strong> est un client Web qui propose &agrave; la fois les
fonctions de navigation et d'&eacute;dition. Ce logiciel est un<span
class="nul" style="color: #000000"> d&eacute;monstrateur</span> des nouvelles
technologies Web dans un environnement WYSIWYG. La version courante
int&egrave;gre HTML, XHTML, MathML, CSS, et HTTP.</p>

<div>
<h3>Principales fonctions</h3>
<ul>
  <li>Avec Amaya, vous pouvez manipuler des pages Web contenant des
    formulaires, des tableaux et les caract&eacute;ristiques les plus
    avanc&eacute;es de la norme HTML. Vous pouvez cr&eacute;er et
    &eacute;diter des expressions math&eacute;matiques complexes. Vous pouvez
    styler vos documents en utilisant les CSS (Cascading Style Sheets). Vous
    pouvez &eacute;galement publier des documents HTML ou XHTML sur des
    serveurs locaux ou distants avec la m&eacute;thode Put d&eacute;finie par
    HTTP.</li>
  <li>Amaya int&egrave;gre des fonctions de navigation et d'&eacute;dition.
    Vous pouvez simultan&eacute;ment parcourir et &eacute;diter des pages Web.
    Pour simplifier l'&eacute;dition des documents, un simple clic dans Amaya
    d&eacute;place le point d'insertion pour permettre
    l'&eacute;dition&nbsp;;&nbsp;un double clic permet de suivre un lien. Ce
    comportement peut &ecirc;tre modifi&eacute; au m&ecirc;me titre que de
    nombreux autres param&egrave;tres en utilisant le menu
    Pr&eacute;f&eacute;rences.</li>
  <li>Amaya supporte l'&eacute;dition et la publication de feuilles de style
    CSS. Avec Amaya, il est facile de lier les feuilles de style aux documents
    ou de les retirer. Il est &eacute;galement possible de les activer ou
    d&eacute;sactiver et de voir imm&eacute;diatement les diff&eacute;rences
    de rendu sur le document.</li>
  <li>Amaya fournit un commande D&eacute;faire/Refaire multi-niveaux et
    multi-documents.</li>
</ul>
</div>

<div>
<h3>Manuel en ligne (en anglais)</h3>

<p>Un manuel utilisateur en ligne est disponible. Vous pouvez le parcourir
avec le menu Aide qui propose chaque section du manuel. Vous pouvez
&eacute;galement l'imprimer : suivez le lien <a
href="../doc/amaya/Manual.html">Manuel en ligne</a> ci dessous. Construisez
ensuite le manuel int&eacute;gral avec la commande "Construire un livre" du
menu Sp&eacute;cial et imprimez le r&eacute;sultat.</p>
</div>

<div>
<h3>Licence</h3>

<p>Permission d'utiliser, de copier, de modifier, et de distribuer ce logiciel
et sa documentation pour tout usage sans payer de droits &agrave; condition
que l'int&eacute;gralit&eacute; du texte <a
href="http://www.w3.org/Consortium/Legal/copyright-software.html">MIT and
INRIA Copyright Statement</a> apparaisse sur TOUTES les copies du logiciel et
de la documentation, incluant les modifications personnelles
apport&eacute;es.</p>
</div>
<hr>


<table border="0" width="100%" style="background-color : #95E4FF; color :
#00B2E5">
  <tbody>
    <tr>
      <td align="center" width="33%"><p style="font-size : 14pt"><a
        href="http://www.w3.org/">Serveur W3C</a></p>
      </td>
      <td align="center" width="33%"><p style="font-size : 14pt"><a
        href="http://www.w3.org/Amaya/">Site Amaya</a></p>
      </td>
      <td align="center" width="33%"><p style="font-size : 14pt"><a
        href="../doc/amaya/Manual.html">Manuel en ligne</a></p>
      </td>
    </tr>
  </tbody>
</table>
</body>
</html>
