<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
                      "http://www.w3.org/TR/REC-html40/loose.dtd">
<html>
<head>
  <title>MANUEL D'UTILISATION D'AMAYA</title>
  <style type="text/css">.relief { color: #E50073}
PRE > STRONG { color: #0000FF}</style>
  <meta name="GENERATOR" content="amaya V2.1a">
  <link href="/New.html">
</head>

<body style="background-color: #F4FFED" lang="fr">
<h1 style="text-align: center"><span style="font-size: 24pt"><img
src="images/Book5.gif" alt="book">
 <span style="font-size: 30pt">       <span style="font-size:
40pt">M</span></span></span><span style="font-size: 30pt">ANUEL D'</span><span
style="font-size: 30pt">U</span><span style="font-size: 30pt">TILISATION
D'</span><span style="font-size: 40pt">A</span><span style="font-size:
30pt">MAYA</span></h1>

<p></p>

<p></p>
<hr>


<p><strong>Version:</strong>  2.0 - Mai 1999</p>
<dl>
  <dt><strong>Auteurs:</strong></dt>
</dl>

<p>Luc Bonameau, St&eacute;phane Bonhomme</p>

<div>
<hr>


<p>Ce manuel a &eacute;t&eacute; r&eacute;alis&eacute; pour l'utilisation
d'Amaya sous Unix. Certaines fonctions pr&eacute;sent&eacute;es dans ce manuel
peuvent &ecirc;tre l&eacute;g&egrave;rement diff&eacute;rentes dans la version
Windows.</p>

<p>Les ressources suivantes (en anglais) compl&egrave;tent les informations
pr&eacute;sentes dans le Manuel d'utilisation.</p>

<p></p>

<p style="text-align: center">[ <a
href="http://www.w3.org/Amaya/User/FAQ.html">FAQ</a> | <a
href="http://www.w3.org/Amaya/User/">Pages de support en ligne ]</a></p>
</div>

<div>
<hr>

<hr>


<h2><img src="images/fleche.gif" alt="fleche">
 <span style="font-size: 40pt">S</span>OMMAIRE</h2>

<p></p>
<ul>
  <li>Qu'est ce qu'Amaya ?
    <ul>
      <li>&Eacute;diteur de documents HTML</li>
      <li>Qu'est ce que HTML ?</li>
      <li>Fonctions principales d'Amaya</li>
      <li>Limites d'Amaya</li>
    </ul>
  </li>
  <li><span style="font-size: 14pt">D</span>&eacute;marrer avec Amaya
    <ul>
      <li>G&eacute;n&eacute;ral
        <ul>
          <li>Langue du dialogue</li>
          <li>Mode navigation et mode &eacute;dition</li>
        </ul>
      </li>
    </ul>
    <ul>
      <li>Naviguer
        <ul>
          <li>Choisir un site</li>
          <li>Interrompre le transfert</li>
          <li>Aller &agrave; la page pr&eacute;c&eacute;dente / suivante</li>
          <li>Suivre un lien</li>
        </ul>
      </li>
      <li>&Eacute;diter
        <ul>
          <li>Cr&eacute;er un nouveau document</li>
          <li>Ouvrir un document</li>
          <li>&Eacute;diter un document</li>
          <li>Sauver un document</li>
          <li>Imprimer un document</li>
        </ul>
      </li>
      <li>S&eacute;lectionner
        <ul>
          <li>S&eacute;lection de texte</li>
          <li>S&eacute;lection de structures</li>
        </ul>
      </li>
    </ul>
  </li>
  <li>Ins&eacute;rer des &eacute;l&eacute;ments HTML
    <ul>
      <li>&Eacute;l&eacute;ments HTML simples</li>
      <li>Les liens</li>
      <li>Images et zones actives</li>
      <li>Les tableaux</li>
      <li>Math&eacute;matiques</li>
    </ul>
  </li>
  <li>Modifier des &eacute;l&eacute;ments HTML
    <ul>
      <li>&Eacute;diter les attributs d'un &eacute;l&eacute;ment</li>
      <li>Changer le type d'un &eacute;l&eacute;ment</li>
    </ul>
  </li>
</ul>
<ul>
  <li>Changer la structure d'un document HTML
    <ul>
      <li>Transformer la structure</li>
      <li>Ins&eacute;rer des divisions</li>
      <li>Unir des &eacute;l&eacute;ments</li>
    </ul>
  </li>
  <li>Changer la pr&eacute;sentation du document HTML
    <ul>
      <li>Num&eacute;roter les sections d'un document</li>
      <li>Changer les attributs style d'un &eacute;l&eacute;ment</li>
      <li>Utiliser les feuilles de style</li>
    </ul>
  </li>
  <li>Utiliser les outils d'&eacute;dition d'Amaya
    <ul>
      <li>Utiliser le v&eacute;rificateur d'orthographe</li>
      <li>Utiliser les commandes Copier / Couper / Coller</li>
      <li>Chercher et remplacer du texte</li>
      <li>Cr&eacute;er un livre</li>
    </ul>
  </li>
  <li>Les vues
    <ul>
      <li>Ouvrir ou Fermer une vue</li>
      <li>Utiliser une vue
        <ul>
          <li>Vue formatt&eacute;e</li>
          <li>Vue structure</li>
          <li>Vue altern&eacute;e</li>
          <li>Vue des liens</li>
          <li>Vue table des mati&egrave;res</li>
        </ul>
      </li>
    </ul>
  </li>
</ul>

<p></p>
</div>

<p></p>
<hr>

<hr>


<h2><img src="images/fleche.gif" alt="fleche">
 <span style="font-size: 40pt">Q</span>U'EST CE QU'AMAYA ?</h2>

<p></p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 &Eacute;diteur de documents HTML</h3>

<p></p>

<p>Amaya permet de cr&eacute;er de nouveaux documents HTML et d'&eacute;diter
des documents existants. Les documents cr&eacute;&eacute;s &agrave; l'aide
d'Amaya sont destin&eacute;s &agrave; &ecirc;tre diffus&eacute;s sur le World
Wide Web et &agrave; &ecirc;tre consult&eacute;s par les navigateurs les plus
courants.</p>

<p>Amaya int&egrave;gre des fonctions de navigation et de publication sur un
serveur Web. Gr&acirc;ce &agrave; ces fonctions, il n'est pas
n&eacute;cessaire de disposer d'un navigateur annexe pour visualiser les pages
cr&eacute;&eacute;es ni de poss&eacute;der un logiciel d&eacute;di&eacute;
pour le transfert des documents cr&eacute;&eacute;s.</p>

<p>Gr&acirc;ce &agrave; son interface WYSIWYG similaire &agrave; celle d'un
traitement de texte, Amaya ne n&eacute;cessite pas la connaissance du format
HTML pour cr&eacute;er des pages. Cependant, pour exploiter au mieux les
capacit&eacute;s de l'&eacute;diteur, il est souhaitable de conna&icirc;tre
quelques bases.</p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Qu'est ce que HTML ?</h3>

<p></p>

<p>Les fichiers hypertexte disponibles sur le Web sont d&eacute;crits &agrave;
l'aide d'un langage appel&eacute; HTML ou "Hypertext Markup Language". Il ne
s'agit pas d'un langage de programmation, mais d'un langage dit de
<em>description</em>.</p>

<p>L'information contenue dans un fichier HTML est de nature textuelle. Ces
fichiers sont donc lisibles par un humain (&agrave; la diff&eacute;rence des
fichiers produits par la plupart des traitements de texte). L'information
contenue dans le document est de trois natures :</p>
<ul>
  <li>les informations textuelles qui seront affich&eacute;es &agrave;
    l'&eacute;cran</li>
  <li>les <em><span style="color: #0000FF">balises</span></em> qui
    d&eacute;terminent le type de l'information (titre, lien, paragraphe, etc)
    qui est contenue entre une <em>balise de d&eacute;but</em> et une
    <em>balise de fin</em>. Chaque balise (de d&eacute;but et de fin)
    d&eacute;bute par le caract&egrave;re <em>&lt;</em> et se termine par le
    caract&egrave;re <em>></em>. Le type de l'information est
    caract&eacute;ris&eacute; par le nom de la balise (qui suit
    imm&eacute;diatement le caract&egrave;re '&lt;') et un ensemble
    d'attributs d&eacute;terminant un ensemble de caract&eacute;ristiques de
    l'information identifi&eacute;e par la balise. Ces caract&eacute;tistiques
    peuvent &ecirc;tre par exemple des informations de mise en forme (couleur,
    taille des carct&egrave;res, alignement), elle peuvent &eacute;galement
    identifier le document point&eacute; par un lien hypertexte, etc. Anisi,
    une table avec une bordure de 3 points sera d&eacute;limit&eacute;e par
    les balises &lt;table border="3"> (balise de d&eacute;but) et &lt;/table>
    (balise de fin)</li>
  <li>les <em><span style="color: #007F00">entit&eacute;s</span></em> sont
    utilis&eacute;es pour repr&eacute;senter les caract&egrave;res
    sp&eacute;ciaux et accentu&eacute;s. Les entit&eacute;s d&eacute;butent
    par le caract&egrave;re '&amp;' et se termainent par le caract&egrave;re
    ';'. Ansi le caract&egrave;re <em>&eacute;</em> sera cod&eacute;
    &amp;eacute (e accent aigu).</li>
</ul>

<p>Les balises et les attributs permettent &eacute;galement de lier des objets
(ou ressources) externes &agrave; la page proprement dite. C'est le cas par
exemple des liens hypertextes, mais aussi des images en ligne.</p>

<p>Lors de la consultation d'un document avec un navigateur, les balises,
leurs attributs sont interpr&eacute;t&eacute;es par le navigateur, les
ressources externes (images) sont charg&eacute;es et une image du document
format&eacute; est construite pour &ecirc;tre pr&eacute;sent&eacute;e &agrave;
l'utilisateur.</p>

<p></p>

<table border="1">
  <tbody>
    <tr>
      <td>Voici un exemple simple de fichier HTML :</td>
      <td>et le m&ecirc;me document format&eacute; par un navigateur :</td>
    </tr>
    <tr>
      <td><pre style="font-size: 10pt"><strong>&lt;html>
                </strong><strong> &lt;head></strong>
                <strong>  &lt;title></strong>Le lancer de rayons<strong>&lt;/title>
                  &lt;meta name="GENERATOR" content="amaya V2.0"></strong>
                <strong> &lt;/head></strong>
                <strong> &lt;body></strong>
                <strong>  &lt;h2></strong>Introduction au ray-tracing<strong>&lt;/h2></strong>
                <strong>  &lt;ul>
                   &lt;li>&lt;a href="foncray.html"></strong>
                    Fonctionnement du ray-tracing<strong>&lt;/a></strong><strong>
                   &lt;li>&lt;a href="accelere.html"></strong>
                    Comment acc<span style="color: #007F00">&amp;eacute;</span>l<span style="color: #007F00">&amp;eacute;</span>rer le traitement<strong>
                       &lt;/a>
                  &lt;/ul></strong>
                <strong>  &lt;p>
                   &lt;a href="../index.html">
                    &lt;img src="backpro.jpg" alt="ds" 
                         height="55" width="70"></strong>
                <strong>    </strong>Retour au sommaire du site
                   <strong>&lt;/a>
                  &lt;/p></strong>
                <strong> &lt;/body>
                &lt;/html></strong></pre>
      </td>
      <td><img src="images/ray-tr.gif" alt="ray tracing">
      </td>
    </tr>
  </tbody>
</table>

<p>Chaque balise d'un fichier html peut contenir d'autres balises ainsi que du
texte, mais une fin de balise ne peut &ecirc;tre pr&eacute;sente que si toutes
les balises contenues ont &eacute;t&eacute; ferm&eacute;es. Les balises
forment ainsi une hi&eacute;rarchie, ou structure que l'on peut visualiser
dans Amaya :</p>

<table border="1" width="219">
  <tbody>
    <tr>
      <td><img src="images/structureray.gif" alt="structure" width="284"
        height="248">
      </td>
    </tr>
  </tbody>
</table>

<p><em>Vue structure d'un document HTML</em></p>

<p>La structure d'un document HTML n'est pas laiss&eacute;e &agrave;
l'apr&eacute;ciation du concepteur du document. Anfin que les
diff&eacute;rents navigateurs puisent interpr&eacute;ter de mani&egrave;re
(&agrave; peu pr&egrave;s) similaire les balises, des r&egrave;gles dictent
les possibilit&eacute;s d'occurence des balises dans un document, ces
r&egrave;gles portent sur :</p>
<ul>
  <li>Le nom des balises utilis&eacute;es dans un document : HTML
    d&eacute;finit un ensemble fixe de balises.</li>
  <li>La position des balises dans la structure du document : Les lignes de
    tableau ne peuvent intervenir que dans des tableaux, les cellules ne
    peuvent intervenir que dans des ligne, les items de liste doivent
    &ecirc;tre imm&eacute;diatement &agrave; l'int&eacute;rieur d'une liste,
    etc.</li>
</ul>

<p>Amaya permet d'&eacute;diter de mani&egrave;re interactive un document HTML
sans avoir &agrave; se soucier de ces r&egrave;gles de composition des
documents : en effet, l'outil ne permet que de cr&eacute;er les balises
permises aux emplacement ad&eacute;quat, le cas &eacute;ch&eacute;ant, Amaya
recompose localement la structure du document pour respecter les
r&egrave;gles.</p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Fonctions principales d'Amaya</h3>
<ul>
  <li><strong>Repr&eacute;sentation structur&eacute;e des documents</strong>
    <p>Amaya exploite la structure hi&eacute;rarchique des documents html pour
    en proposer une repr&eacute;sentation arborescente. Elle permet
    d'am&eacute;liorer la qualit&eacute; et la facilit&eacute;
    d'&eacute;dition des pages web.</p>
  </li>
  <li><strong>Navigation et &eacute;dition WYSIWYG</strong>
    <p>Amaya permet &agrave; la fois de naviguer et d'&eacute;diter. Cette
    double fonction facilite par exemple la mise &agrave; jour de pages web
    sur des serveurs distants. Cette fonction permet &eacute;galement de
    composer des pages en utilisant de l'information collect&eacute;e sur le
    web.</p>
  </li>
  <li><strong>Feuilles de style et mod&egrave;les de pages</strong>
    <p>Amaya int&egrave;gre l'utilisation des mod&egrave;les de page et
    supporte les feuilles de styles ou CSS.</p>
    <p>Les CSS sont tr&egrave;s utiles pour donner une apparence commune
    &agrave; un ensemble de pages, elles permettent de modifier cette
    apparence sur un grand nombre de pages en une seule commande.</p>
  </li>
  <li><strong>Multivues</strong>
    <p>Amaya propose plusieurs vues synchronis&eacute;es du document.
    L'utilisateur dispose ainsi de plusieurs point de vue du m&ecirc;me
    document (vue format&eacute;e, structure, liens, table des
    mati&egrave;res, etc. ).</p>
  </li>
  <li><strong>Fonctions de publication directe sur le WEB</strong>
    <p>Amaya int&egrave;gre les fonctions de publication directe sur un
    serveur web. La sauvegarde des documents HTML sur un serveur distant est
    transparente et ne n&eacute;cessite pas l'utilisation d'un logiciel
    sp&eacute;cifique.</p>
  </li>
  <li><strong>Gestion des liens hypertexte</strong>
    <p>La cr&eacute;ation de liens hypertexte dans Amaya se fait en deux clics
    de souris. Lors de la publication d'un document, les liens sont mis
    &agrave; jour automatiquement.</p>
  </li>
  <li><strong>&Eacute;dition de formules math&eacute;matiques</strong>
    <p>Amaya permet d'&eacute;diter interactivement des formules
    math&eacute;matiques.</p>
  </li>
</ul>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Limites d'Amaya</h3>

<p>Les fonctionalit&eacute;s primordiales d'Amaya concernent l'&eacute;dition
de documents, c'est pourquoi les fonctionalit&eacute;s de navigation sont
limit&eacute;es. En particulier, Amaya ne permet pas</p>
<ul>
  <li>d'afficher les animations.
    <p>Certaines pages incluent des images anim&eacute;es au format gif. Lors
    de l'ouverture d'une telle page, Amaya affiche la premi&egrave;re image de
    l'animation.</p>
    <p></p>
  </li>
  <li>d'afficher les frames (cadres) en ligne.
    <p>Certains sites web divisent la fen&ecirc;tre du navigateur en
    diff&eacute;rentes zones, par exemple pour afficher le sommaire du site.
    Lors de la navigation sur ces sites, Amaya n'affiche pas les
    diff&eacute;rents cadres &agrave; l'&eacute;cran, mais une liste de liens
    sur chacun de ces cadres.</p>
  </li>
</ul>

<p></p>
<hr>


<h2><img src="images/fleche.gif" alt="fleche">
 <span style="font-size: 40pt">D</span>EMARRER AVEC AMAYA</h2>

<p></p>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 G&eacute;n&eacute;ral</h3>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Langue du dialogue</h3>

<p>Lors de sa premi&egrave;re utilisation, Amaya est configur&eacute; avec des
dialogues en anglais. Il est possible de configurer l'&eacute;diteur pour
utiliser le fran&ccedil;ais comme langue de dialogue.</p>

<p><strong>Pour  </strong><strong>mettre les dialogues en
Fran&ccedil;ais</strong>&nbsp;:</p>
<ol>
  <li>Choisissez l'entr&eacute;e <strong>Preference</strong> du menu
    <strong>Special</strong> et s&eacute;lectionnez <strong>General
    Preferences</strong>.
    <p>La bo&icirc;te de dialogue <strong>General Preferences</strong>
    s'ouvre.</p>
  </li>
  <li>Rep&eacute;rez le champ <strong>Dialogue language</strong>. Sa valeur
    par d&eacute;faut est <em>en_US</em> (anglais am&eacute;ricain)</li>
  <li>S&eacute;lectionnez <em>fr</em> (fran&ccedil;ais).</li>
  <li>Validez en cliquant sur <strong>Appliquer</strong> puis
    <strong>Terminer</strong>.</li>
  <li>Red&eacute;marrez Amaya pour que les changements prennent effet.</li>
</ol>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Mode navigation et mode &eacute;dition</h3>

<p>Amaya propose deux mode d'utilisation :</p>
<ul>
  <li>Le mode navigation : seules les fonctions de navigation sont
    disponibles, il n'est possible de modifier les documents
  consult&eacute;s.</li>
  <li>Le mode &eacute;dition/navigation : l'ensemble des fonctions de
    l'&eacute;diteur sont disponibles.</li>
</ul>

<p style="text-align: left">Le bouton <img src="images/switch.gif"
alt="switch" align="middle" style="width: 0pt; height: 0pt"> vous permet de
passer d'un mode &agrave; l'autre.</p>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 Naviguer ( <img src="images/navig.gif" alt="navig" align="middle">
 )</h3>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Consulter une page</h4>

<p>Amaya permet de consulter des pages HTML disponibles sur des serveurs
distants, ces pages sont identifi&eacute;es pas une adresse URL (Uniform
Resource Locator), par exemple http://www.w3.org/Amaya/index.html. L'URL
contient le protocole de communication utilis&eacute; pour acceder &agrave;
une ressource (sur le web : http) le nom du serveur (www.w3.org) et la
localisation de la ressource sur le serveur (/Amaya/index.html). Avec Amaya,
il est possible d'acceder aux pages de deux fa&ccedil;ons&nbsp;:</p>
<ul>
  <li>En saisissant une URL dans le champs adresse et en validant pas la
    touche <strong>Entr&eacute;e</strong></li>
  <li>En suivant un lien dans une page existante. Les liens sont, par
    d&eacute;faut, de couleur bleue. Pour suivre un lien il suffit de double
    cliquer sur le texte en bleu (le simple clic traditionnel &eacute;tant
    r&eacute;serv&eacute; au placement du point d'insertion).</li>
</ul>

<p>Si l'URL saisie ou le lien est incorrect, le message suivant <em>"ERREUR:
L'URL recherch&eacute;e n'est pas accessible</em>. <em>Le site ou le serveur
distant pourrait &ecirc;tre en panne ou n'existe pas.Essayer plus tard."
</em>est affich&eacute; dans la fen&ecirc;tre du document.</p>

<p>Il est possible de configurer Amaya pour permettre le suive de liens
hypertextes par un simple clic. Le comportement d'Amaya est alors similaire
&agrave; celui des navigateurs les plus courants :</p>
<ol>
  <li>Choisissez l'entr&eacute;e <strong>Pr&eacute;f&eacute;rences</strong> du
    menu <strong>Sp&eacute;cial</strong> puis cliquez sur <strong>
    G&eacute;n&eacute;rale.</strong></li>
  <li>La bo&icirc;te de dialogue <strong>Configuration
    g&eacute;n&eacute;rale</strong> s'ouvre.</li>
  <li>Utilisez le bouton <strong>Cliquez deux fois pour suivre un
    lien</strong> pour modifier le comportement du logiciel.
    <p>Vous pouvez modifier le <strong>d&eacute;lai du double clic</strong>
    dans cette m&ecirc;me bo&icirc;te de dialogue. Entrez un nombre dans le
    champ <strong>D&eacute;lai du double clic</strong>.</p>
  </li>
  <li>Cliquez sur <strong>Appliquer</strong> puis <strong>Terminer
    </strong>pour revenir &agrave; la fen&ecirc;tre de travail.</li>
</ol>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Interrompre le transfert</h4>

<p>Il est possible d'interrompre le transfert d'une page en cours de
chargement en cliquant le bouton  <img src="images/stop.gif" alt="stop"
border="1" align="middle"> de la barre d'outils.</p>

<p></p>

<h4 style="width: -3px"><img src="images/b-point.gif" alt="point">
 Aller &agrave; la page pr&eacute;c&eacute;dente / suivante</h4>

<p>Il est possible de retourner &agrave; la page pr&eacute;c&eacute;demment
consult&eacute;e, ou de revenir aux pages plus r&eacute;centes &agrave; la
suite d'un retour &agrave; la page pr&eacute;cedente en cliquant les boutons
<img src="images/naviga.gif" alt="naviga" align="middle"> ou avec les
commandes <strong>Pr&eacute;c&eacute;dent / Suivant</strong> du menu
<strong>Fichier</strong>.</p>

<p></p>

<p></p>
<hr>


<h3><img src="images/Pointr.gif" alt="o">
 &Eacute;diter ( <img src="images/switch.gif" alt="switch" align="middle">
 )</h3>

<p></p>

<p>La fonction premi&egrave;re d'Amaya est la cr&eacute;ation de documents
HTML. Gr&acirc;ce &agrave; ses fonctions de navigation, Amaya permet
&eacute;galement d'&eacute;diter des documents existants sur le web. Dans
cette partie, nous montrerons &eacute;galement comment utiliser des
mod&egrave;les de page pr&eacute;d&eacute;finis pour cr&eacute;er de nouveaux
documents HTML.</p>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Cr&eacute;er un nouveau document</h4>

<p>Avec Amaya il est possible de cr&eacute;er un document vierge ou d'utiliser
un mod&egrave;le pr&eacute;d&eacute;fini.</p>

<p></p>

<p><strong>Cr&eacute;er un document vide</strong></p>
<ol>
  <li>Choisissez <strong>Nouveau</strong> dans le menu
    <strong>Fichier.</strong></li>
  <li>S&eacute;lectionnez <strong>Nouveau document HTML</strong> dans le
    sous-menu d&eacute;roulant.</li>
  <li>Utilisez la bo&icirc;te de dialogue <strong>Nouveau document
    HTML</strong> pour sp&eacute;cifier l'adresse du nouveau document.</li>
</ol>

<p></p>

<p><strong>Cr&eacute;er un document &agrave; partir d'un mod&egrave;le de
page</strong></p>
<ol>
  <li>choisissez <strong>Nouveau</strong> dans le menu
    <strong>Fichier</strong>.</li>
  <li style="width: -3px">S&eacute;lectionnez <strong>Mod&egrave;le</strong>
    dans le sous-menu d&eacute;roulant. Un formulaire semblable au suivant
    s'affiche :
    <p></p>
    <p style="width: -32px"><img src="images/modele.gif" alt="formulaire"
    border="1" width="219" height="145"></p>
    <p></p>
    <p>Ce formulaire permet de choisir un mod&egrave;le de page parmi ceux
    disponibles sur le serveur de mod&egrave;les (CV, Calendrier, page WEB
    personnelle dans l'exemple ci-dessus) et une feuille de style &agrave;
    appliquer au mod&egrave;le.</p>
    <p>La figure suivante pr&eacute;sente le m&ecirc;me mod&egrave;le
    pr&eacute;sent&eacute; avec deux feuilles de style diff&eacute;rentes:</p>

    <table border="1">
      <caption></caption>
      <tbody>
        <tr>
          <td><strong>Feuille de style "Bleu"</strong></td>
          <td><strong>Feuille de style "Noir"</strong></td>
        </tr>
        <tr>
          <td><img src="images/bluecv.gif" alt="style Schtroumpf"
            width="224" height="147">
          </td>
          <td><img src="images/cvdracula.gif" alt="modele dracula" width="219"
            height="149">
          </td>
        </tr>
      </tbody>
    </table>
    <p></p>
  </li>
  <li>S&eacute;lectionnez un mod&egrave;le (cochez un des radio box).</li>
  <li>Choisissez &eacute;ventuellement une feuille de style.</li>
  <li>Entrez le nom ou l'URL du document que vous voulez cr&eacute;er &agrave;
    partir du mod&egrave;le.
    <ul>
      <li>Si une URL compl&egrave;te est entr&eacute;e, le nouveau document
        sera enregistr&eacute; &agrave; cette URL.</li>
      <li>Si un simple de nom de fichier HTML est entr&eacute; (nomdoc.html),
        le document sera enregistr&eacute; dans votre r&eacute;pertoire de
        publication (si vous en poss&eacute;dez un).</li>
    </ul>
  </li>
  <li>Validez par OK.
    <p></p>
  </li>
</ol>

<p>Vous obtenez alors le mod&egrave;le choisi avec feuille de style
&eacute;ventuellement s&eacute;lectionn&eacute;e (apr&egrave;s
authentification dans le cas de l'utilisation de la publication directe).</p>

<p>Pour enregistrer votre document, il suffira donc de cliquer sur <img
src="images/save.gif" alt="save" align="middle"> ou d'utiliser l'entr&eacute;e
<strong>Sauver</strong> du menu <strong>Fichier</strong>.</p>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Ouvrir un document</h4>

<p>Les deux commandes suivantes permettent d'ouvrir un document :</p>
<ul>
  <li><strong>Ouvrir un document dans la fen&ecirc;tre courante</strong>.
    <ol>
      <li>Dans le menu <strong>fichier</strong>, choisissez
        <strong>Ouvrir</strong>. Cette op&eacute;ration remplacera le contenu
        actuel de la fen&ecirc;tre par le document ouvert. Si vous n'avez pas
        enregistr&eacute; ce contenu, une confirmation vous sera
        demand&eacute;e avant de l'effacer.</li>
      <li>Une bo&icirc;te de dialogue <strong>Ouvrir le document</strong>
        s'affiche. Elle int&egrave;gre un navigateur de fichiers pour vous
        aider &agrave; localiser le fichier &agrave; ouvrir..
        <p>Entrez dans le champ <strong>Ouvrir le document </strong>l'URL du
        document distant ou utilisez le navigateur de fichier pour localiser
        le fichier local &agrave; ouvrir (Cf Utiliser le navigateur de
        fichiers)</p>
      </li>
      <li>Validez en cliquant sur le bouton <strong>Confirmer</strong>.
        <p></p>
      </li>
    </ol>
  </li>
  <li><strong>Ouvrir un document dans une nouvelle fen&ecirc;tre</strong>.
    <ol>
      <li>Choisissez <strong>Ouvrir dans une nouvelle
      fen&ecirc;tre</strong>.</li>
      <li>Le document est alors ouvert dans une nouvelle fen&ecirc;tre.</li>
    </ol>
  </li>
</ul>

<p>Le document doit alors appara&icirc;tre. Dans le cas contraire un message
d'erreur s'affiche dans la partie inf&eacute;rieure de la fen&ecirc;tre Amaya.
V&eacute;rifiez la validit&eacute; du chemin entr&eacute; et l'existence du
fichier &agrave; ouvrir.</p>

<p>Lorsqu'un lien contenu dans un document modifi&eacute; est affich&eacute;,
le document point&eacute; par ce lien s'ouvre dans une nouvelle fen&ecirc;tre,
ceci pour ne pas perdre les modifications sur le document contenant le
lien.</p>

<p></p>

<p><strong>Utiliser le navigateur de fichiers</strong></p>

<p>Le navigateur de fichiers se pr&eacute;sente comme le montre l'image
suivante :</p>

<p></p>
<img src="images/filebrowser.gif" alt="Navigateur de fichiers" width="235"
height="194">


<p></p>

<p>Remplissez le champ <strong>Filtrer</strong>. Ce champ permet d'obtenir une
recherche plus pertinente en n'affichant que les fichiers dont les noms
correspondent au filtre choisi. Pour mette &agrave; jour les r&eacute;sultats
de la recherche, cliquez sur le bouton <strong>Filtrer</strong>.</p>

<p>Dans l'exemple ci-dessus, nous avons filtr&eacute; les fichiers
<em>.*htm*</em>.</p>

<p>Nous obtiendront donc dans le champ <strong>Fichiers</strong> (champ dans
lequel les r&eacute;sultats de la recherche sont affich&eacute;s) les fichiers
d'extension <em>.shtml</em>, <em>.htm</em> ou <em>.htmx</em>. Le
r&eacute;pertoire manuel dans lequel nous nous trouvons ne contient comme
fichiers correspondant &agrave; la description que les fichiers New.html et
manuel.html.</p>

<p>Le champ <strong>R&eacute;pertoires documents</strong> permet de naviguer
dans l'arborescence du disque local.</p>

<p></p>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 &Eacute;diter un document</h4>

<p>Une fois un document ouvert ou cr&eacute;&eacute;, vous pouvez saisir du
texte, ins&eacute;rer une image ou un &eacute;l&eacute;ment HTML &agrave;
l'emplacement d&eacute;fini par le curseur d'insertion <img
src="images/curseur.gif" alt="curseur">.</p>

<p>Pour d&eacute;placer le curseur, utilisez les touches
fl&eacute;ch&eacute;es ou la souris.</p>

<p>Fa&icirc;tes d&eacute;filer le document en utilisant les barres de
d&eacute;filement en bas et &agrave; droite de la fen&ecirc;tre ou en
utilisant les touches <strong>Page Up</strong> et <strong>Page
Down.</strong></p>

<p>Le moyen le plus simple pour cr&eacute;er de nouveau &eacute;l&eacute;ments
dans un document est de placer le curseur d'insertion &agrave; l'emplacement
d&eacute;sir&eacute; et de choisir la commande correspondant &agrave;
l'&eacute;l&eacute;ment.</p>

<p>Consultez le chapitre sur les &eacute;l&eacute;ments HTML.</p>

<p>Parfois l'&eacute;l&eacute;ment d&eacute;sir&eacute; ne peut &ecirc;tre
ins&eacute;r&eacute; exactement &agrave; la position d&eacute;sir&eacute;e,
&agrave; cause des contraintes impos&eacute;es par HTML. Amaya essaie alors de
cr&eacute;er l'&eacute;l&eacute;ment &agrave; la position la plus proche
possible du curseur d'insertion. Par exemple, si le curseur d'insertion est
&agrave; la fin de la derni&egrave;re ligne d'un paragraphe, lorsque vous
cliquez sur le bouton <img src="images/H2.gif" alt="H2" align="middle"> Amaya
ne cr&eacute;e pas la nouvelle ent&ecirc;te &agrave; cette position (qui
serait invalide), mais apr&egrave;s le paragraphe.</p>

<p></p>

<p>Pour changer le titre du document,</p>
<ol>
  <li>Placez le curseur d'insertion dans le <strong>champ titre</strong> de la
    fen&ecirc;tre principale.</li>
  <li>Tapez le titre du document</li>
  <li>Validez par une pression sur la touche
  <strong>Entr&eacute;e</strong></li>
</ol>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Sauver un document HTML</h4>

<p>Pour sauver un fichier, vous pouvez utiliser</p>
<ul>
  <li style="text-align: left">l'ic&ocirc;ne <img src="images/save.gif"
    alt="save" align="middle">
     ou sur l'entr&eacute;e <strong>sauver</strong> du menu <strong>fichier
    </strong>pour sauver le document avec les param&egrave;tres par
    d&eacute;faut &agrave; l'adresse affich&eacute;e dans le <strong>champ
    adresse </strong>de la fen&ecirc;tre principale.</li>
  <li>la commande<strong> sauver comme ...</strong> du menu
    <strong>fichier</strong> .
    <p>On l'utilise pour pr&eacute;ciser les param&egrave;tres
    d'enregistrement du document HTML.</p>
    <ul>
      <li>R&eacute;pertoire d'enregistrement des images du document HTML</li>
      <li>Adresse locale ou URL du document HTML</li>
    </ul>
    <p>Pour utiliser la commande <strong>sauver comme</strong></p>
    <ol>
      <li style="width: -37px">S&eacute;lectionnez l'entr&eacute;e <strong>
        sauver comme ... </strong>du menu <strong>fichier </strong>. La
        bo&icirc;te de dialogue<strong> Sauvegarder sous
        </strong>appara&icirc;t
        <p style="width: -10px"></p>
        <p><img src="images/sauversous.gif" alt="Sauvegarder sous" width="205"
        height="204"></p>
        <p></p>
      </li>
      <li>Remplissez le champ <strong><em>Adresse du document</em></strong>.
        <p>Vous pouvez y ins&eacute;rer une URL ou une adresse locale.</p>
        <p>Aidez vous du navigateur de fichiers.</p>
      </li>
      <li>Si votre document contient au moins une image, compl&eacute;tez le
        champ <strong>R&eacute;pertoire des images</strong>. Ce champ doit
        contenir le r&eacute;pertoire dans lequel seront enregistr&eacute;s
        les fichiers images.
        <p>L'adresse de ce r&eacute;pertoire est relative.</p>
        <p>Dans l'exemple de l'image ci-dessus, les images du document
        index.html seront enregistr&eacute;es dans le r&eacute;pertoire
        http://www.ac-grenoble.fr/stpierre/journal_de_classe/images/</p>
      </li>
      <li>V&eacute;rifiez que la case <strong>Copier images</strong> est bien
        coch&eacute;e si votre document HTML contient des images que vous
        d&eacute;sirez sauver</li>
      <li>Cliquez sur <strong>Confirmer</strong>.</li>
    </ol>
  </li>
</ul>

<p>Remarque : Dans le cas o&ugrave; une session a &eacute;chou&eacute; avant
que vous ayez pu sauver vos modification, Amaya sauvegarde les documents
courants. Il vous sera propos&eacute; de les charger au prochain
d&eacute;marrage d'Amaya.</p>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Imprimer un document</h4>

<p></p>

<p>Cliquez sur <img src="images/print.gif" alt="print" align="middle"> ou sur
l'entr&eacute;e <strong>Imprimer</strong> du menu
<strong>fichier</strong>.</p>

<p>Les param&egrave;tres d'impression peuvent &ecirc;tre modifi&eacute;s avec
l'entr&eacute;e <strong>Param&eacute;trer et imprimer</strong> du menu
<strong>Fichier</strong>. (Cf Param&egrave;tres d'impression)</p>

<p>Ces param&egrave;tres permettent d'imprimer la table des mati&egrave;res,
la table des liens ou l'URL du document, de cr&eacute;er un fichier
PostScript, de sp&eacute;cifier une alimentation manuelle.</p>

<p></p>
<hr>


<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 S&eacute;lectionner</h3>

<p></p>

<p>La s&eacute;lection d&eacute;finit la port&eacute;e d'une commande
d'&eacute;dition.</p>

<p>Amaya repr&eacute;sente le document en interne de fa&ccedil;on
structur&eacute;e.</p>

<p>Le mode de s&eacute;lection qu'elle propose est plus puissant que celui des
&eacute;diteurs classiques.</p>

<p>Cette s&eacute;lection peut se faire aussi bien sur du texte que sur des
&eacute;l&eacute;ments HTML (tableaux, listes, images)</p>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 S&eacute;lection de texte</h4>

<p>La s&eacute;lection courante appara&icirc;t par d&eacute;faut en bleu
fonc&eacute; sur fond orange.</p>

<p>Diff&eacute;rents moyens de s&eacute;lectionner du texte sont
disponibles.</p>

<p></p>
<ul>
  <li><strong>S&eacute;lectionner avec la souris</strong>
    <p>Cliquez sur le bouton gauche pour d&eacute;placer le point
    d'insertion.</p>
    <p>Pour s&eacute;lectionner du texte, d&eacute;placez la souris tout en
    maintenant le bouton gauche enfonc&eacute; et rel&acirc;chez-le lorsque le
    texte d&eacute;sir&eacute; est s&eacute;lectionn&eacute;</p>
  </li>
  <li><strong>S&eacute;lectionner avec les touches
    fl&eacute;ch&eacute;es</strong>
    <p>Les quatre touches de direction du clavier d&eacute;placent le point
    d'insertion dans les quatre directions.</p>
    <p>En combinant ces touches avec la touche <strong>Shift</strong>, vous
    pouvez &eacute;tendre la s&eacute;lection &agrave; partir du point
    d'insertion.</p>
  </li>
  <li><strong>Etendre la s&eacute;lection</strong>
    <p>Cliquez sur le bouton gauche pour d&eacute;placer le point d'insertion
    sur le d&eacute;but de la zone &agrave; s&eacute;lectionner.</p>
    <p>Cliquez sur le bouton gauche combin&eacute; avec la touche
    <strong>Shift</strong> sur le dernier caract&egrave;re de la zone &agrave;
    s&eacute;lectionner.</p>
    <p></p>
  </li>
</ul>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 S&eacute;lection de structures</h4>

<p></p>

<p>On entend par structure tout &eacute;l&eacute;ment HTML autre que du texte
simple.</p>

<p>Quelques structures : paragraphes, tableaux, listes ...</p>

<p>Lors de la s&eacute;lection d'une structure, il faut toujours avoir sous
les yeux la barre de s&eacute;lection en bas &agrave; droite : <img
src="images/barreselect.gif" alt="barre" align="middle"></p>
<ul>
  <li><strong>S&eacute;lectionner avec la touche Esc</strong>
    <p></p>
    <p>Ce raccourci peut &ecirc;tre utilis&eacute; lorsqu'un
    &eacute;l&eacute;ment est s&eacute;lectionn&eacute; ou lorsque le curseur
    est plac&eacute; quelque part dans le document.</p>
    <p>Une pression sur la touche Esc s&eacute;lectionne
    l'&eacute;l&eacute;ment "parent" dans la structure du document. Appuyer
    plusieurs fois sur la touche Esc permet de  s&eacute;lectionner des
    structures jusqu'&agrave; la racine du document.</p>
    <p>Le type du premier &eacute;l&eacute;ment s&eacute;lectionn&eacute; est
    affich&eacute; en bas de la fen&ecirc;tre, suivi par les types des
    &eacute;l&eacute;ments englob&eacute;s par la structure
    s&eacute;par&eacute;s par le caract&egrave;re \.</p>
    <p>Cette fonctionnalit&eacute; s'av&egrave;re tr&egrave;s utile lorsque la
    structure du document est complexe.</p>
    <p></p>
    <p>Voici un exemple d'utilisation de cette fonction :</p>
  </li>
</ul>

<table border="0">
  <caption></caption>
  <tbody>
    <tr>
      <td><img src="images/select1.gif" alt="select" width="163" height="159">
      </td>
      <td><img src="images/select2.gif" alt="select" width="154" height="158">
      </td>
      <td><img src="images/select3.gif" alt="select" width="150" height="157">
      </td>
    </tr>
    <tr>
      <td><em>S&eacute;lection de l'image</em>

        <p>(IMG \ P \ BODY \ HTML)</p>
      </td>
      <td><em>Premi&egrave;re pression sur <strong>Esc</strong></em>

        <p><em>Le paragraphe est s&eacute;lectionn&eacute;</em></p>

        <p><em>(P \ BODY \ HTML )</em></p>
      </td>
      <td><em>Deuxi&egrave;me pression sur<strong> Esc</strong></em>

        <p><em>Le corps tout entier de la page est</em></p>

        <p><em>s&eacute;lectionn&eacute; ( BODY \ HTML)</em></p>
      </td>
    </tr>
  </tbody>
</table>

<p></p>
<ul>
  <li><strong>S&eacute;lectionner avec la souris</strong>
    <p></p>
    <ul>
      <li>Pour s&eacute;lectionner une image
        <ol>
          <li>cliquez sur l'image</li>
          <li>d&eacute;placez la souris &agrave; l'int&eacute;rieur de l'image
            en maintenant le bouton gauche appuy&eacute;.
            <p>Ne sortez pas de l'image avant d'avoir rel&acirc;ch&eacute; le
            bouton.</p>
          </li>
        </ol>
      </li>
      <li>Pour s&eacute;lectionner une liste, cliquez sur le point ou le
        num&eacute;ro de la liste.</li>
      <li>Pour s&eacute;lectionner une tableau, cliquez sur l'un des traits
        ext&eacute;rieurs du tableau. Faites de m&ecirc;me pour une cellule.
        <p></p>
      </li>
    </ul>
  </li>
  <li><strong>S&eacute;lectionner avec la vue structure</strong>
    <p></p>
    <p>Utiliser la vue structure pour s&eacute;lectionner un
    &eacute;l&eacute;ment est un moyen s&ucirc;r, efficace et pratique.</p>
    <p>Ouvrer cette vue en choisissant l'entr&eacute;e <strong>Vue
    structure</strong> du menu <strong>Vues</strong>.</p>
    <p>Voici un exemple de s&eacute;lection:</p>
    <p></p>
    <p><img src="images/structure.gif" alt="selection structure " width="341"
    height="214"></p>
    <p></p>
    <p>L'image a &eacute;t&eacute; s&eacute;lectionn&eacute;e dans la
    fen&ecirc;tre affichant le structure du document (&agrave; droite)</p>
    <p>Cette s&eacute;lection est imm&eacute;diatement
    r&eacute;percut&eacute;e sur la vue formatt&eacute;e (carr&eacute;s sur
    les bords de l'image)</p>
    <p>La barre de s&eacute;lection nous indique que l'&eacute;l&eacute;ment
    s&eacute;lectionn&eacute; est une image : IMG \ P \ BODY \ HTML</p>
    <p></p>
  </li>
</ul>

<p></p>
<hr>

<hr>


<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 I</span>NS&Eacute;RER DES &Eacute;L&Eacute;MENTS HTML</h2>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 &Eacute;l&eacute;ments HTML simples</h3>

<p></p>

<h4><img src="images/b-point.gif" alt="point">
 Les listes</h4>

<p></p>

<p>La norme HTML propose 3 sortes de listes</p>
<ul>
  <li>Les listes &agrave; puces            <img src="images/liste1.gif"
    alt="liste simple" align="middle">
  </li>
  <li>Les listes num&eacute;rot&eacute;es        <img src="images/liste2.gif"
    alt="liste" align="middle">
  </li>
  <li>Les listes de d&eacute;finition         <img src="images/liste3.gif"
    alt="liste de definition" align="middle">

    <p></p>
  </li>
</ul>

<p><strong>Cr&eacute;er une liste</strong></p>
<ul>
  <li>Pour cr&eacute;er une liste
    <ol>
      <li>Cliquez sur un des ic&ocirc;nes pr&eacute;sent&eacute;s ci-dessus ou
        choisissez l'entr&eacute;e  <strong>Listes</strong> du menu
        <strong>El&eacute;ments</strong>.</li>
      <li>Saisissez le premier &eacute;l&eacute;ment de la liste</li>
      <li>Appuyez sur <strong>Entr&eacute;e</strong> entre chaque
        &eacute;l&eacute;ment entr&eacute;.</li>
      <li>Pour finir, appuyer deux fois sur <strong>Entr&eacute;e</strong>.
        <p></p>
      </li>
    </ol>
  </li>
</ul>

<p><strong>Transformer du texte en liste</strong></p>

<p>Pour transformer du texte en liste</p>
<ol>
  <li>S&eacute;lectionnez le texte</li>
  <li>Choisissez l'entr&eacute;e <strong>Listes </strong>du menu
    <strong>&Eacute;l&eacute;ments</strong>. Chaque ligne du texte
    s&eacute;lectionn&eacute; deviendra un &eacute;l&eacute;ment de la liste
    ainsi cr&eacute;e.</li>
</ol>

<p></p>

<p><strong>Transformer un tableau en liste</strong></p>
<ol>
  <li>S&eacute;lectionnez le tableau ( appuyez sur <strong>Esc
    </strong>jusqu'&agrave; ce que l'outil de s&eacute;lection indique
    <strong>Table\...</strong>)</li>
  <li>Choisissez la commande <strong>Transformer</strong> du menu
    <strong>Edition</strong>. Choisissez l'entr&eacute;e
    <strong>liste</strong>.</li>
</ol>

<p>Exemple :</p>

<table border="1" width="49%" style="background-color: #EDF8FF">
  <caption></caption>
  <tbody>
    <tr>
      <td><strong>Tableau mat&eacute;riel</strong></td>
      <td><strong>Liste num&eacute;rot&eacute;e obtenue par
        transformation</strong></td>
    </tr>
    <tr>
      <td>
        <table border="1" width="200">
          <caption></caption>
          <tbody>
            <tr>
              <td>Carte vid&eacute;o</td>
              <td>Cirrus Logic</td>
              <td>Diamond</td>
              <td>ATI</td>
            </tr>
            <tr>
              <td>Souris</td>
              <td>Logitech</td>
              <td>Microsoft

                <p></p>
              </td>
              <td>Mouse Systems</td>
            </tr>
            <tr>
              <td>CD ROM</td>
              <td>IDE 24x</td>
              <td>SCSI 32x</td>
              <td></td>
            </tr>
            <tr>
              <td>Disque dur</td>
              <td>IDE</td>
              <td>EIDE</td>
              <td>SCSI</td>
            </tr>
          </tbody>
        </table>
      </td>
      <td><ol>
          <li>Carte video
            <ul>
              <li>Cirrus Logic</li>
              <li>Diamond</li>
              <li>ATI</li>
            </ul>
          </li>
          <li>Souris
            <ul>
              <li>Logitech</li>
              <li>Microsoft</li>
              <li>Mouse Systems</li>
            </ul>
          </li>
          <li>CD ROM
            <ul>
              <li>IDE 24x</li>
              <li>SCSI 32x</li>
            </ul>
          </li>
          <li>Disque dur
            <ul>
              <li>IDE</li>
              <li>EIDE</li>
              <li>SCSI</li>
            </ul>
          </li>
        </ol>
      </td>
    </tr>
  </tbody>
</table>

<p></p>

<p></p>

<h4><strong><img src="images/b-point.gif" alt="point">
 </strong>Les traits horizontaux (HR)</h4>

<p>Les traits horizontaux servent &agrave; d&eacute;limiter visuellement les
diff&eacute;rentes parties d'un document HTML.</p>

<p>Pour ins&eacute;rer un trait horizontal, choisissez l'entr&eacute;e
<strong>Trait horizontal (HR)</strong> du menu
<strong>El&eacute;ments</strong>.</p>

<p></p>

<h4><strong><img src="images/b-point.gif" alt="point">
 </strong>Les divisions (DIV)</h4>

<p>Les divisions englobent une partie d'un document HTML pour la
d&eacute;limiter structurellement du reste du document..</p>

<p>Elles apparaissent dans la vue structure avec le marqueur
<strong>DIV.</strong></p>

<p><img src="images/division.gif" alt="division" border="2" width="277"
height="169"></p>

<p>Elles servent &agrave; structurer les documents de mani&egrave;re plus
nette.</p>

<p>Elles permettent en outre d'appliquer une m&ecirc;me
propri&eacute;t&eacute; (langue dans le cas d'un document multi-langues,
police de caract&egrave;res, couleur de fond...) &agrave; un ensemble
d'&eacute;l&eacute;ments.</p>

<p>Pour ins&eacute;rer une division</p>
<ul>
  <li>s&eacute;lectionnez une ensemble d'&eacute;l&eacute;ments</li>
  <li>choisissez l'entr&eacute;e <strong>Division (Div)</strong> du menu
    <strong>El&eacute;ments</strong>.
    <p></p>
  </li>
</ul>

<h4><strong><img src="images/b-point.gif" alt="point">
 </strong>Les ent&ecirc;tes</h4>

<p>Les ent&ecirc;tes servent &agrave; mettre du texte en relief.</p>

<p>Il existes plusieurs tailles d'ent&ecirc;tes (tailles de 1 &agrave; 6)</p>

<p>Pour ins&eacute;rer une ent&ecirc;te, cliquez sur l'une des ic&ocirc;nes
<img src="images/h.gif" alt="h" align="middle"> ou choisissez
l'entr&eacute;e<strong> Heading</strong> dans le menu
<strong>El&eacute;ments</strong>.</p>

<p></p>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 Les liens</h3>

<p></p>

<p><strong>Cr&eacute;er un lien interne</strong></p>

<p>Pour cr&eacute;er un lien interne (un lien pointant sur un document
local)</p>
<ol>
  <li>Ouvrez le document cible (sautez cette &eacute;tape s'il s'agit du
    m&ecirc;me document)</li>
  <li>S&eacute;lectionnez tout d'abord la cible et choisissez l'entr&eacute;e
    <strong>Cr&eacute;er cible</strong> du menu <strong>Liens</strong>.
    <p>Pour rendre ce lien  visible, cochez la case <strong>Montrer les
    cibles</strong> du menu <strong>Vues</strong>.</p>
    <p>Vous voyez appara&icirc;tre le symbole <img src="images/cible.gif"
    alt="cible" align="middle"> &agrave; c&ocirc;t&eacute; de la cible
    choisie. Ces symboles ne font pas partie du document. Leur r&ocirc;le est
    de rendre visible les cibles.</p>
  </li>
  <li>Choisissez l'&eacute;l&eacute;ment source (&agrave; partir duquel vous
    acc&eacute;derez &agrave; la cible).</li>
  <li>S&eacute;lectionnez-le et choisissez l'entr&eacute;e
    <strong>Cr&eacute;er / changer lien</strong> du menu
    <strong>Liens</strong>. Le pointeur de  la souris change d'apparence pour
    ressembler &agrave; une main directionelle.</li>
  <li>Cliquez sur la cible pr&eacute;c&eacute;demment d&eacute;finie (symbole
    <img src="images/cible.gif" alt="cible" align="middle">
     ). La source devient une ancre, par d&eacute;faut de couleur bleue. Le
    lien est effectu&eacute;.</li>
</ol>

<p></p>

<p><strong>Cr&eacute;er un lien vers une page Web</strong></p>

<p>Pour cr&eacute;er un lien vers une page Web</p>
<ol>
  <li>Choisissez l'&eacute;l&eacute;ment source</li>
  <li>Cliquez sur l'entr&eacute;e <strong>Cr&eacute;er / changer lien
    </strong>du menu <strong>Liens. </strong>Le pointeur de  la souris change
    d'apparence pour ressembler &agrave; une main directionelle.</li>
  <li>Cliquez n'importe ou dans la page sauf sur une cible. Une bo&icirc;te de
    dialogue vous propose alors d'entrer une URL cible.</li>
  <li>Entrez cette URL et validez. Une fois le lien cr&eacute;&eacute;,
    v&eacute;rifiez sa validit&eacute; en suivant le lien.
    <p>Si le lien est incorrect, Amaya affichera un message d'erreur.</p>
  </li>
</ol>

<p></p>

<p><strong>Modification d'un lien</strong></p>

<p>Pour modifier un lien</p>
<ol>
  <li>S&eacute;lectionner l'ancre du lien</li>
  <li>Choisissez l'entr&eacute;e <strong>Cr&eacute;er / changer lien</strong>
    du menu <strong>Liens</strong></li>
  <li>Proc&eacute;dez ensuite de la m&ecirc;me fa&ccedil;on que lors d'une
    cr&eacute;ation.</li>
</ol>

<p>Vous pouvez aussi &eacute;diter l'attribut <em>href </em>soit dans la vue
structure ou dans la vue liens.</p>

<p><strong>Suppression d'un lien</strong></p>
<ol>
  <li>S&eacute;lectionnez l'ancre du lien (elle appara&icirc;t en bleu)</li>
  <li>choisissez l'entr&eacute;e <strong>D&eacute;truire ancre</strong> du
    menu <strong>Liens</strong></li>
</ol>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 Images et zones actives</h3>

<p></p>

<p><strong>Ins&eacute;rer une image</strong></p>

<p>Pour ins&eacute;rer une image</p>
<ol>
  <li>Placer le curseur au futur emplacement de l'image</li>
  <li>Choisissez l'ic&ocirc;ne <img src="images/image.gif" alt="image"
    align="middle">
     ou l'entr&eacute;e <strong>Image (IMG)</strong> du menu<strong>
    El&eacute;ments</strong>. Une bo&icirc;te de dialogue vous propose de
    choisir une image dans l'arborescence de votre disque.</li>
  <li>S&eacute;lectionner un format dans d'image dans le champ
    <strong>Filtre</strong> et validez en cliquant sur
    <strong>Filtrer</strong>.</li>
  <li>Remplissez le champ <strong>ALT</strong> (texte de remplacement). Ce
    champ est obligatoire. Il contient le texte de remplacement de l'image (le
    nom qui sera affich&eacute; dans la vue altern&eacute;e (Cf Vues) ou
    occasionnellement dans la vue formatt&eacute;e ).</li>
  <li>Cliquez sur <strong>Confirmer</strong></li>
</ol>

<p></p>

<p><strong>Image de fond</strong></p>

<p>Pour ins&eacute;rer une image de fond</p>
<ol>
  <li>Choisissez l'entr&eacute;e <strong>Image de fond</strong> dans le menu
    <strong>Style</strong>.</li>
  <li>Proc&eacute;dez ensuite comme pour l'insertion d'une image.
    (&eacute;tapes 3 et 4 de <strong>Ins&eacute;rer une image</strong>)</li>
  <li>Choisissez un <strong>mode de r&eacute;p&eacute;tition</strong>. Ce mode
    permet de choisir la fa&ccedil;on dont l'image (dont la taille est
    rarement celle de l'espace de la page ) va &ecirc;tre
    r&eacute;p&eacute;t&eacute;e pour remplir la page.</li>
</ol>

<p></p>

<p><strong>Redimensionner une image</strong></p>

<p></p>

<p>Pour redimensionner une image</p>
<ol>
  <li>S&eacute;lectionnez l'image (l'image est s&eacute;lectionn&eacute;e
    lorsqu'elle est entour&eacute;e de poign&eacute;es en forme de petits
    carr&eacute;s)</li>
  <li>Placez la souris sur la poign&eacute;e du coin sup&eacute;rieur
  droit</li>
  <li>D&eacute;placez la souris vers l'int&eacute;rieur de l'image en
    maintenant la touche Ctrl et le bouton du milieu de la souris
    enfonc&eacute;s.</li>
</ol>

<p>Vous pouvez aussi &eacute;diter les attributs <strong>width</strong> et
<strong>height</strong> (largeur et hauteur) d'une image dans la vue
structure.</p>

<p>Exemple : <span style="color: #0000FF">IMG src</span>=bonjour.gif <span
style="color: #0000FF">alt</span>=bonjour <span style="color:
#0000FF">width</span>=300 <span style="color: #0000FF">height</span>=200</p>

<p></p>

<p><strong>Cr&eacute;er une zone active</strong></p>

<p></p>

<p>Une zone active (AERA) est une zone d'image associ&eacute;e &agrave; un
lien.</p>

<p>Pour comprendre son utilit&eacute;, imaginez que nous voulions pouvoir
acc&eacute;der &agrave; des guides touristique de chaque r&eacute;gion.</p>

<p>Nous disposons de cette carte des r&eacute;gions de France.</p>

<p><img src="images/france.gif" alt="ds" width="252" height="232"></p>

<p>Il serait pratique de pouvoir cliquer sur la r&eacute;gion concern&eacute;e
et d'avoir ainsi acc&egrave;s au document sue cette r&eacute;gion..</p>

<p>Ceci est rendu possible par les zones actives.</p>

<p></p>

<p>Pour cr&eacute;er une zone active</p>
<ol>
  <li>Rendez les zone actives visible en choisissant l'entr&eacute;e
    <strong>Montrer les zones actives</strong> du menu
  <strong>Vue</strong></li>
  <li>S&eacute;lectionner une image</li>
  <li>Choisissez <strong>Zone Active (AERA)</strong> du menu
    <strong>El&eacute;ments</strong>.</li>
  <li>Choisissez entre <strong>Cercle</strong>, <strong>polygone</strong> et
    <strong>rectangle</strong></li>
  <li>Dessiner votre zone
    <ul>
      <li>Pour cr&eacute;er une zone rectangulaire ou circulaire
        <ol>
          <li>S&eacute;lectionnez d'abord la position du premier coin en
            appuyant sur le bouton souris gauche</li>
          <li>Maintenez le bouton appuy&eacute; et d&eacute;placez le pointeur
            sur la position du coin oppos&eacute;</li>
          <li>rel&acirc;chez le bouton. La zone est d&eacute;finie.</li>
        </ol>
      </li>
      <li>Pour cr&eacute;er une polygone, entrez chaque point en cliquant sur
        les positions correspondantes avec le bouton gauche de la souris.
        <p>Pour sp&eacute;cifier le dernier point, cliquez avec le bouton du
        milieu.</p>
      </li>
    </ul>
  </li>
  <li>Rendez votre zone visible en choisissant l'entr&eacute;e <strong>Montrer
    les zones actives</strong> du menu <strong>Vues</strong>.</li>
  <li>Remplissez l'attribut<strong> ALT</strong> (texte de remplacement). Le
    pointeur change d'aspect (main directionnelle).</li>
  <li>Choisissez une cible</li>
</ol>

<p>Exemple :</p>

<p>Les zones actives sont entour&eacute;es d'un trait bleu.</p>

<p>Dans cet exemple, lorsqu'un utilisateur clique sur la roue avant, un lien
le conduit vers le site http://michelin.com</p>

<p>S'il clique sur le motard, il acc&egrave;de au site
http://www.motobiker.com.</p>

<table border="1">
  <caption></caption>
  <tbody>
    <tr>
      <td><img src="images/motobike.gif" alt="motobike" width="116"
        height="151">
      </td>
      <td><p><strong>Voici comment les zones sont affich&eacute;es dans la vue
        structure</strong></p>

        <p></p>

        <p><span style="color: #5500FF">AERA shape=circle
        coords=</span>35,157,35 <span style="color: #5500FF">alt=</span>roue
        avant <span style="color:                
        #5500FF">href=</span>http://www.michelin.com</p>

        <p></p>

        <p><span style="color: #5500FF">AERA shape=poly
        coords=</span>108,141,96,....,122 <span style="color:                
        #5500FF">alt=</span>motobiker <span style="color:                
        #5500FF">href=</span>http://www.motobiker.com</p>
      </td>
    </tr>
  </tbody>
</table>
<map name="map">
  <area shape="circle" coords="37,162,37" alt="roue avant"
  href="http://www.michelin.com">
  <area shape="poly"
  coords="111,22,134,24,135,79,133,93,127,104,121,104,119,134,132,140,109,166,100,166,108,138,0,-18971,98,91,99,86,92,80,96,75,94,61,84,54,76,54,69,61,62,60,58,70,49,70,0,1179,53,47,66,43,74,41,82,32,77,26,73,22,83,4,93,0,105,2,111,16,110,22,0,-18966"
  alt="motobiker" href="http://www.motobiker.com">
</map>

<p></p>

<p><strong>Modifier la g&eacute;om&eacute;trie d'une zone active</strong></p>
<ol>
  <li>Assurez vous que les zones actives sont visibles (<strong>Montrer les
    zones actives</strong> du menu <strong>Vues</strong>)</li>
  <li>S&eacute;lectionnez la zone active &agrave; modifier. Les zones actives
    apparaissent avec des poign&eacute;es (carr&eacute;s noirs).</li>
  <li>Choisissez une des poign&eacute;es de la zone active</li>
  <li>Appuyez sur la touche <strong>Ctrl</strong> et cliquez sur la
    poign&eacute;e</li>
  <li>D&eacute;placez la souris pour d&eacute;placer la poign&eacute;e
    jusqu'&agrave; la position d&eacute;sir&eacute;e</li>
  <li>Rel&acirc;chez le bouton.</li>
</ol>

<p>Vous pouvez aussi modifier les param&egrave;tres de l'attribut
<strong>coord</strong> dans la vue structure.</p>

<p>Exemple : AERA shape=poly <span style="color:
#FF0080">coords=108,141,96,....,122</span> alt=motobiker
href=http://www.motobiker.com</p>

<p></p>

<p><strong>D&eacute;placer une zone active</strong></p>

<p>Lorsqu'une zone active est d&eacute;finie, vous pouvez la
d&eacute;placer</p>
<ul>
  <li>en d&eacute;pla&ccedil;ant la souris, touche <strong>Ctrl </strong>et
    bouton gauche de la souris enfonc&eacute;s</li>
  <li>en &eacute;ditant l'attribut <strong>coords</strong> de la zone active
    dans la vue structure
    <p>Ex : <span style="color: #5500FF">AERA shape=circle</span> <span
    style="color: #5500FF">coords=</span>56,69,24 <span style="color:        
    #5500FF">alt=</span>cercle <span style="color:        
    #5500FF">href=</span>http://www.ics.fr</p>
  </li>
</ul>

<p></p>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 Les tableaux</h3>

<p></p>

<h4>Cr&eacute;er un tableau vide</h4>

<p>Pour cr&eacute;er un tableau,</p>
<ol>
  <li>Cliquez sur l'ic&ocirc;ne <img src="images/tableau.gif" alt="tableau"
    align="middle">
     ou choisissez l'entr&eacute;e <strong>Table</strong> dans le menu<strong>
    El&eacute;ments.</strong></li>
  <li>Entrez les dimensions du tableau (nombre de colonnes, nombre de
  lignes)</li>
  <li>Entrez l'&eacute;paisseur du trait</li>
  <li>Validez avec le bouton <strong>Confirmer</strong>.

    <table border="0">
      <tbody>
        <tr>
          <td><p><br>
            <br>
            Vous obtiendrez un tableau similaire &agrave; celui-ci :</p>
          </td>
          <td>
            <table border="1">
              <caption></caption>
              <tbody>
                <tr>
                  <td lang="fr"></td>
                  <td lang="fr"></td>
                  <td lang="fr"></td>
                  <td></td>
                  <td></td>
                </tr>
                <tr>
                  <td></td>
                  <td></td>
                  <td></td>
                  <td></td>
                  <td></td>
                </tr>
              </tbody>
            </table>
          </td>
        </tr>
      </tbody>
    </table>
  </li>
  <li>Ins&eacute;rez les &eacute;l&eacute;ments dans les cases.
    <p>Les cases s'agrandiront automatiquement en fonction de l'encombrement
    des &eacute;l&eacute;ments ins&eacute;r&eacute;s.</p>
  </li>
</ol>

<p></p>

<p></p>

<h4>Cr&eacute;er un tableau &agrave; partir de texte</h4>

<p>S&eacute;lectionnez le texte &agrave; ins&eacute;rer dans un tableau et
appuyer sur le bouton <img src="images/tableau.gif" alt="tableau"
align="middle"> de la barre d'outils.</p>

<p><strong></strong></p>

<h4>Redimensionner manuellement la largeur d'une case ou d'un tableau</h4>

<p>Pour redimensionner manuellement une case</p>
<ol>
  <li>Placez le curseur dans la case &agrave; redimensionner</li>
  <li>Maintenez la touche Ctrl enfonc&eacute;e</li>
  <li>D&eacute;placez la souris en maintenant le bouton du milieu de la souris
    appuy&eacute;</li>
  <li>Rel&acirc;chez les boutons lorsque la dimension souhait&eacute;e est
    obtenue.</li>
</ol>

<p>Vous pouvez &eacute;galement &eacute;diter l'attribut
<strong>width</strong> du tableau dans la <strong>vue structure</strong>.</p>

<p>Exemple : &lt;table border="1" <span class="relief">width="58%"</span>></p>

<p></p>

<h4>Modifiez l'&eacute;paisseur du trait de tableau</h4>
<ol>
  <li>S&eacute;lectionnez le tableau ( utilisez la touche <strong>Esc</strong>
    jusqu'&agrave; obtenir /TABLE/BODY/HTML)</li>
  <li>Choisissez l'entr&eacute;e <strong>Border</strong> dans le menu
    <strong>Attributs.</strong> Une bo&icirc;te de dialogue vous demande
    l'&eacute;paisseur du trait du tableau.</li>
  <li>Entrez un nombre (entrez 0 si vous voulez que le tableau soit
  invisible)</li>
  <li>Validez en appuyant sur le bouton <strong>Appliquer</strong> puis
    <strong>Terminer</strong>.</li>
</ol>

<p>Vous pouvez &eacute;galement &eacute;diter l'attribut
<strong>border</strong> du tableau dans <strong>la vue structure</strong>.</p>

<p>Exemple : &lt;table <span class="relief">border="1"</span> width="58%"></p>

<p></p>

<h3><img src="images/Pointr.gif" alt="o">
 Math&eacute;matiques</h3>

<p></p>

<p>Amaya permet l'&eacute;dition de formules math&eacute;matiques plus
&eacute;l&eacute;gantes que celles que l'on peut faire avec les ressources de
base &agrave; savoir les tirets et  les slashs.</p>

<p><math>
  <mrow>
    <msqrt>
      <mfrac>
        <mrow>
          <mn>2</mn>
          <mi>x</mi>
          <mo>+</mo>
          <mn>3</mn>
          <mi>y</mi>
        </mrow>
        <msup>
          <mi>x</mi>
          <mn>2</mn>
        </msup>
      </mfrac>
    </msqrt>
    <mtext></mtext>
    <mo>=</mo>
    <mi></mi>
    <mn>2</mn>
  </mrow>
</math>
</p>

<p></p>

<p>Sachez cependant que les formules &eacute;dit&eacute;es avec Amaya ne
seront affichables que par ce logiciel.</p>

<p></p>

<h4>Cr&eacute;er une formule</h4>

<p>Pour cr&eacute;er une formule math&eacute;matique</p>
<ol>
  <li>Cliquez sur l'ic&ocirc;ne <img src="images/math.gif" alt="math"
    align="middle">
     dans la barre d'ic&ocirc;nes. Une nouvelle bo&icirc;te d'outils s'ouvre
    dans une nouvelle fen&ecirc;tre. Placez la o&ugrave; vous voulez dans
    votre espace de travail, elle restera affich&eacute;e tant que vous la
    fermerez pas.</li>
  <li>Placez votre curseur &agrave; l'endroit ad&eacute;quat dans le
  document</li>
  <li>Choisissez un ic&ocirc;ne parmi les 14 propos&eacute;s dans la
    <strong>barre d'outils Maths</strong>. Une trame de votre formule
    appara&icirc;t en gris sur la feuille de travail.</li>
  <li>Compl&eacute;tez cette trame.</li>
</ol>

<p>Vous pouvez aussi utiliser l'entr&eacute;e <strong>Math</strong> du menu
<strong>El&eacute;ments</strong> puis choisir parmi les mod&egrave;les
math&eacute;matiques propos&eacute;s.</p>

<p></p>

<h4>Utiliser l'alphabet grec</h4>

<p></p>

<p>Pour ins&eacute;rer des lettres appartenant &agrave; l'alphabet grec,</p>
<ol>
  <li>Cliquez sur l'ic&ocirc;ne <img src="images/grec.gif" alt="grec"
    align="middle">
     de la <strong>barre d'outils Maths</strong>. La bo&icirc;te d'outil
    <strong>Alphabet Grec</strong> s'affiche. Comme son nom ne l'indique pas,
    elle contient aussi tous les outils math&eacute;matiques pour cr&eacute;er
    des conditions, des appartenances ...</li>
  <li>Placez le curseur au point d'insertion</li>
  <li>Choisissez une lettre grecque ou un symbole math&eacute;matique.</li>
</ol>

<p>Pour fermer la barre d'outil, cliquez sur le bouton
<strong>Annuler</strong> de cette barre.</p>

<p></p>

<p></p>

<p></p>

<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 M</span>ODIFIER DES &Eacute;L&Eacute;MENTS HTML</h2>

<p></p>

<p></p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 &Eacute;diter les attributs d'un &eacute;l&eacute;ment</h3>

<p></p>

<p>Amaya offre deux moyens d'&eacute;diter les attributs:</p>
<ul>
  <li>le menu <strong>Attributs</strong></li>
  <li>la vue <strong>Structure</strong></li>
</ul>

<h4>&Eacute;diter les attributs avec le menu Attributs</h4>

<p>Le menu <strong>Attribut</strong> liste tous les attributs qui peuvent
&ecirc;tre associ&eacute;s &agrave; l'&eacute;l&eacute;ment
s&eacute;lectionn&eacute;.</p>

<p>Pour &eacute;diter un attribut</p>
<ol>
  <li>S&eacute;lectionnez l'&eacute;l&eacute;ment appropri&eacute;. Vous devez
    s&eacute;lectionner enti&egrave;rement l'&eacute;l&eacute;ment, pas
    seulement un caract&egrave;re de cet &eacute;l&eacute;ment (utilisez la
    touche <strong>Esc</strong>)</li>
  <li>Choisissez l'attribut &agrave; &eacute;diter dans le menu
    <strong>Attributs</strong>. Amaya agit alors en fonction de cet attribut.
    <ul>
      <li>Si l'attribut est un bool&eacute;en (comme <em>ismap</em> pour les
        images), la commande est termin&eacute;e.
        <ul>
          <li>S'il &eacute;tait pr&eacute;sent, l'&eacute;l&eacute;ment est
            retir&eacute;</li>
          <li>S'il n'&eacute;tait pas pr&eacute;sent, l'&eacute;l&eacute;ment
            est ajout&eacute;.</li>
        </ul>
      </li>
      <li>Si l'attribut doit prendre des valeurs limit&eacute;es
        (comme<strong> </strong><em>Align</em> pour un paragraphe ou une
        ent&ecirc;te), une bo&icirc;te de dialogue s'ouvre. Elle contient un
        menu proposant les valeurs autoris&eacute;es pour
        l'&eacute;l&eacute;ment.
        <p></p>
        <p><img src="images/attributalign.gif" alt="Attribut Align"
        width="176" height="124"></p>
        <p></p>
        <ul>
          <li>Si vous voulez cr&eacute;er l'attribut ou changer sa valeur,
            choisissez la valeur d&eacute;sir&eacute;e et cliquez sur le
            bouton <strong>Appliquer</strong>.</li>
          <li>Si vous voulez enlever l'attribut, cliquez sur le bouton
            <strong>Retirer l'attribut.</strong></li>
        </ul>
        <p>Si l'attribut peut prendre des valeurs libres (comme <em>href</em>
        dans une ancre), une bo&icirc;te de dialogue s'affiche. Editez la
        valeur de l'attribut puis cliquez sur le bouton
        <strong>Appliquer</strong>.</p>
        <p></p>
      </li>
    </ul>
  </li>
</ol>

<h4>&Eacute;diter les attributs avec la vue Structure</h4>

<p>Tous les attributs sont affich&eacute;s dans la <strong>vue
Structure</strong>. Les attributs dont la valeur peut &ecirc;tre choisie sans
contraintes sont affich&eacute;es en noir et vous pouvez &eacute;diter leur
valeur comme toute autre cha&icirc;ne de caract&egrave;res. Lorsque la valeur
de l'attribut est affich&eacute;e en bleu, vous ne pouvez pas la changer
autrement qu'avec le menu<strong> Attributs</strong>.</p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Changer le type d'un &eacute;l&eacute;ment</h3>

<p>Pour changer le type d'un &eacute;l&eacute;ment existant,
s&eacute;lectionnez-le et choisissez le nouveau type dans le menu<strong>
El&eacute;ments</strong>.</p>

<p>Vous pouvez ainsi par exemple changer un paragraphe en une liste ou en une
ent&ecirc;te.</p>

<p>Des transformations plus complexes sont possibles (voir Changer la
structure d'un document HTML)</p>

<p></p>

<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 C</span>HANGER LA STRUCTURE D'UN &Eacute;L&Eacute;MENT HTML</h2>

<p></p>

<p>De simples transformations de structure peuvent &ecirc;tre faites avec le
menu <strong>El&eacute;ments</strong> (voir ci-dessus)</p>

<p>Des transformations plus complexes peuvent &ecirc;tre obtenues par d'autres
moyens.</p>

<p></p>

<h3>La commande Transformer</h3>

<p>La commande <strong>Transformer </strong>du menu <strong>Edition</strong>
r&eacute;alise des transformations de structure complexes.</p>

<p>Cette commande ouvre un menu qui liste toutes les transformations
applicables &agrave; la s&eacute;lection courante.</p>

<p>Il est par exemple possible de transformer une liste en tableau.</p>

<p></p>

<h3>Ins&eacute;rer une division</h3>

<p>Il est possible de grouper un ensemble de paragraphes, d'ent&ecirc;tes, de
listes, de tables,... dans une division.</p>
<ol>
  <li>S&eacute;lectionnez l'ensemble des &eacute;l&eacute;ments</li>
  <li>Choisissez l'entr&eacute;e <strong>DIV</strong> du menu
    <strong>El&eacute;ments</strong></li>
</ol>

<h3>Les touches Retour arri&egrave;re et Effacer</h3>

<p>Des &eacute;l&eacute;ments successifs peuvent &ecirc;tre unis, m&ecirc;me
s'ils ne sont pas au m&ecirc;me niveau dans la structure du document.</p>

<p>L'union peut &ecirc;tre r&eacute;alis&eacute;e &agrave; l'aide des touches
<strong>Retour arri&egrave;re</strong> et <strong>Effacer</strong>. Lorsque le
point d'insertion est &agrave; la fin d'un &eacute;l&eacute;ment, utilisez la
touche <strong>Effacer</strong>, lorsqu'il est au d&eacute;but, utilisez la
touche <strong>Retour arri&egrave;re</strong>. Dans les deux cas, ces touches
n'effacent aucun caract&egrave;re, mais rassemblent les &eacute;l&eacute;ments
qui sont s&eacute;par&eacute;s par un marqueur de structure.</p>

<p>Lorsque le point d'intersection est &agrave; l'int&eacute;rieur d'un
&eacute;l&eacute;ment, ces deux touches effacent le caract&egrave;re
pr&eacute;c&eacute;dent et suivant, comme d'habitude.</p>

<p></p>

<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 C</span>HANGER LA PR&Eacute;SENTATION D'UN DOCUMENT HTML</h2>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Num&eacute;roter les sections d'un document</h3>

<p>Les sections ent&ecirc;tes (&eacute;l&eacute;ments<math>
  <mrow>
    <msub>
      <mi>H</mi>
      <mi>n</mi>
    </msub>
  </mrow>
</math>
 ) peuvent &ecirc;tre automatiquement num&eacute;rot&eacute;es selon la
structure du document.</p>

<p>La commande <strong>Num&eacute;roter les sections</strong> du menu
<strong>Sp&eacute;cial</strong> est un bool&eacute;en qui permet d'activer ou
de d&eacute;sactiver cette fonction.</p>

<p>Lorsqu'elle est activ&eacute;e, cette fonction attribue &agrave; toutes les
ent&ecirc;tes un num&eacute;ro. Ce num&eacute;ro est calcul&eacute; en
fonction du type de l'ent&ecirc;te (<math>
  <mrow>
    <msub>
      <mi>H</mi>
      <mi>n</mi>
    </msub>
    <mo>)</mo>
    <mi></mi>
  </mrow>
</math>
 et de sa position dans la structure du document.</p>

<p>Ces num&eacute;ros sont affich&eacute;s en bleu devant les ent&ecirc;tes et
ne peuvent &ecirc;tre &eacute;dit&eacute;s directement.</p>

<p>Ils seront automatiquement mis &agrave; jour lors de la cr&eacute;ation, la
modification ou la suppression d'une ent&ecirc;te.</p>

<p>Ces num&eacute;ros apparaissent aussi dans la <strong>vue Table des
mati&egrave;res</strong>.</p>

<p>Lors de l'impression du document, les num&eacute;ros de sections
n'appara&icirc;tront que si la fonction est activ&eacute;e.</p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Changer les attributs style d'un &eacute;l&eacute;ment</h3>

<p></p>

<p><strong>Appliquer et mettre &agrave; jour des attributs style</strong></p>

<p>Chacune des quatre entr&eacute;es du menu <strong>Style</strong> appelle un
bo&icirc;te de dialogue permettant d'associer un attribut style aux
&eacute;l&eacute;ments s&eacute;lectionn&eacute;s.</p>
<ul style="width: -6px">
  <li style="width: -6px">l'entr&eacute;e <strong>Style de
    caract&egrave;re</strong> vous permet de choisir une police, le style de
    caract&egrave;re, la taille du caract&egrave;re et le style
    soulign&eacute;.</li>
  <li>l'entr&eacute;e<strong> Couleurs</strong> permet de choisir la couleur
    d'avant et d'arri&egrave;re plan dans une palette.
    <p>Cliquez dans une cellule dans la palette avec le bouton gauche pour
    choisir la couleur d'avant plan, cliquez sur le bouton du milieu pour
    choisir la couleur d'arri&egrave;re plan.</p>
  </li>
  <li>l'entr&eacute;e <strong>Format</strong> permet de d&eacute;finir
    l'alignement, le renfoncement, la justification et les interlignes.</li>
  <li>l'entr&eacute;e <strong>Image de fond</strong> permet de choisir une
    image de fond et un mode de r&eacute;p&eacute;tition
    <p></p>
  </li>
</ul>

<p></p>

<p>Dans les bo&icirc;tes de dialogue ouvertes par ces commandes, le bouton
<strong>D&eacute;faut</strong> permet de supprimer l'information de style
correspondant.</p>

<p></p>

<h3><img src="images/b-point.gif" alt="point">
 Utiliser les feuilles de style</h3>

<p></p>

<h4>Qu'est ce qu'une feuille de style ?</h4>

<p>Les feuilles de style donnent la possibilit&eacute; de contr&ocirc;ler la
pr&eacute;sentation d'un document HTML sans toucher &agrave; sa structure de
base.</p>

<p>Elles permettent par exemple de d&eacute;finir la couleur, la fonte des
ent&ecirc;tes, des tableaux ou de tout autre &eacute;l&eacute;ment HTML. Par
la suite, vous pourrez retrouver ce style lorsque vous cr&eacute;ez un nouveau
tableau ou une nouvelle ent&ecirc;te.</p>

<p>Il existe principalement deux fa&ccedil;ons d'introduire des feuilles de
style dans une page HTML :</p>
<ul>
  <li>Utiliser des classes
    <p>On d&eacute;crit les styles de la page dans l'ent&ecirc;te du document
    (HEAD) entre les balises &lt;STYLE> et &lt;/STYLE></p>
    <p><em>&lt;style type="text/css"> .relief { color: #E50073}
    &lt;/style></em></p>
  </li>
  <li>Utiliser un fichier externe
    <p>On d&eacute;crit le style des pages dans un document d'extension .css
    ext&eacute;rieur au fichier HTML. Le lien se fait par la balise &lt;LINK>
    dans l'ent&ecirc;te du document.</p>
    <p>Exemple: <em>&lt;link href="/templates/ambiamce.css" rel="STYLESHEET"
    type="text/css"></em></p>
    <p>Voici un exemple de ficher externe :</p>

    <table border="1">
      <tbody>
        <tr>
          <td>body { background : feffef;       color : black;     }
            <p>h5,h6 {text-align : left;                   color : 99994f;
            }</p>
            <p>h4 {text-align : left;                   color :  99994f; }</p>
            <p>.background {background : green;             color : white;
            }</p>
          </td>
        </tr>
      </tbody>
    </table>
  </li>
</ul>

<p><em>ambiance.css</em></p>

<h4>Cr&eacute;er, mettre &agrave; jour des classes</h4>

<p>Lorsqu'un attribut de style a &eacute;t&eacute; associ&eacute; &agrave; un
&eacute;l&eacute;ment (Cf Changer les attributs style d'un
&eacute;l&eacute;ment), vous pouvez utiliser cet &eacute;l&eacute;ment comme
mod&egrave;le pour cr&eacute;er ou modifier une classe.</p>

<p>Pour cr&eacute;er ou mettre &agrave; jour une classe, .</p>
<ol>
  <li>S&eacute;lectionnez l'&eacute;l&eacute;ment (utilisez la touche
    <strong>Esc</strong>). Vous ne devez s&eacute;lectionner qu'un
    &eacute;l&eacute;ment et cet &eacute;l&eacute;ment doit avoir un attribut
    style.</li>
  <li>Choisissez la fonction <strong>Cr&eacute;er une r&egrave;gle</strong> du
    menu <strong>Style</strong>.
    <p>Une bo&icirc;te de dialogue s'ouvre et affiche une liste de
    s&eacute;lecteurs CSS.</p>
    <p>Cette liste contient les classes d&eacute;finies pour le document
    courant (.par_rouge, .H2_vert)</p>
    <p>Elle n'affiche pas les types d'&eacute;l&eacute;ments auxquels des
    styles sont associ&eacute;s (.TABLE, .H2). Ils sont en revanche visibles
    dans la structure du document.</p>
  </li>
  <li>Choisissez un s&eacute;lecteur dans cette liste pour le modifier ou
    entrez un nouveau nom de s&eacute;lecteur ou de style.
    <p>Cliquez sur le bouton <strong>Confirmer</strong>.</p>
    <p>Le style de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; est alors
    associ&eacute; au s&eacute;lecteur choisi et l'attribut style est
    enlev&eacute; du cet &eacute;l&eacute;ment.</p>
    <p>Son contenu est d&eacute;plac&eacute; sur l'&eacute;l&eacute;ment
    style, dans l'ent&ecirc;te (HEAD) du document. Tous les
    &eacute;l&eacute;ments qui correspondent au s&eacute;lecteur sont
    affich&eacute;s avec le nouveau style.</p>
    <p></p>
  </li>
</ol>

<h4>Utiliser des classes</h4>

<p>Lorsque vous avez de nouvelles classes avec la commande
<strong>Cr&eacute;er une r&egrave;gle</strong>, vous pouvez associer ces
classes aux &eacute;l&eacute;ments du  document.</p>

<p>Pour associer une classe &agrave; un &eacute;l&eacute;ment,</p>
<ol>
  <li>S&eacute;lectionnez un &eacute;l&eacute;ment</li>
  <li>Choisissez la fonction<strong> Appliquer une classe </strong>du
    menu<strong> Style</strong>.
    <p>Une bo&icirc;te de dialogue affiche les classes existantes.</p>
  </li>
  <li>Choisissez une de ces classes et cliquez sur <strong>Confirmer</strong>.
    <p>L'&eacute;l&eacute;ment s&eacute;lectionn&eacute; est alors
    affich&eacute; avec le style associ&eacute; &agrave; la classe
    choisie.</p>
  </li>
</ol>

<p>Vous pouvez aussi associer une classe avec un &eacute;l&eacute;ment en
utilisant l'entr&eacute;e <strong>class</strong> du menu
<strong>Attribut</strong>.</p>

<p></p>

<p></p>

<h4>Utiliser des feuilles de styles externes</h4>

<p></p>

<p>L'entr&eacute;e <strong>Feuilles de style</strong> du menu
<strong>Style</strong> permet d'acc&eacute;der &agrave; un ensemble de
commandes.</p>

<p>Ces commandes permettent de manipuler les feuilles de style externes.</p>

<p></p>

<p><strong>Ajouter une feuille de style</strong></p>

<p>Cette commande  ajoute un lien vers une feuille de style externe dans le
document courant.</p>

<p>Elle aura pour effet de rajouter une ligne &lt;LINK> dans l'ent&ecirc;te de
ce document HTML.</p>

<p>Lorsque cette commande est activ&eacute;e, le pointeur se change en main
directionnelle (symbole des liens).</p>

<p>Si le feuille de style d&eacute;sir&eacute;e est d&eacute;ja ouverte dans
une fen&ecirc;tre Amaya, il suffit de cliquer dans cette fen&ecirc;tre pour
cr&eacute;er ce lien.</p>

<p>Sinon, l'utilisateur doit cliquer sur le document. Cette action ouvrira une
bo&icirc;te de dialogue permettant d'entrer l'URL de cette feuille de
style.</p>

<p></p>

<p><strong>Ouvrir une feuille de style</strong></p>

<p>Cette commande ouvre une nouvelle fen&ecirc;tre dont le contenu sera la
feuille de style externe.</p>

<p>Elle ouvre la bo&icirc;te de dialogue<strong> CSS</strong> qui propose de
choisir une feuille de style parmi les feuilles qui ont &eacute;t&eacute;
pr&eacute;c&eacute;demment  ajout&eacute;es.</p>

<p>S&eacute;lectionnez une feuille de style dans la liste affich&eacute;e et
cliquez sur <strong>Confirmer</strong>.</p>

<p></p>

<p><strong>Activer /D&eacute;sactiver une feuille de style</strong></p>

<p>Ces commandes permettent d'activer ou d'enlever les effets d'une des
feuilles de styles externes au le document sourant.. Elle n'affecte pas le
lien entre le document courant et cette feuille de style.</p>

<p></p>

<p><strong>Retirer une feuille de de style</strong></p>

<p>Cette commande permet de retirer une feuille de style du document courant.
Elle agit comme la commande <strong>D&eacute;sactiver</strong> mais elle
retire en plus le lien entre le document et la feuille de style externe.</p>

<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 U</span>TILISER LES OUTILS D'&Eacute;DITION D'AMAYA</h2>

<p></p>

<h3>Utiliser le v&eacute;rificateur d'orthographe</h3>

<p>Amaya dispose d'un v&eacute;rificateur d'orthographe multi-langues.</p>

<p>Un m&ecirc;me document peut &ecirc;tre &eacute;crit en plusieurs langues et
interpr&eacute;t&eacute; comme tel par Amaya gr&acirc;ce &agrave; l'attribut
<strong>lang</strong>.</p>

<p>Cet attribut peur &ecirc;tre associ&eacute; &agrave; tout
&eacute;l&eacute;ment du document, m&ecirc;me &agrave; un simple mot.</p>

<p>Amaya permet en outre d'enrichir le dictionnaire en permettant &agrave;
l'utilisateur d'y ajouter des mots.</p>

<p></p>

<h4>Associer une langue &agrave; un &eacute;l&eacute;ment</h4>

<p>Pour associer une langue &agrave; un &eacute;l&eacute;ment,</p>
<ol>
  <li>S&eacute;lectionnez l'&eacute;l&eacute;ment</li>
  <li>Choisissez l'attribut<strong> lang</strong> du menu
    <strong>Attributs</strong>. La bo&icirc;te de dialogue
    <strong>Langue</strong> appara&icirc;t.
    <p>La langue courante est indiqu&eacute;e dans le champ <strong>Langue
    h&eacute;rit&eacute;e.</strong></p>
  </li>
  <li>S&eacute;lectionnez une langue parmi les 14 propos&eacute;es.</li>
  <li>Cliquez sur le bouton <strong>Appliquer</strong> puis sur le bouton
    <strong>Terminer</strong>.</li>
</ol>

<h4>V&eacute;rifier l'orthographe du document</h4>

<p>Apr&egrave;s avoir appliqu&eacute; une ou des langues aux
&eacute;l&eacute;ments du document</p>
<ol>
  <li>Choisissez la commande <strong>V&eacute;rifier orthographe</strong> du
    menu <strong>El&eacute;ments</strong>.
    <p>La bo&icirc;te de dialogue suivante s'affiche</p>
    <p></p>
    <p><img src="images/spell.gif" alt="spell check" width="218"
    height="183"></p>
    <p style="width: 2px"></p>
    <p>Cette bo&icirc;te de dialogue vous permet de modifier les
    param&egrave;tres de v&eacute;rification et d'interagir avec le
    correcteur.</p>
  </li>
  <li>Modifiez si besoin le <strong>nombre de propositions</strong>.  Il
    s'agit du nombre maximum de proposition que le correcteur proposera pour
    corriger la faute d&eacute;tect&eacute;e. Ce nombre ne peut &ecirc;tre
    sup&eacute;rieur &agrave; 10</li>
  <li>Modifiez si besoin le champ <strong>Ignorer les mots</strong>. Les
    diff&eacute;rents boutons qu'il propose permettent d'ignorer certains mots
    : par exemple les mots contenant  des chiffres ou des caract&egrave;res
    sp&eacute;ciaux.</li>
  <li>Le sous-menu <strong>O&ugrave; corriger</strong> permet de
    sp&eacute;cifier la partie du document sur laquelle la v&eacute;rification
    va s'effectuer. Par d&eacute;faut, la v&eacute;rification se fera
    apr&egrave;s la s&eacute;lection.</li>
  <li>Cliquez sur le bouton <strong>Suivant</strong> pour commencer la
    recherche de fautes d'orthographe.
    <p>Si votre document ne contient aucune faute, le message <strong>Pas
    trouv&eacute;</strong> est affich&eacute; dans le coin inf&eacute;rieur
    gauche de la bo&icirc;te de dialogue.</p>
    <p>L'exemple ci-dessous illustre le cas o&ugrave; une faute d'orthographe
    a &eacute;t&eacute; trouv&eacute;e.</p>

    <table border="0" width="502">
      <caption></caption>
      <tbody>
        <tr>
          <td><img src="images/spellexemple.gif" alt="exemple de correction"
            width="186" height="184">
          </td>
          <td>La langue dans laquelle est effectu&eacute;e la correction est
            affich&eacute;e en haut &agrave; gauche (<em>French</em>)
            <p>Si ce langage ne correspond pas au mot affich&eacute; dans la
            zone <strong>Corriger</strong>, changez l'attribut
            <strong>lang</strong> de ce mot (ou du document). Voir
            <strong>Associer une langue &agrave; un
            &eacute;l&eacute;ment</strong>.</p>
            <p>Le mot erron&eacute; (<em>sup&eacute;rier</em> dans l'exemple)
            appara&icirc;t  dans la zone <strong>Corriger</strong>.  Sous ce
            mot sont affich&eacute;es les propositions pour le corriger
            (<em>sup&eacute;rieur, stup&eacute;fier, exp&eacute;dier</em>)</p>
          </td>
        </tr>
      </tbody>
    </table>
    <p></p>
  </li>
  <li>Pour corriger la faute, vous avez &agrave; votre disposition les
    boutons<strong> Suivant</strong>, <strong>Suivant (+ dic)</strong>,
    <strong>Remplacer </strong>et <strong>Remplacer (+ dic)</strong>
    <ul>
      <li>Le bouton suivant saute la faute courante et cherche la faute
        suivante.</li>
      <li>Le bouton <strong>Remplacer</strong> remplace le mot erron&eacute;
        par la s&eacute;lection (<em>sup&eacute;rieur</em>) situ&eacute;e sous
        la liste des corrections possibles.
        <p>Cette s&eacute;lection peut &ecirc;tre directement
        &eacute;dit&eacute;e dans le cas o&ugrave; le correcteur n'a pas
        trouv&eacute; la bonne correction.</p>
        <p>Une fois ce bouton press&eacute; et l'&eacute;l&eacute;ment
        replac&eacute;, le correcteur passe &agrave; la faute suivante.</p>
      </li>
    </ul>
    <p>Les boutons suivis de<strong> (+ dic) </strong>accomplissent les
    m&ecirc;me t&acirc;ches. Cependant elle ajoutent le mot "erron&eacute;"
    dans le dictionnaire de l'utilisateur.</p>
  </li>
  <li>Continuez cette v&eacute;rification jusqu'a ce que le message <em>Pas
    Trouv&eacute;</em> apparaisse, signifiant ainsi que toutes les fautes ont
    &eacute;t&eacute; signal&eacute;es.</li>
  <li>Cliquez sur le bouton <strong>Terminer </strong>pour fermer la
    bo&icirc;te de dialogue <strong>Corriger</strong>.</li>
</ol>

<p></p>

<h3>Utiliser les commandes Couper / Copier / Coller</h3>

<p>Les commandes <strong>Couper / Copier / Coller </strong>sont disponibles
dans le menu <strong>Edition</strong>.</p>

<p>Ces commandes sont utilis&eacute;es dans de nombreux logiciels.</p>

<p>Nous en rappelons ici le fonctionnement.</p>
<ul>
  <li><strong>Copier</strong> copie le contenu de la s&eacute;lection courante
    dans un tampon. Le contenu pr&eacute;c&eacute;dent du tampon est
    effac&eacute;.</li>
  <li><strong>Couper</strong> r&eacute;alise la m&ecirc;me t&acirc;che mais
    efface cette s&eacute;lection. Le contenu pr&eacute;c&eacute;dent du
    tampon est effac&eacute;.</li>
  <li><strong>Coller</strong> ins&egrave;re le contenu du tampon dans le
    document &agrave; l'emplacement courant du point d'insertion.</li>
</ul>

<p>Attention : Il est impossible de r&eacute;aliser le copier/coller si les
fen&ecirc;tres de travail ne sont pas issues de la m&ecirc;me application
Amaya.</p>

<p></p>

<h3>Chercher et remplacer du texte</h3>

<p></p>

<h4>Rechercher du texte</h4>

<p></p>

<p>La recherche d'un mot ou d'un texte est une fonction tr&egrave;s
utilis&eacute;e en &eacute;dition. Elle permet de chercher un mot ou un
ensemble de mots adjacents.</p>

<p></p>

<p>Pour rechercher du texte</p>
<ol>
  <li>Choisissez l'entr&eacute;e <strong>Rechercher</strong> du menu
    <strong>Edition</strong>.</li>
  <li>Indiquez la partie du document dans laquelle sera effectu&eacute;e la
    recherche  dans la partie<strong> O&ugrave; rechercher</strong> de la
    bo&icirc;te de dialogue <strong>Recherche</strong>.
    <ul>
      <li>Si vous choisissez <strong>Dans la s&eacute;lection</strong>, vous
        devez s&eacute;lectionner un texte.</li>
      <li>Si vous choisissez <strong>Apr&egrave;s la s&eacute;lection</strong>
        ou <strong>Avant la s&eacute;lection</strong>, placez le curseur
        &agrave; la bonne position sur le document.</li>
    </ul>
    <p><strong></strong></p>
    <p></p>
  </li>
  <li>Entrez le texte recherch&eacute; dans <strong>Texte &agrave;
    rechercher</strong>.</li>
  <li>Appuyez sur le bouton <strong>Confirmer</strong>. Le texte
    recherch&eacute;, s'il est pr&eacute;sent dans le document est
    affich&eacute; en surbrillance comme dans l'exemple ci-dessous.
    <p>Dans le cas contraire, le message <strong>Pas trouv&eacute;</strong>
    s'affiche.</p>
    <p></p>
    <p><img src="images/recherche.gif" alt="Exemple de recherche" width="274"
    height="200"></p>
    <p></p>
  </li>
  <li>Cliquez sur le bouton <strong>Sauter</strong> pour poursuivre la
    recherche au reste du document ou cliquez sur <strong>Terminer</strong>
    pour finir la recherche.
    <p></p>
  </li>
</ol>

<p></p>

<p><strong>Remplacer du texte</strong></p>

<p>Proc&eacute;dez de la m&ecirc;me mani&egrave;re que pour une recherche et
entrez simplement le texte de remplacement dans le champ <strong>Texte de
remplacement</strong>.</p>

<p>Choisissez ensuite un mode de remplacement :</p>
<ul>
  <li>Remplacement &agrave; la demande (pour chaque occurrence trouv&eacute;e
    pour le texte recherch&eacute;, il sera demand&eacute; confirmation avant
    le remplacement).
    <p>Lorsque le texte est trouv&eacute;, un clic de souris sur le bouton
    <strong>Confirmer</strong> permet d'effectuer le remplacement.</p>
  </li>
  <li>Remplacement automatique
    <p>Le remplacement est effectu&eacute; automatiquement sur toutes
    occurrences du texte recherch&eacute;. Il faut donc utiliser cette
    commande avec pr&eacute;caution.</p>
  </li>
</ul>

<p></p>

<p></p>

<h3>Cr&eacute;er un livre</h3>

<p>Il est souvent utile de rassembler une collection de documents HTML en un
seule document.</p>

<p>Imaginez par exemple une documentation technique en ligne dont la
premi&egrave;re page est la table des mati&egrave;re.</p>

<p>Chaque rubrique de la table des mati&egrave;re pointe sur un chapitre.
Cette organisation est tr&egrave;s utile pour la consultation avec un
navigateur. En revanche, il faudra imprimer tous les documents un par un pour
imprimer la collection.</p>

<p>Pour cr&eacute;er un livre &agrave; partir de tous ces documents</p>
<ol>
  <li>Ouvrez la page qui contient les liens vers les pages &agrave;
  rassembler</li>
  <li>Lorsque cette page est affich&eacute;e, ouvrez la <strong>vue
    Liens</strong>. Choisissez <strong>Montrer les liens </strong>du menu
    <strong>Vues</strong>.
    <p></p>
  </li>
  <li>S&eacute;lectionnez un lien dont le document cible doit &ecirc;tre
    ins&eacute;r&eacute; dans le livre. Ce lien peut pointer
    indiff&eacute;remment sur document externe ou sur une partie d'un document
    externe. Il suffit pour cela d'ins&eacute;rer une division sur cette
    partie et de la lier.
    <p>Pour la s&eacute;lection, il suffit de cliquer sur l'attribut
    <em>href</em>.</p>
  </li>
  <li>Choisissez l'attribut <em>rel</em> du menu <strong>Attributs</strong>.
    Entrez <strong>chapter</strong> dans la bo&icirc;te de dialogue qui
    s'affiche.</li>
  <li>R&eacute;p&eacute;tez l'op&eacute;ration pour les autres liens.</li>
  <li>Revenez dans la vue formatt&eacute;e et choisissez la commande<strong>
    Faire un livre </strong>dans le menu <strong>Sp&eacute;cial</strong>. Le
    livre est cr&eacute;&eacute;. Tous les chapitres import&eacute;s sont
    s&eacute;par&eacute;s par des divisions (DIV).
    <p></p>
  </li>
</ol>

<p></p>

<p></p>

<h2><span style="font-size: 40pt"><img src="images/fleche.gif" alt="fleche">
 L</span>ES VUES</h2>

<p></p>

<p>Vous pouvez ouvrir et fermer une vue &agrave; n'importe quel moment.</p>

<p>Les vues sont synchrones c'est &agrave; dire qu'une modification ou une
s&eacute;lection sur l'une est imm&eacute;diatement report&eacute;e sur
l'autre</p>

<p></p>

<h3>Ouvrir / Fermer une vue</h3>

<p>Pour ouvrir une vue, choisissez la commande  <strong>Montrer</strong> de la
vue correspondante dans le <strong>menu Vues</strong> .</p>

<p>Cette commande peut aussi &ecirc;tre utilis&eacute;e pour rappeler une
fen&ecirc;tre qui &eacute;tait en arri&egrave;re plan.</p>

<p>Pour fermer la vue, utilisez la commande <strong>Fermer la vue</strong> du
menu <strong>Fichier</strong> de cette vue.</p>

<p></p>

<h3>Utiliser les vues</h3>

<p>Amaya offre plusieurs vues simultan&eacute;e d'un document.</p>

<p>Il est donc possible de travailler sur un document en ayant &agrave; sa
disposition plusieurs fen&ecirc;tres repr&eacute;sentant des vues
diff&eacute;rentes du document.</p>

<p>Les vues disponibles sont:</p>

<h4><img src="images/b-point.gif" alt="point vert">
 la vue formatt&eacute;e</h4>

<p>Cette vue est la vue par d&eacute;faut lorsque vous &eacute;ditez un
document. C'est la vue que vous avez l'habitude de voir lorsque vous
&eacute;ditez un document avec la plupart des outils d'&eacute;dition
HTML.</p>

<p>Contrairement aux autres vues, elle affiche les &eacute;l&eacute;ments
graphiques tels que les images ou les listes.</p>

<p></p>

<p></p>

<h4><img src="images/b-point.gif" alt="point vert">
 la vue structure</h4>

<p>Cette vue monte la structure actuelle du document. Chaque
&eacute;l&eacute;ment est repr&eacute;sent&eacute; par son marqueur HTML,
suivi de ses attributs sur la m&ecirc;me ligne.</p>

<p>Les &eacute;l&eacute;ments qu'il contient sont en dessous contre une ligne
verticale bleue qui montre l'&eacute;tendue de l'&eacute;l&eacute;ment</p>

<p>Les parties affich&eacute;es en noir peuvent &ecirc;tre directement
&eacute;dit&eacute;es.</p>

<p></p>
<img src="images/vuestructure.gif" alt="Vue structure" height="220"
width="345" border="1">


<h4><img src="images/b-point.gif" alt="point vert">
 la vue altern&eacute;e</h4>

<p>Cette vue n'affiche que du texte plein.</p>

<p>Elle permet d'avoir un aper&ccedil;u de la fa&ccedil;on dont un navigateur
texte plein affiche la page.</p>

<p></p>
<img src="images/vuealtenee.gif" alt="Vue alternee" width="345" height="220"
border="1">


<h4><img src="images/b-point.gif" alt="point vert">
 la vue liens</h4>

<p>Cette vue montre toutes les ancres du document, ainsi que les URL sur
lesquelles elles pointent.</p>

<p></p>
<img src="images/vueliens.gif" alt="Vue liens" width="345" height="220"
border="1">


<h4><img src="images/b-point.gif" alt="point vert">
 la vue table des mati&egrave;res</h4>

<p>Cette vue affiche la table des mati&egrave;res du document.</p>

<p>Comme la fonction <strong>Num&eacute;roter les sections</strong>, cette vue
se base sur les ent&ecirc;tes <math>
  <mrow>
    <msub>
      <mi>H</mi>
      <mi>n</mi>
    </msub>
    <mi>du document</mi>
    <mo>.</mo>
  </mrow>
</math>
</p>

<p></p>
<img src="images/vuetable.gif" alt="Vue table des matieres" width="345"
height="220" border="1">


<p></p>

<p></p>

<p></p>

<p><small><a
href="http://www.w3.org/Consortium/Legal/ipr-notice.html#Copyright">Copyright</a>
&nbsp;&copy;&nbsp; 1997 <a href="http://www.w3.org/">W3C</a> (<a
href="http://www.lcs.mit.edu/">MIT</a>, <a
href="http://www.inria.fr/">INRIA</a>, <a
href="http://www.keio.ac.jp/">Keio</a> ), All Rights Reserved. W3C <a
href="http://www.w3.org/Consortium/Legal/ipr-notice.html#Legal
Disclaimer">liability,</a> <a
href="http://www.w3.org/Consortium/Legal/ipr-notice.html#W3C
Trademarks">trademark</a>, <a
href="http://www.w3.org/Consortium/Legal/copyright-documents.html">document
use </a>and <a
href="http://www.w3.org/Consortium/Legal/copyright-software.html">software
licensing </a>rules apply. Your interactions with this site are in accordance
with our <a
href="http://www.w3.org/Consortium/Legal/privacy-statement.html#Public">public</a>
and <a
href="http://www.w3.org/Consortium/Legal/privacy-statement.html#Members">Member</a>
privacy statements.</small></p>

<p></p>

<p></p>
</body>
</html>
